{
  "newsItems": [
    {
      "title": "Tulane research center rebrands to biomedical focus | New Orleans CityBusiness",
      "url": "https://neworleanscitybusiness.com/blog/2025/10/09/tulane-biomedical-research-center-renaming/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://neworleanscitybusiness.com/files/2025/10/2.-Primate-Tulane-story.jpg",
        "1": "https://neworleanscitybusiness.com/files/2023/03/icon-_Search_.png",
        "2": "https://neworleanscitybusiness.com/files/2025/10/2.-Primate-Tulane-story-850x548.jpg",
        "3": "https://neworleanscitybusiness.com/files/2025/10/MAIN-PHOTO-unnamed-304x175.jpg",
        "4": "https://neworleanscitybusiness.com/files/2025/10/2.-Depositphotos-school-bus-304x175.jpg"
      },
      "content": "## Select Region or Brand\n\n- Business New Orleans, LA New Jersey Long Island, NY Oklahoma City, OK Rochester, NY Minnesota Lehigh Valley, PA Lehigh Valley, PA Idaho Mecklenburg, NC Columbia, SC Charleston, SC Greenville, SC South Carolina Color Magazine\n\n- New Orleans, LA\n\n- New Jersey\n\n- Long Island, NY\n\n- Oklahoma City, OK\n\n- Rochester, NY\n\n- Minnesota\n\n- Lehigh Valley, PA\n\n- Lehigh Valley, PA\n\n- Idaho\n\n- Mecklenburg, NC\n\n- Columbia, SC\n\n- Charleston, SC\n\n- Greenville, SC\n\n- South Carolina\n\n- Color Magazine\n\n- Legal Maryland Massachusetts Virginia Missouri Minnesota New York North Carolina South Carolina Wisconsin Michigan Rhode Island\n\n- Maryland\n\n- Massachusetts\n\n- Virginia\n\n- Missouri\n\n- Minnesota\n\n- New York\n\n- North Carolina\n\n- South Carolina\n\n- Wisconsin\n\n- Michigan\n\n- Rhode Island\n\n- Construction Milwaukee, WI Oregon\n\n- Milwaukee, WI\n\n- Oregon\n\n- Home Furnishings Designers Today Furniture Today Gifts & Decorative Accessories Home Accents Today Home Furnishings News Home Textiles Today Pet Age\n\n- Designers Today\n\n- Furniture Today\n\n- Gifts & Decorative Accessories\n\n- Home Accents Today\n\n- Home Furnishings News\n\n- Home Textiles Today\n\n- Pet Age\n\n- News Money Construction & Real Estate Government & Politics Energy Healthcare Law Ports & Transportation Retail & Hospitality Technology Guest Perspective\n\n- Money\n\n- Construction & Real Estate\n\n- Government & Politics\n\n- Energy\n\n- Healthcare\n\n- Law\n\n- Ports & Transportation\n\n- Retail & Hospitality\n\n- Technology\n\n- Guest Perspective\n\n- Commission Accomplished\n\n- Education Guide\n\n- Healthcare Annual\n\n- Maritime & Energy Impact\n\n- On the Market\n\n- Power Lists\n\n- Power Lists: Submit a recommendation\n\n- Q&A\n\n- Reader Rankings\n\n- Real Estate Trends\n\n- Renovation Report\n\n- Top Construction Projects\n\n- In The Lead: Submit a Recommendation\n\n- Special Sections\n\n- Group Subscription\n\n- Press Releases People This Week People This Week Submissions BTM Business Connect Behind the Deal Submissions Local Events Calendar Local Events Submissions\n\n- People This Week\n\n- People This Week Submissions\n\n- BTM Business Connect\n\n- Behind the Deal Submissions\n\n- Local Events Calendar\n\n- Local Events Submissions\n\n- E-Edition Digital Edition Special Publications\n\n- Digital Edition\n\n- Special Publications\n\n- Leads & Data Center About Book of Lists Get On The List\n\n- About\n\n- Book of Lists\n\n- Get On The List\n\n- Advertising Advertising Plaques & Permissions\n\n- Advertising\n\n- Plaques & Permissions\n\n## EVENTS\n\n#### Women of the Year & Nonprofit Organizations nomination form\n\nNovember 3rd, 2025 | 12:00 AM\n\nWomen of the Year recognizes 50 individual women who are leaders in the community, while Nonprofit Organizations recognizes entire organizat[...]\n\n#### Icon Awards\n\nCityBusiness honors outstanding business leaders who have had a lasting influence on the city’s economic development.\n\n#### Best Places to Work\n\nDecember 12th, 2025 | 12:00 AM\n\nStarted in 2003, Best Places to Work recognizes the city’s top employers, including large companies and small. Honorees are chosen based o[...]\n\n## Tulane research center rebrands to biomedical focus\n\nLance Traweek, Editor//October 9, 2025//\n\nMeredith Mayer, a postdoctoral student at the Tulane National Biomedical Research Center, uses a bioprinter to create a hydrogel barrier for a new multicellular 3D model of the blood-brain barrier. The advanced model is just one example of the new technologies driving the center’s expanded research. Photo courtesy Cheryl Gerber.\n\nTulane research center rebrands to biomedical focus\n\nKEY TAKEAWAYS:\n\n- Tulane renames National Primate Research Center to Tulane National Biomedical Research Center.\n\n- Center receives $35M annually from NIH and partners with 500 investigators worldwide.\n\n- Research spans infectious diseases, chronic illness, aging, and neurodegeneration.\n\n- New methodologies include AI, organ-on-a-chip systems, and reduced animal use.\n\nTulane University‘s long-standing National Primate Research Center has officially adopted a new name to reflect its expanding research scope and growing contributions to public health. The facility will now be known as the Tulane National Biomedical Research Center.\n\nThe announcement was made as the center continues to serve as a major hub for biomedical research at its Covington campus, addressing pressing health challenges and advancing scientific understanding.\n\nTulane President Michael A. Fitts emphasized that the new name represents an “exciting chapter” as the center broadens its research efforts beyond primate studies.\n\nSince 1964, the center has been funded by the National Institutes of Health, making it Tulane’s largest and longest-running NIH grant recipient. The facility receives approximately $35 million annually in NIH support, partners with nearly 500 investigators from 155 institutions worldwide, and contributes over $107 million a year to Louisiana’s economy. With more than 350 employees, it is also one of St. Tammany Parish’s largest employers.\n\nThe Tulane National Biomedical Research Center is home to one of the nation’s seven National Primate Research Centers and one of 12 Regional Biocontainment Laboratories, along with a federally regulated Select Agent Program. These facilities underpin its role as a critical component of the U.S. biomedical research infrastructure and a key partner in preparing for emerging health threats.\n\nResearch conducted at the center has advanced understanding of infectious diseases such as HIV/AIDS, tuberculosis, and Lyme disease, while also exploring links between infection, chronic illness, aging, and neurodegeneration. During public health crises, its scientists have provided rapid insights that have informed global responses, including the development of vaccines, diagnostics, and treatments.\n\nIn recent years, the center has expanded its methodologies to include advanced non-animal research tools, such as computer modeling, machine learning, AI-guided analysis, and organ-on-a-chip systems. These approaches complement primate studies, allowing scientists to reduce animal use while generating precise, translatable results.\n\n“Nonhuman primates provide the essential bridge between discovery in the lab and safe, effective therapies for people,” said Jay Rappaport, director and chief academic officer of the center. “At the same time, our science has grown beyond primate research alone. Our new name reflects the full spectrum of work we do, our commitment to using animals responsibly, and the highest standards of scientific integrity that continue to guide everything we do.”\n\nThe rebranding also positions the center to strengthen collaborations with academic, government, and industry partners, solidifying its status as a national leader in biomedical research and innovation.\n\n- Tulane launches Founder Lab to boost innovation\n\n- Lead-resistant lizards in New Orleans could hold clues to combating lead poisoning\n\n- Whooping cough cases on the rise in Louisiana\n\nShare this!\n\n### MARKET SECTORS\n\n## E-MAIL ALERT\n\n## NETWORKING EVENTS\n\n## Related Content\n\n### Delgado Maritime Center unveils major upgrades, new training programs\n\nDelgado Community College renovates its Maritime Center, adding advanced simulators, training pads, and progra[...]\n\nOctober 3, 2025\n\n### Louisiana achieves top reading gains while spending far less per student\n\nLouisiana ranks second nationally in adjusted fourth grade reading scores, despite spending less per student t[...]\n\nOctober 2, 2025\n\n## New Orleans CityBusiness Daily\n\nGet our free New Orleans e-alerts & breaking news notifications!\n\n- By signing up you agree to our\n\n## News\n\n## Ochsner Health launches online genetic cancer risk assessment\n\nOchsner Health debuts Genetic Wellness Assessment to identify hereditary cancer risks and guide personalized prevention and s[...]\n\nWith more than 350 employees, it is one of St. Tammany Parish’s largest employers.\n\n## New Orleans jail escapee agrees to return to Louisiana after being recaptured in Georgia\n\nDerrick Groves, recaptured after five months on the run, agrees to return to Louisiana to face jail escape and murder charges[...]\n\n## Louisiana warns against bad botox after two hospitalizations\n\nState health officials warn that unlicensed or online botox injections can cause severe illness and require hospitalization.\n\n## Average long-term US mortgage rate eases to 6.3%, back to its lowest level in about a year\n\nU.S. 30-year mortgage rates fall to 6.3%, lowest in a year, easing borrowing costs amid ongoing market uncertainty.\n\n## Construction & Real Estate\n\n## Average long-term US mortgage rate eases to 6.3%, back to its lowest l[...]\n\nU.S. 30-year mortgage rates fall to 6.3%, lowest in a year, easing borrowing costs amid on[...]\n\n## Energy\n\nEPA details progress on response to Smitty’s fire\n\n9/10/2025\n\nUS oil production reached record-high 13.6 million barrels a day in Ju[...]\n\n8/10/2025\n\nEnergy initiative details workforce innovation program efforts\n\nIce batteries cool hospitals, lower energy costs\n\n7/10/2025\n\nLDEQ puts Atalco refinery on notice for ‘red mud’ leaks. Fines to [...]\n\n## People This Week\n\nHaley Bible, Kean Miller\n\nStacey Goff, Jones Walker LLP\n\nKatie Lasky, Jones Walker LLP\n\n2/10/2025\n\n### LATEST HEADLINES\n\n### CITYBUSINESS IN PRINT\n\n### PEOPLE IN BUSINESS\n\n### DINING OUT",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "ScienceDaily: Your source for the latest research news",
      "url": "https://www.sciencedaily.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Top Science News\n\nOctober 10, 2025\n\nThousands Fall Ill as Mosquito Fever Explodes Across Southern China Oct. 10, 2025 — China’s Guangdong Province is battling its worst-ever chikungunya outbreak, with thousands of infections spreading across major cities and nearby regions. Transmitted by Aedes mosquitoes, the disease underscores how climate change, urbanization, ... Scientists Unlock Nature’s Secret to a Cancer-fighting Molecule Oct. 10, 2025 — Researchers have cracked the code behind how plants make mitraphylline, a rare cancer-fighting molecule. Their discovery of two critical enzymes explains how nature builds complex spiro-shaped compounds. The work paves the way for sustainable, ... Scientists Discover Brain Circuit That Can Switch Off Chronic Pain Oct. 10, 2025 — Scientists have pinpointed Y1 receptor neurons in the brain that can override chronic pain signals when survival instincts like hunger or fear take precedence. Acting like a neural switchboard, these cells balance pain with other biological needs. ... Scientists Grow Metal Instead of 3D Printing It — And It’s 20x Stronger Oct. 10, 2025 — Scientists at EPFL have reimagined 3D printing by turning simple hydrogels into tough metals and ceramics. Their process allows multiple infusions of metal salts that form dense, high-strength structures without the porosity of earlier methods. ... Why GPS Fails in Cities. and How It Was Brilliantly Fixed Oct. 10, 2025 — Our everyday GPS struggles in “urban canyons,” where skyscrapers bounce satellite signals, confusing even advanced navigation systems. NTNU scientists created SmartNav, combining satellite corrections, wave analysis, and Google’s 3D building ... A Sweet Fix for Baldness? Stevia Compound Boosts Hair Growth Oct. 10, 2025 — Researchers discovered that stevioside, a compound from the Stevia plant, enhances the skin absorption of minoxidil, the main treatment for pattern baldness. In mice, a stevioside-infused patch boosted hair follicle activity and new hair growth. The ... A Hidden “Backup Heater” That Helps Burn Fat and Boost Metabolism Oct. 9, 2025 — Scientists have uncovered a surprising new way the body can burn energy and stay warm. Deep inside fat tissue, they found a hidden system that helps the body use up calories, even without exercise. By studying mice, researchers discovered that brown ... Scientists Stunned by Wild Martian Dust Devils Racing at Hurricane Speeds Oct. 9, 2025 — Mars may look calm, but new research reveals it’s a world of fierce winds and swirling dust devils racing at hurricane-like speeds. Using deep learning on thousands of satellite images from European orbiters, scientists have discovered that ... JWST Spots a Hidden Red Supergiant Just Before It Exploded Oct. 9, 2025 — The James Webb Space Telescope has uncovered a massive red supergiant star just before it exploded, finally solving a cosmic mystery. Hidden beneath layers of dust, the doomed star revealed itself through Webb’s infrared eyes. The finding shows ... Tiny Asteroid Flew Right over Antarctica, and No One Saw It Coming Oct. 9, 2025 — Asteroid 2025 TF zipped past Earth above Antarctica, coming within 428 km of the surface. Roughly the size of a small car, it was detected hours after the flyby and posed no danger. ESA astronomers later confirmed its trajectory with extraordinary ... Common Medications May Secretly Rewire Your Gut for Years Oct. 9, 2025 — Drugs taken years—even decades—ago can leave lasting imprints on the gut microbiome, reshaping the community of microbes long after treatment stops. Scientists analyzing over 2,500 Estonian Biobank samples discovered that antibiotics aren’t ... Glowing Shark and Hidden Crab Found Deep Off Australia Oct. 9, 2025 — In a stunning glimpse into the mysteries of the deep, scientists have uncovered two new marine species off Western Australia—a glowing lanternshark and a tiny porcelain crab. The discoveries, made from specimens collected during a 2022 CSIRO ...\n\n## Latest Top Headlines\n\nupdated 9:17am EDT\n\n[Scientists Suggest the Brain May Work Best With 7 Senses, Not Just 5](https://www.sciencedaily.com/releases/2025/10/251008030955.htm)\n\nOct. 8, 2025 — Scientists at Skoltech developed a new mathematical model of memory that explores how information is encoded and stored. Their analysis suggests that memory works best in a seven-dimensional conceptual space — equivalent to having seven senses. The finding implies that both humans and AI might benefit from broader sensory inputs to optimize learning and ...\n\nRELATED TOPICS\n\n- [Language Acquisition](https://www.sciencedaily.com/news/mind_brain/language_acquisition/) - [Computer Modeling](https://www.sciencedaily.com/news/computers_math/computer_modeling/) - [Neural Interfaces](https://www.sciencedaily.com/news/computers_math/neural_interfaces/)\n\n[Scientists Just Found a Molecule That Could Stop Parkinson’s in Its Tracks](https://www.sciencedaily.com/releases/2025/10/251008030949.htm)\n\nOct. 8, 2025 — Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and improved motor function. The work demonstrates the power of rational drug design in tackling brain diseases that have long lacked effective ...\n\nRELATED TOPICS\n\n- [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/) - [Healthy Aging](https://www.sciencedaily.com/news/health_medicine/healthy_aging/) - [Brain Injury](https://www.sciencedaily.com/news/mind_brain/brain_injury/)\n\n[The Hidden Denisovan Gene That Helped Humans Conquer a New World](https://www.sciencedaily.com/releases/2025/08/250824031540.htm)\n\nOct. 7, 2025 — Ancient humans crossing the Bering Strait into the Americas carried more than tools and determination—they also carried a genetic legacy from Denisovans, an extinct human relative. A new study reveals that a mysterious gene called MUC19, inherited through interbreeding between Denisovans, Neanderthals, and humans, may have played a vital role in helping early Americans survive new diseases, ...\n\nRELATED TOPICS\n\n- [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Early Humans](https://www.sciencedaily.com/news/fossils_ruins/early_humans/) - [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/)\n\n[Bacteria Hidden Inside Tumors Could Help Beat Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm)\n\nOct. 7, 2025 — Scientists have discovered that bacteria living inside tumors can produce a molecule that fights cancer and enhances chemotherapy. The molecule, called 2-methylisocitrate (2-MiCit), was found to make colorectal cancer cells more vulnerable to chemotherapy by damaging their DNA and disrupting their metabolism. Experiments using worms, flies, and human cancer cells confirmed its potent anti-cancer ...\n\nRELATED TOPICS\n\n- [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/) - [Skin Care](https://www.sciencedaily.com/news/health_medicine/skin_care/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Physicists Just Built a Quantum Lie Detector. It Works](https://www.sciencedaily.com/releases/2025/10/251007081840.htm)\n\nOct. 7, 2025 — An international team has confirmed that large quantum systems really do obey quantum mechanics. Using Bell’s test across 73 qubits, they proved the presence of genuine quantum correlations that can’t be explained classically. Their results show quantum computers are not just bigger, but more authentically quantum. This opens the door to more secure communication and stronger quantum ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Computers and Internet](https://www.sciencedaily.com/news/computers_math/computers_and_internet/)\n\n[Scientists Finally Found the “dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm)\n\nOct. 4, 2025 — Scientists at OIST have, for the first time, directly tracked the elusive “dark excitons” inside atomically thin materials. These quantum particles could revolutionize information technology, as they are more stable and resistant to environmental interference than current ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Spintronics Research](https://www.sciencedaily.com/news/computers_math/spintronics/) - [Telecommunications](https://www.sciencedaily.com/news/matter_energy/telecommunications/)\n\n[A Tiny Detector Could Unveil Gravitational Waves We’ve Never Seen Before](https://www.sciencedaily.com/releases/2025/10/251003033920.htm)\n\nOct. 3, 2025 — Researchers have designed a new type of gravitational wave detector that operates in the milli-Hertz range, a region untouched by current observatories. Built with optical resonators and atomic clocks, the compact detectors can fit on a lab table yet probe signals from exotic binaries and ancient cosmic events. Unlike LIGO, they’re relatively immune to seismic noise and could start working long ...\n\nRELATED TOPICS\n\n- [Black Holes](https://www.sciencedaily.com/news/space_time/black_holes/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Physics](https://www.sciencedaily.com/news/matter_energy/physics/)\n\n[This Ultra-Thin Solar Tech Could Power Everything from Phones to Skyscrapers](https://www.sciencedaily.com/releases/2025/10/251001092218.htm)\n\nOct. 2, 2025 — A team in Sweden has unraveled the hidden structure of a promising solar material using machine learning and advanced simulations. Their findings could unlock durable, ultra-efficient solar cells for a rapidly electrifying ...\n\nRELATED TOPICS\n\n- [Chemistry](https://www.sciencedaily.com/news/matter_energy/chemistry/) - [Nanotechnology](https://www.sciencedaily.com/news/matter_energy/nanotechnology/) - [Energy and Resources](https://www.sciencedaily.com/news/matter_energy/energy_and_resources/)\n\n[The Red Sea That Vanished and the Catastrophic Flood That Brought It Back](https://www.sciencedaily.com/releases/2025/10/251007081831.htm)\n\nOct. 8, 2025 — Researchers at KAUST have confirmed that the Red Sea once vanished entirely, turning into a barren salt desert before being suddenly flooded by waters from the Indian Ocean. The flood carved deep channels and restored marine life in less than 100,000 years. This finding redefines the Red Sea’s role as a key site for studying how oceans form and evolve through extreme geological ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/) - [Global Warming](https://www.sciencedaily.com/news/earth_climate/global_warming/)\n\n[From Gentle Giants to Ghostly Hunters, Sharks Face an Unseen Peril](https://www.sciencedaily.com/releases/2025/10/251004092909.htm)\n\nOct. 5, 2025 — New research reveals that deep-sea mining could dramatically threaten 30 species of sharks, rays, and ghost sharks whose habitats overlap with proposed mining zones. Many of these species, already at risk of extinction, could face increased dangers from seafloor disruptions and sediment plumes caused by mining ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/)\n\n[Japan’s Hot Springs Hold Clues to the Origins of Life on Earth](https://www.sciencedaily.com/releases/2025/10/251002074009.htm)\n\nOct. 3, 2025 — Billions of years ago, Earth’s atmosphere was hostile, with barely any oxygen and toxic conditions for life. Researchers from the Earth-Life Science Institute studied Japan’s iron-rich hot springs, which mimic the ancient oceans, to uncover how early microbes survived. They discovered communities of bacteria that thrived on iron and tiny amounts of oxygen, forming ecosystems that recycled ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Environmental Science](https://www.sciencedaily.com/news/earth_climate/environmental_science/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/)\n\n[Scientists Just Recreated a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm)\n\nOct. 2, 2025 — In 2020, California’s Creek Fire became so intense that it generated its own thunderstorm, a phenomenon called a pyrocumulonimbus cloud. For years, scientists struggled to replicate these explosive fire-born storms in climate models, leaving major gaps in understanding their global effects. Now, a new study has finally simulated them successfully, reproducing the Creek Fire’s storm and others ...\n\nRELATED TOPICS\n\n- [Severe Weather](https://www.sciencedaily.com/news/earth_climate/severe_weather/) - [Air Quality](https://www.sciencedaily.com/news/earth_climate/air_quality/) - [Natural Disasters](https://www.sciencedaily.com/news/earth_climate/natural_disasters/)\n\n- Top Health - [Humans Might Work Better With 7 Senses](https://www.sciencedaily.com/releases/2025/10/251008030955.htm) - [Molecule Could Stop Parkinson’s in Its Tracks](https://www.sciencedaily.com/releases/2025/10/251008030949.htm) - [Ancient DNA Secret That Shaped Human Survival](https://www.sciencedaily.com/releases/2025/08/250824031540.htm) - [Bacteria Hidden in Tumors Help Kill Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm) - Top Physical/Tech - [Physicists Built a Quantum Lie Detector](https://www.sciencedaily.com/releases/2025/10/251007081840.htm) - [The “Dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm) - [Tiny Detector Unlocks Hidden Gravitational Waves](https://www.sciencedaily.com/releases/2025/10/251003033920.htm) - [Ultra-Thin Solar Tech Could Power Everything](https://www.sciencedaily.com/releases/2025/10/251001092218.htm) - Top Environment - [When the Red Sea Became a Desert](https://www.sciencedaily.com/releases/2025/10/251007081831.htm) - [Ghost Sharks Face a Hidden Deep-Sea Threat](https://www.sciencedaily.com/releases/2025/10/251004092909.htm) - [Hot Springs Hold Clues to the Origins of Life](https://www.sciencedaily.com/releases/2025/10/251002074009.htm) - [Recreating a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm)\n\nmore top science stories\n\n/Top Science News\n\nHealth News\n\n## Health News\n\nOctober 10, 2025\n\nScientists Finally Reveal What’s Behind Long COVID’s Mysterious Brain Fog Oct. 7, 2025 — Researchers in Japan have pinpointed a biological cause of Long COVID brain fog using advanced PET brain imaging. They discovered widespread increases in AMPA receptor density linked to cognitive ... New Research Reveals What’s Really Hiding in Bottled Water Oct. 6, 2025 — A chance encounter with plastic waste on a tropical beach sparked a deep investigation into what those fragments mean for human health. The research reveals that bottled water isn’t as pure as it seems—each sip may contain invisible ... It’s Not Just Genes — Parents Can Pass Down Longevity Another Way Oct. 6, 2025 — Scientists studying tiny roundworms have uncovered how the secrets of a long life can be passed from parents to their offspring — without changing DNA. The discovery shows that when certain cellular structures called lysosomes change in ways that ... Nearly Half of Drivers Killed in Crashes Had THC in Their Blood Oct. 5, 2025 — Over 40% of fatal crash victims had THC levels far above legal limits, showing cannabis use before driving remains widespread. The rate didn’t drop after legalization, suggesting policy changes haven’t altered risky habits. Experts warn that the ... Why the Brain’s GPS Fails with Age, and How Some Minds Defy It Oct. 5, 2025 — Stanford scientists found that aging disrupts the brain’s internal navigation system in mice, mirroring spatial memory decline in humans. Older mice struggled to recall familiar locations, while a few “super-agers” retained youthful brain ... Why Ultra-processed Foods Aren’t the Real Villain Behind Overeating Oct. 5, 2025 — Researchers from Leeds found that overeating is driven more by what people believe about food than by its actual ingredients or level of processing. Foods perceived as fatty, sweet, or highly processed were more likely to trigger indulgence. ... Scientists Discover Hidden Protein That Switches Off Hunger Oct. 5, 2025 — Researchers have uncovered how a protein called MRAP2 acts as a key regulator of hunger. It helps move the appetite receptor MC4R to the cell’s surface, allowing it to send stronger “stop eating” signals. The discovery offers new hope for ... Think Light Drinking Protects Your Brain? Think Again Oct. 4, 2025 — A massive new study combining observational and genetic data overturns the long-held belief that light drinking protects the brain. Researchers found that dementia risk rises in direct proportion to alcohol consumption, with no safe level ... This New Semaglutide Dose Helped Nearly Half of Patients Lose 20% Body Weight Oct. 4, 2025 — The STEP UP trials revealed that a 7.2 mg dose of semaglutide led to greater weight loss than the currently approved 2.4 mg dose. Nearly half of participants lost 20% or more of their body weight, ... Hidden Cellular “Power Switch” Could Transform Parkinson’s Treatment Oct. 4, 2025 — Researchers uncovered a key cellular regulator, PP2A-B55alpha, that controls both the cleanup of damaged mitochondria and the creation of new ones. In Parkinson’s disease models, reducing this regulator improved symptoms and mitochondrial health. ... Doctors Stunned by a Cheap Drug’s Power Against Colon Cancer Oct. 4, 2025 — A Scandinavian clinical trial has revealed that low-dose aspirin can halve the risk of colon and rectal cancer recurrence in patients with specific genetic mutations. The research, involving over 3,500 patients, is the first randomized study to ... Fat May Secretly Fuel Alzheimer’s, New Research Finds Oct. 3, 2025 — New research from Houston Methodist reveals how obesity may directly drive Alzheimer’s disease. Scientists discovered that tiny messengers released by fat tissue, called extracellular vesicles, can carry harmful signals that accelerate the buildup ...\n\n## Latest Health Headlines\n\nupdated 9:17am EDT\n\n[New Pill Could Finally Control Stubborn High Blood Pressure](https://www.sciencedaily.com/releases/2025/10/251008030947.htm)\n\nOct. 8, 2025 — A new pill called baxdrostat may offer hope for people whose blood pressure stays high even after taking standard medications. In a recent study, the drug lowered blood pressure and also seemed to protect the kidneys by reducing signs of damage. Doctors say this could help millions of people with chronic kidney disease, a condition that often makes blood pressure harder to ...\n\nRELATED TOPICS\n\n- [Hypertension](https://www.sciencedaily.com/news/health_medicine/hypertension/) - [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/)\n\n[Scientists Reveal Green Tea’s Fat-Burning Secret](https://www.sciencedaily.com/releases/2025/10/251008030951.htm)\n\nOct. 8, 2025 — New research shows green tea may help the body burn fat and balance blood sugar. In a study with obese mice, it improved metabolism and muscle health without harming lean animals. Scientists say its powerful plant compounds work together to regulate fat and energy use. The findings hint that green tea could be a natural support for healthy weight ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Nutrition](https://www.sciencedaily.com/news/health_medicine/nutrition/)\n\n[A Psychedelic Surprise: DMT Helps the Brain Heal After Stroke](https://www.sciencedaily.com/releases/2025/10/251006051129.htm)\n\nOct. 7, 2025 — Scientists have discovered that DMT, a natural compound found in plants and even the human brain, can dramatically reduce brain damage caused by stroke. The psychoactive molecule, long known for its hallucinogenic effects, restored the blood-brain barrier and reduced inflammation in animal and cell studies. These findings suggest that DMT could complement existing stroke treatments, potentially ...\n\nRELATED TOPICS\n\n- [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/) - [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/)\n\n[Scientists Find Brain Circuit That Traps Alcohol Users in the Vicious Cycle of Addiction](https://www.sciencedaily.com/releases/2025/10/251006051124.htm)\n\nOct. 7, 2025 — Addiction often isn’t about chasing pleasure—it’s about escaping pain. Researchers at Scripps Research have discovered that a tiny brain region called the paraventricular nucleus of the thalamus (PVT) becomes hyperactive when animals learn that alcohol eases the agony of withdrawal. This circuit helps explain why people relapse: their brains ...\n\nRELATED TOPICS\n\n- [Nervous System](https://www.sciencedaily.com/news/health_medicine/nervous_system/) - [Neuroscience](https://www.sciencedaily.com/news/mind_brain/neuroscience/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Scientists Find Hidden Brain Damage Behind Dementia](https://www.sciencedaily.com/releases/2025/10/251005085637.htm)\n\nOct. 6, 2025 — A University of New Mexico scientist is revealing what might be one of the most overlooked causes of dementia — damage in the brain’s tiny blood vessels. Dr. Elaine Bearer has created a new way to classify these changes, showing that many people diagnosed with Alzheimer’s also suffer from vascular damage that quietly destroys brain tissue. Even more surprising, she’s finding microplastics ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Hypertension](https://www.sciencedaily.com/news/health_medicine/hypertension/) - [Dementia](https://www.sciencedaily.com/news/mind_brain/dementia/)\n\n[Brain Cancer That Eats the Skull Stuns Scientists](https://www.sciencedaily.com/releases/2025/10/251005085618.htm)\n\nOct. 5, 2025 — A new study shows glioblastoma isn’t confined to the brain—it erodes the skull and hijacks the immune system within skull marrow. The cancer opens channels that let inflammatory cells enter the brain, fueling its deadly progression. Even drugs meant to protect bones can make things worse, highlighting the need for therapies that target both brain and bone. The discovery reframes glioblastoma ...\n\nRELATED TOPICS\n\n- [Medical Imaging](https://www.sciencedaily.com/news/health_medicine/medical_imaging/) - [Today's Healthcare](https://www.sciencedaily.com/news/health_medicine/today's_healthcare/) - [Medical Devices](https://www.sciencedaily.com/news/health_medicine/medical_devices/)\n\n[Strong Friendships May Literally Slow Aging at the Cellular Level](https://www.sciencedaily.com/releases/2025/10/251004092917.htm)\n\nOct. 5, 2025 — Scientists discovered that lifelong social support can slow biological aging. Using DNA-based “epigenetic clocks,” they found that people with richer, more sustained relationships showed younger biological profiles and lower inflammation. The effect wasn’t about single friendships but about consistent connections across ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/)\n\n[The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk](https://www.sciencedaily.com/releases/2025/10/251003033913.htm)\n\nOct. 3, 2025 — A massive nationwide study has linked long-term exposure to the industrial chemical trichloroethylene (TCE) with a higher risk of Parkinson’s disease in older adults. Researchers examined over 1.1 million people, finding that those living in areas with the highest outdoor TCE levels faced a 10% greater risk of developing ...\n\nRELATED TOPICS\n\n- [Health Policy](https://www.sciencedaily.com/news/health_medicine/health_policy/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/) - [Healthy Aging](https://www.sciencedaily.com/news/health_medicine/healthy_aging/)\n\n[The Vitamin D Mistake Weakening Your Immunity](https://www.sciencedaily.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "University of California Researchers, Patients Wary of Trump Cuts Even as Some Dollars Flow Again - KFF Health News",
      "url": "https://kffhealthnews.org/news/article/ucla-california-universities-funding-trump-biomedical-research/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://kffhealthnews.org/wp-content/uploads/sites/2/2025/10/GettyImages-1297637565-UCLA-Medical_Center-3840.jpg",
        "1": "https://kffhealthnews.org/wp-content/uploads/sites/2/2025/10/GettyImages-1297637565-UCLA-Medical_Center-3840.jpg?w=1270",
        "2": "https://kffhealthnews.org/wp-content/uploads/sites/2/2025/10/Megan-Waiters.jpg?w=270&h=180&crop=1",
        "3": "https://kffhealthnews.org/wp-content/uploads/sites/2/2025/10/Shell.jpg?w=270&h=180&crop=1",
        "4": "https://kffhealthnews.org/wp-content/uploads/sites/2/2025/10/GettyImages-1297637565-UCLA-Medical_Center-3840.jpg?w=270&h=180&crop=1"
      },
      "content": "In August, an 80-year-old woman walked into the emergency room at Ronald Reagan UCLA Medical Center. She was lucid but experiencing a stroke. Within minutes, doctors asked for permission to pull out the stroke-causing clot before any more brain damage could occur.\n\nShe hesitated. The procedure was part of a clinical trial, and she’d heard about a federal freeze on research grants to UCLA. She wanted to know: Would this study be at risk, potentially affecting her care?\n\nThose worries put unnecessary pressure on a patient facing the loss of roughly 2 million nerve cells every minute that treatment was delayed, said Jeffrey Saver, a neurologist and longtime stroke researcher.\n\n“To then have to worry about what’s happening with the funding from the federal government is a needless increase in the stress patients are going through,” Saver said.\n\nPatients and researchers such as Saver have found themselves caught in the middle as the Trump administration has accused major universities of antisemitism and bias, pulling research funds in an attempt to extract concessions.\n\nScientists who have spent their lives developing treatments for lung cancer, brain tumors, and Alzheimer’s disease say scientific funding should not be politicized — and warn that patients waiting for lifesaving treatments stand to lose the most. They also worry that funding cuts mired in legal challenges could discourage would-be scientists from entering the field, reducing the chances for medical breakthroughs.\n\n“I would have thought that stroke and Alzheimer’s disease and all these conditions affect Democrats and Republicans alike and would be supported by everyone,” Saver said. “The reasons for the suspension don’t seem to tie into the work we’re doing.”\n\n#### Email Sign-Up\n\nIn July, the National Institutes of Health, the National Science Foundation, and the Energy Department froze $584 million in medical and science research grants to UCLA after the Justice Department said the university had violated the civil rights of Jewish students during pro-Palestinian protests. The Trump administration proposed a settlement that would require UCLA to pay a $1.2 billion fine and overhaul campus policies on admissions, hiring, and gender-affirming health care to reinstate the grants.\n\nYet the federal government plays a crucial role in funding lifesaving research that industry has little incentive to back. Saver said treatment discoveries made in the past 15 years have been “transformative” for stroke care. To keep eight clinical trials afloat, Saver said, he and other neurology department faculty members sought outside funding and agreed to salary cuts. But they were close to running out before federal funds were restored.\n\nIn the ER, doctors told the stroke patient not to worry. Given the need to study her particular symptoms, they tapped a pot of private donations to cover the procedure. She enrolled and was treated.\n\nGov. Gavin Newsom, a Democrat who has been challenging President Donald Trump more directly as he builds a national profile, has likened the president’s demands to extortion.\n\nAnd Newsom last week threatened to “instantly” take away state funding from any California university that signs a compact Trump put forth that prioritizes federal research funds to institutions that adhere to the administration’s definitions of gender, limit international students, and change admissions policies, among other stipulations. “California will not bankroll schools that sell out their students, professors, researchers, and surrender academic freedom,” Newsom said in a statement.\n\nIn September, U.S. District Judge Rita Lin of the Northern District of California ordered frozen NIH grants in the state to flow again, folding UCLA researchers into a lawsuit initially brought by researchers from the University of California-Berkeley and UC-San Francisco in June after federal agencies slashed hundreds of millions in grants to UC campuses.\n\nSome private academic institutions have reclaimed their funding by agreeing to pay hefty fines and changing campus policies, including Columbia University, which agreed to pay $200 million, and Brown University, which settled for $50 million. Meanwhile, last month a federal judge ruled that the administration’s cancellation of some $2.6 billion in grants to Harvard was illegal.\n\nStill, researchers worry the relief is temporary. Even with the district court’s restoration, the case brought by UC researchers is still pending and could ultimately be decided in Trump’s favor. The White House has vowed to appeal the ruling to restore Harvard’s funding, while heightening scrutiny of the school’s finances.\n\n“We haven’t seen everything play out yet. Lots of scientists and researchers and people who run labs are circumspect, knowing that the near future could be a bit bumpy,” said Jessica Levinson, a constitutional law professor at Loyola Law School. “They should feel like this is a win, but it’s possible that it’s a short-lived one.”\n\nOfficials at the U.S. Department of Health and Human Services did not respond to questions about potential harm done to studies while the funds were frozen, or criticisms that they are wrongly politicizing money for potentially lifesaving research.\n\nIn a statement about the administration’s campaign targeting antisemitism, HHS spokesperson Andrew Nixon said that “we will not fund institutions that promote antisemitism. We will use every tool we have to ensure institutions follow the law.”\n\nHHS spokesperson Emily Hilliard said in a follow-up statement that the department is “steadfast in its commitment to advancing groundbreaking biomedical research” and that it continues to “invest strategically in research that tackles today’s urgent challenges.”\n\nMost of the UCLA funding freezes affected foundational science that doesn’t directly involve patients but has the potential to vastly improve treatment. David Shackelford, a researcher exploring novel ways to stunt the growth of therapy-resistant lung cancer, said he was nearing a potential breakthrough for treating the disease, which kills 9 in 10 patients within five years of a diagnosis.\n\n“I’m not used to my science being politicized,” Shackelford said. “It’s cancer. We should never even be having this discussion.”\n\nAs court battles play out, Democratic state legislators are considering placing a $23 billion bond on next year’s ballot dedicating state funds to continue advances in cancer, stroke, and infectious disease research, among other scientific research. But state bond money, if approved by voters, wouldn’t come close to replacing federal grants, which traditionally finance the lion’s share of biomedical research.\n\nIn 2024 alone, for example, roughly $5.1 billion in NIH funding flowed to California, with $3.8 billion of that going to universities. And the proposed bond would be broad, one-time funding that could pay for other study areas, such as climate change research, marine ecosystems, or wildfire prevention.\n\nUC President James Milliken said the possibility of even bigger federal cuts to the state’s second-largest employer would have ripple effects across California’s economy.\n\nWhile other universities have sued the Trump administration, UC leaders have instead engaged in “good faith dialogue” with the Justice Department in hopes of negotiating a settlement, Milliken said.\n\nS. Thomas Carmichael, a neurologist at UCLA, said about 55 grants totaling $23 million from the NIH, including studies of migraines, epilepsy, and autism, were frozen in his department at the David Geffen School of Medicine. As bad as funding cuts are, he warned of the Trump administration’s ability to attack a school’s accreditation, to limit visas for international students, or to launch investigations.\n\n“It’s essentially a complete and total power mismatch to take the federal government on,” Carmichael said. “If you simply give no ground, yield nothing, you won’t win.”\n\nSeparately, in mid-September, a group of UC labor unions and faculty associations filed suit against the federal government, claiming the threat to research funds amounted to “financial coercion” to adopt campus policies that would restrict free speech. A hearing in that case is scheduled for December.\n\nBrenda L., a UCLA patient, said she was devastated when a scan in 2021 led to her stage 4 lung cancer diagnosis at age 70. After 18 months on Tagrisso, a drug considered the gold standard for treating this particular cancer, her tumors started growing again. (Brenda declined to provide her full name because she hasn’t disclosed her diagnosis to some family members.)\n\n“I was just feeling like, well, that’s the end of me,” said Brenda, who’s now 75 and lives in Bakersfield. She joined a clinical trial and has been taking another experimental drug alongside Tagrisso for two years. The combination has all but stopped the cancer’s progression.\n\n“I’m the lucky one,” said Brenda, whose current trial has not been impacted. “Other patients, they should have that same chance.”\n\nThis article was produced by KFF Health News, which publishes California Healthline, an editorially independent service of the California Health Care Foundation.\n\n- Click to share on X (Opens in new window) X\n\n- Click to share on Facebook (Opens in new window) Facebook\n\n- Click to share on LinkedIn (Opens in new window) LinkedIn\n\n- Click to email a link to a friend (Opens in new window) Email\n\n- Click to print (Opens in new window) Print\n\n- Republish This Story\n\n- California\n\n- Public Health\n\n- States\n\n- Trump Administration\n\n### More From KFF Health News\n\nTrump Called Digital Equity Act ‘Racist.’ Now Internet Money for Rural Americans Is Gone.\n\nCops on Ketamine? Largely Unregulated Mental Health Treatment Faces Hurdles\n\nUniversity of California Researchers, Patients Wary of Trump Cuts Even as Some Dollars Flow Again\n\nKFF Health News' 'What the Health?': Starting To Feel the Shutdown’s Bite",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Mouse resources at the RIKEN BioResource Research Center and the National BioResource Project core facility in Japan",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC8445257?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Dissemination of information\nDissemination of information associated with mouse strains has a vital role in facilitating active use of large-scale mouse resources by the biomedical community. We have recently renewed the RIKEN BRC home page and developed a revised version of the searchable online catalog of mouse strains that functions as a part of the BRC-integrated database (Masuya et al. [16]).\nMonthly email newsletters are sent to announce newly deposited mouse strains, users’ publications, relevant news, and coming events in both Japanese and English. To complement the functions of the integrated database and email news, we have launched proactive outreach corners focusing on specific strains, such as “*Today’s Tool for Functional Analysis,” “Today’s Model for Human Disease” and* ([https://mus.brc.riken.jp/en/todays_tool_and_model]()), and *“Mouse of the Month”* ([https://mus.brc.riken.jp/en/mouse_of_month]()) to provide researchers with information about advanced strains and facilitate the use of such strains for cutting-edge research. For the Mouse of the Month, strains are selected based on the potential impact of relevant publications as well as access log data for strains from the web catalog. The articles are designed in a mini-review format that includes representative images or figures and a summary of the strain including gene details, use applications, the latest research results, and references. The strain name with its repository unique identifier (RBRC number) is linked to each strain data sheet page of the online catalog supported by the BRC-integrated database. The Today's Tool and Model series are presented in a list format to disseminate more genetic tools and disease models; the list provides the title of the strain, its strain ID with a link to its strain data sheet, brief descriptions, and references with PubMed links.\n\n## Cryopreservation and secure back-up storage\nMice with high demand are maintained as live stocks for faster distribution, while mice with lower demand are preserved as frozen sperm or embryos in liquid nitrogen tanks for cost-effective management. Two-cell stage embryos of various strains have been successfully cryopreserved by using ethylene glycol-based vitrification (Mochida et al. [20]). Sperm samples were cryopreserved by the method reported by Nakagata and Takeshima ([22]). Recent advances in assisted reproductive technologies have facilitated efficient preservation and recovery of various inbred strains and dozens of unique wild-derived strains belonging to different species and subspecies of *Mus* (Hasegawa et al. [8], [9], [10]; Mochida et al. [21]). Cryopreservation also plays a key role in protecting the deposited mouse strains by minimizing genetic drift, which may occur during continuous breeding periods (Wiles & Taft [37]). We cryopreserve embryos or sperm at the earliest stages after deposition and whenever possible with genomic DNA samples and breeding records in order to recover a live colony from earlier generations after extensive breeding periods or whenever undesired mutations are detected.\nWe have preserved approximately 95% of collected strains as frozen embryos and sperm. A rapidly increasing number of genetically modified strains developed by genome editing have efficiently been cryopreserved by sperm freezing. To protect the archived strains from disasters, the RIKEN BRC has built a back-up facility in the RIKEN Harima branch 700 km away, and every frozen strain has regularly been transferred there since 2007. Moreover, after the Great Eastern Japan Earthquake of 2011, we have installed an in-house water supply system, liquid nitrogen suppliers, and large fuel tanks for an emergency power supply to sufficiently handle a one-week outage to strengthen the security of the main collection in Tsukuba.\n",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Research ethics consultation",
      "url": "https://en.wikipedia.org/wiki/Research%20ethics%20consultation?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Analogous to clinical ethics consultation, Research Ethics Consultation (REC) describes a formal way for researchers to solicit and receive expert ethical guidance related to biomedical research. The first REC service was established at the National Institutes of Health (NIH) Clinical Center in 1997. Today, most REC services are found at academic institutions, and the majority of current services were originally launched in response to the 2006 NIH Clinical and Translational Science Award program, as applicants to that program were required to have procedures in place to address ethical concerns raised by their research.\n\nWhile still a young discipline with no explicit standards, individuals serving as research ethics consultants are expected to be familiar with research ethics and ethical analysis; knowledgeable about the applicable regulations, laws, and policies; and ideally also have some biomedical research experience and scientific expertise.\n\nREC is distinct from related services, such as those of Institutional Review Boards, in that it is typically available at any point during a study (planning, conducting, interpreting, or disseminating results), and can relate to any ethical question. While little is known about the range and distribution of topics put forth for REC, such services may be particularly important and useful for studies of known regulatory and ethical uncertainty (e.g. assessment of minimal risk in pediatric studies) and frontier research for which there is little if any regulation or expert consensus. The recommendations that result from the consultation are non-binding, meaning that the researcher may choose to follow the recommendation, or to pursue a different approach.\n\nSee also \n Institutional Review Board\n Ethics Committee (European Union)\n Human experimentation in the United States\n IRB: Ethics & Human Research\n Informed consent\n Data Monitoring Committees\n Office for human research protections\n Ethical problems using children in clinical trials\n National Commission for the Protection of Human Subjects of Biomedical and Behavioral Research\n\nReferences\n\nEthics\nConsulting",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Current Health News & Updates For the Mind & Body | Fox News",
      "url": "https://www.foxnews.com/health?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png",
        "1": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/920/518/man-going-into-ct-scan.jpg?ve=1&tl=1",
        "2": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/454/256/diet-soda-liver-disease.jpg?ve=1&tl=1",
        "3": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2024/10/454/256/man-getting-vaccine.jpg?ve=1&tl=1",
        "4": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/348/196/man-going-into-ct-scan.jpg?ve=1&tl=1"
      },
      "content": "MEDICAL MISMATCH\n\nFIZZ-ASTER\n\nVAX FACTS\n\nA new study reveals that GLP-1 drugs may affect medical scan results, though experts say findings are preliminary and more data is needed before changing medical practice.Ohio Gov. Mike DeWine has signed an executive order banning intoxicating hemp products, requiring retailers to remove THC gummies and beverages by Oct. 14.New research challenges the belief that diet drinks are healthier, showing that artificially sweetened beverages are linked to greater liver disease risk than sugar drinks.Medical experts share five essential tips for flu shot preparation and recovery, including proper clothing choices, hydration and management of side effects.New research reveals that bottled water drinkers consume significantly more microplastics than tap water users, with particles linked to cancer risks and chronic health complications.Salon hair washing can trigger rare beauty parlor stroke syndrome when neck positioning compresses arteries, though proper support reduces risk significantly.New JAMA study finds inhalers for asthma and COPD generate over 2 million metric tons of carbon emissions annually, equivalent to pollution from 530,000 cars.Medical experts and vaccine maker Merck reject HHS Deputy Secretary Jim O'Neill's suggestion to split the MMR vaccine into individual measles, mumps and rubella shots.Researchers announce breakthrough results for AMT-130, the first disease-modifying treatment for Huntington's disease, with FDA approval application planned for early next year.Scientists in Germany have created a novel flu detection method using an edible sensor that produces taste when the influenza virus is present in the mouth.Air pollution exposure could make Alzheimer's disease worse by speeding up brain changes that cause memory loss and impaired judgment, a Penn Medicine study finds.High costs and shortages are driving demand for unregulated GLP-1 drugs, prompting FDA alerts about counterfeit Ozempic and calls for stricter enforcement by legal experts.Researchers analyzed data from over 222,000 Parkinson's patients and found TCE exposure from metal degreasing and industrial cleaning may increase disease risk.A new Wright State University study finds that over 40% of fatal car accident victims had elevated THC levels in their blood, with average concentrations far exceeding legal limits.Professor Elliot Long explains why sepsis in children is difficult to diagnose, with nearly 10% of cases missed in emergency rooms despite being treatable.Nutritionist Kendall Mackintosh recommends fruits packed with natural hormones and antioxidants to help regulate sleep cycles and aid rest.A NIH-funded study shows acupuncture treatments significantly reduce chronic low back pain and disability in adults 65 and older compared to usual medical care alone.Testosterone therapy can help men with low hormone levels, but experts warn of serious risks including stroke, prostate issues and heart disease complications.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.A clinical trial of NVG-291 peptide drug demonstrates promising results for spinal cord injury patients, with participant Larry Williams regaining balance abilities.New research reveals synthetic cannabinoid users experience more severe psychotic symptoms than natural cannabis users, with gaming disorders creating additional risks.A UCLA study shows that a new treatment combining a radioactive drug with radiation therapy could help delay hormone therapy for men with recurring prostate cancer.Weight-loss experts explain why combining GLP-1 medications with bariatric surgery may be the most effective approach to treating obesity in 2025.Scientists link poor oral health to dramatically higher pancreatic cancer risk, emphasizing the importance of regular brushing and dental care for prevention.Researchers developed an experimental method to convert skin cells into eggs, potentially allowing older women and same-sex couples to have genetically related children.Amid growing outbreaks, Americans traveling abroad should use insect repellent and protective clothing to prevent chikungunya virus, experts recommend.The FDA-approved Inluriyo, an oral estrogen receptor antagonist from Eli Lilly, has shown to achieve significant improvement in progression-free survival for breast cancer.Research on María Branyas, the world's oldest woman at 117, reveals how healthy diet, beneficial gut bacteria and protective genes contributed to her record-breaking longevity.A new study from the University of Leicester finds that high fruit intake reduces air pollution's harmful effects on the lungs, particularly in women who eat four portions daily.Registered dietitians weigh in on Starbucks' new protein drinks, noting benefits for breakfast skippers while cautioning against using them as meal substitutes.Medical experts recognize type 5 diabetes as separate from other types, requiring specialized treatment focusing on nutritional rehabilitation and careful insulin management.The honey and salt pre-workout trend gains expert approval from nutritionist Robin DeCicco, who says the combination mimics supplements' effects for gym sessions.A new study finds that GLP-1 medications are linked to lower overall cancer risk, particularly for endometrial and ovarian cancers, in obese adults. Oncologist Dr. Slomovitz discusses the findings.A simple wellness trend of jumping 50 times each morning gains popularity on TikTok as an accessible alternative to traditional morning workouts.Experts question the popular social media trend of using magnesium products on the feet for better sleep due to a lack of research backing the claims.Personal trainers explain how older adults can exercise safely by avoiding common mistakes like ego lifting, skipping strength training and having inadequate recovery time.A new study finds that vitamin B3 (nicotinamide) at 500 mg twice daily reduces basal cell carcinoma and squamous cell carcinoma risk in veterans over a 25-year period.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Flu vaccination timing varies by group, with pregnant women and those over 65 advised to wait until September, while some children may need two doses.Jeffrey Mittman transforms his experience as a blind Army veteran into advocacy for disabled employment through his leadership role on the U.S. AbilityOne Commission.A study of 766 patients suggested that specially formulated eye drops improved near vision for over 80% of presbyopia sufferers after one year of daily use.The XFG variant, also known as Stratus, is now the predominant COVID-19 strain in the U.S. after spreading to 38 countries, according to WHO and CDC data.New York City doctors reveals how weight-loss drugs reduce inflammatory cytokines by decreasing fat cells, potentially preventing cancer and autoimmune diseases.A dangerous drug-resistant bacteria called NDM-CRE is spreading rapidly across the U.S., resisting most antibiotics and proving difficult for doctors to treat.The family of Sophia Forchas shares an update on the 12-year-old's recovery after she was critically injured in a mass shooting at Annunciation Catholic Church in Minneapolis.Autism diagnoses rose from 1 in 150 children in 2000 to 1 in 31 in 2022, sparking debate about whether this reflects better detection or a true increase in the disorder.A new oral weight loss medication, orforglipron, demonstrated meaningful weight loss results in phase 3 trials, potentially providing an easier alternative to Ozempic injections.Mayo Clinic study reveals nontraditional factors cause over half of heart attacks in women under 65, compared to atherosclerosis being responsible for 75% of men's cases.Experts share symptoms of autism in adults, including social communication challenges, repetitive behaviors, difficulty making eye contact and intense specific interests.The cancer medication leucovorin shows potential benefits for autism spectrum disorder, improving communication skills in some children, say administration health officials.New research from Edith Cowan University shows that a single bout of weight training or HIIT can boost anti-cancer myokines and reduce breast cancer cell growth in survivors.Four American families aim to raise $1.15 million by October to fund a phase 3 gene therapy trial for their children with SPG50, a rare genetic disease.Kristen Bell eats leafy gerens before carbs to prevent glucose spikes, a biohacking approach that experts say can improve mood and reduce diabetes risk.Metabolic dysfunction-associated steatohepatitis (MASH) is a silent liver disease that is caused by fat buildup, inflammation and cell damage in the liver. Here's what to know.New research challenges BMI assumptions, showing overweight individuals may not face higher death rates while underweight people show increased mortality risk.Singer Selena Gomez's lupus-related arthritis diagnosis sheds light on how up to 90% of lupus patients experience joint pain, according to medical experts and recent research.Strength training for seniors should emphasize posterior muscles like the glutes and upper back rather than mirror muscles to prevent pain and maintain independence.Two healthcare workers were fired by Acadian Ambulance Service and Children's Healthcare of Atlanta for controversial social media comments about Charlie Kirk's assassination.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Trump administration announces organ procurement reforms with $25 million investment for living donors and new oversight measures for patient safety.The \"7 As\" of super-aging offer practical strategies for living longer and healthier lives, covering attitude, activity, awareness and four other key principles.Medical experts say vaccination is the best prevention method for hepatitis B, a liver infection that can be acute or chronic. The disease has no cure and can cause a variety of complications.Researchers found that 160 milligrams of daily aspirin significantly lowered cancer recurrence risk for colorectal patients with PIK3 pathway alterations.Mayo Clinic researchers report that chronic insomnia in older adults leads to a 40% higher dementia risk and accelerated brain aging over 5-1/2 years.New research reveals that GLP-1 drugs may significantly lower mortality rates in Americans by 2045, as obesity contributes to 70% of leading death causes in high-income countries.Heart health requires balance across lifestyle factors, as poor sleep, lack of exercise or bad diet can drive inflammation and cardiovascular disease, expert says.Cannabis users showed a 2.2% diabetes rate compared to 0.6% for non-users over five years, with researchers linking marijuana to appetite and metabolism changes.A Detroit nurse at Henry Ford Health was placed on leave following a social media comment supporting violence against Charlie Kirk after his assassination.Psychotherapist Jonathan Alpert explains how witnessing traumatic events, like recent deaths, can cause shock, fear and sleep difficulties, and shares coping mechanisms.West Nile virus outbreak has intensified across the U.S., with the 770 reported human cases far exceeding normal seasonal patterns for severe infections.Health experts warn pregnant women that marijuana poses safety risks even where legal, with no known safe amount of cannabis during pregnancy.Celebrity trainer Kollins Ezekh explains Zone Zero workout trend to Fox News Digital, describing light movement that supports recovery without strain or intensity.The cortisol cocktail, a trending social media drink made with coconut water and orange juice, claims to reduce stress hormones and boost energy levels.Global childhood obesity rates tripled from 2000-2022 according to UNICEF, with ultra-processed foods and junk food marketing fueling the epidemic in 190 countries.Riverside Walter Reed Hospital terminated an anesthesiologist's contract after she posted inappropriate comments supporting violence against Charlie Kirk.Health experts recommend strength training as the main priority for older adults to prevent muscle decline and maintain functional fitness for daily activities.Scientists developed a non-invasive MRI technique to measure brain iron levels, which may help identify patients at higher risk of developing Alzheimer's disease early.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Psychiatrist Dr. Daniel Amen explains how beta blockers work for anxiety by blocking adrenaline effects, as the medication is growing rapidly in popularity.Fox News correspondent Eric Shawn reveals he was diagnosed with cancer this year from 9/11 toxic dust exposure while reporting on the 24th anniversary ceremony.Certain prescription medications, including beta-blockers and gabapentinoids, could increase fall risk in older adults, as some experts claim that reducing unnecessary drugs could prevent injuries.Researchers are warning of a diabetes crisis, as nearly half of 1.3 billion affected adults go undiagnosed, with young people and low-income regions most at risk.GLP-1 medications like Ozempic show promise for multiple health conditions, as experts explore microdosing benefits for blood sugar control and longevity.Cardiothoracic surgeon Dr. Jeremy London discusses the 80/20 diet approach for heart health, emphasizing whole foods 80% of the time while limiting alcohol and processed foods.A new study reveals that sucralose may reduce cancer treatment effectiveness, but supplementation could counteract the artificial sweetener's negative effects.A new study shows that LSD reduced anxiety symptoms in adults with generalized anxiety disorder, with 100-microgram doses proving most effective in a clinical trial.Scientists have created a pre-clinical weight loss drug combining GLP-1, GIP, glucagon and peptide YY hormones to match bariatric surgery effectiveness.Researchers discovered Human Pegivirus in brain tissue from five of ten Parkinson's patients, suggesting the virus may play a role in the neurodegenerative disease.Researchers suggest intense marathon training may cause gut stress leading to colon adenomas, with 41% of studied runners having at least one polyp.Research identifies five food additive categories including flavors, sweeteners and coloring agents that may significantly increase all-cause mortality risk.Orthopedist Dr. Ran Schwarzkopf of NYU explains how knee pain affects more young people in their 30s and 40s due to obesity and high-intensity sports.Helen Mirren's simple XBX workout routine from the Royal Canadian Air Force demonstrates how a vintage 12-minute plan remains effective decades later.A new study from Beth Israel Deaconess Medical Center in Boston finds that using smartphones in the bathroom increases hemorrhoid risk by nearly 50%.A new study reveals that eating dinner within two hours of bedtime and frequently missing breakfast correlates with increased osteoporotic fracture risk in adults.Health officials investigate three tuberculosis cases in Maine's Greater Portland area, working to test contacts of infected patients for the bacterial disease.A study of 12,772 adults reveals artificial sweeteners like aspartame and saccharin are linked to accelerated cognitive decline and memory problems.Cannabis users with childhood trauma experience worse paranoia effects, according to new studies, as researchers warn against self-medicating with marijuana.The Fox News Health Newsletter brings you trending and important stories about health care, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Rabies outbreaks among wild animals are rising across the U.S., with different species presenting regional risks, from the eastern states to Alaska and the Southwest.Researchers found that AI-enabled stethoscopes can help doctors identify heart failure, atrial fibrillation and valve disease early, potentially improving patient treatment outcomes.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Award rate inequities in biomedical research",
      "url": "https://arxiv.org/abs/2207.01488?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "_page_18_Figure_2.jpeg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-arxiv/05f897bd-981a-5e6d-bbd1-cba0a68d52d9/_page_18_Figure_2.jpeg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22_page_18_Figure_2.jpeg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPV5OQWRFZ%2F20251010%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251010T132733Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEFUaCXVzLWVhc3QtMSJHMEUCIGs0WbAdX9PoJZeMAVIlLr0EBM47UWspWFOznEUk2zEgAiEA4anfPJwct9VtRWarBON0oBwjcbxBKli1fgerkOSLtKIqkgQI7v%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgw2Mjc2NjU4NTU1MTkiDBU129RrJ3%2Fvq0qjBSrmA4L7PM9R1n8R3lwAHdELGjr9orrzDJhEhtFXg0zbJ6BwtchdfifBcKsgIWC6COqdsVv6Xhs6MWpDatojLIXJDsUqi54uEIfiFTatQBMlFA4kTEcNWAXjj5w29hQmKQzokJbjAMYW0YxaxXWcMw0BLd%2FzIobFUwkVYuLiRED%2Ft6fnKLSzcgiMIrOJiQ1yCEOdtBaGy8Nmx%2BqqgnhjTRWzLIHg8%2BfszrJhC6b5cjbWq8t%2By%2F0N1mVmvm2RlM4koezhdtzBEhEsSFXrfW8SZmrkDuZKF18YE3UO%2B5K0fNBdNh9b2QJaI%2B5WX0ppr66Oxib6%2Fn8bJ10VMJpL2IPLAHHKhj0M1V%2FVcRjHTjJEZHF0A1dbiGpO8bxLXhaxuLobsH7QNBkGe4AcxVEY0apqys2YofktoDxonECTL26yCMJKPCXYwv%2FPtTOa4cY4nbH7AhfUtrN2CzMCZ7aSNIex2O4WlENshw9keaga9%2FkuA4Ydy%2BZqvLCBJmpPdckU2CPahWJjFZ10wr4bGc5dsiVekKCOjnZhn%2BKPaHp71%2FDxTyb%2FfEHIF%2B7W6ot7GMTKp9dGlWMN5mWC4Wx3IXXsexyfjJOOjL%2F2bqOngZHPd1WSKy3SCT53RRlFohCCuugfQtOvFgFBPlnLmt6d2zCPgKTHBjqlAUuXPmr8Evp7HmRY7LQFeLwfZ%2BB9swti0kQAaxvpL0mOclJMvu7FexRSNcqF7qp2R86ZFDxfP5KXJtfbceTvwnC5IJ4CxubdAPnGjdIbCSQMOIArGvO6zfGe3sTPaIIJfVM5XiZfAWtPBAzVLw29TSzm7ERZPaxkC4h1pGORWXX1uoDB7ixA2iqyeo5fLcm%2B1O7cQoRUQN9opiUJfVUWGS%2FduGooBg%3D%3D&X-Amz-Signature=744f63cef1df3ef09b3b488b451670640d6fd1b143975e6fa58884e49f0523ab"
      },
      "content": "## **Introduction**\n\nThe scope and scale of academic research pursued within the United States today is not possible without federal funding. The National Science Foundation's annual Higher Education Research and Development Survey reported total higher education R&D expenditures of $86.4 billion for federal fiscal year 2020 with more than 46 of those expended billions originating with the federal government [1]. Focusing more specifically on academic biomedical research, the National Institutes of Health (NIH) alone awarded research grants in excess of $29 billion during the same fiscal year [2]. It is not surprising then that when the first major study documenting racial disparity in research funding was published in 2011, the authors focused on the NIH [3]. Since this original study, others have added to the national discussion using NIH proposal data [4-8].\n\nThe NIH is the largest and most influential funder of academic biomedical research within the United States. NIH research awards, particularly R01 and equivalent funding mechanisms, play an important role in promotion and tenure decisions as well as in the stability of research programs. The size and duration of these awards allow researchers to spend more of their effort on research and less on grant-writing. Academic institutions particularly value NIH award funding as it generally comes with higher indirect cost rates than non-federal funding and is used in external rankings of Medical School research programs. For instance, when evaluating Medical Schools for their \"Best Medical Schools for Research\" rankings, US News & World Reports assigns a weight of 0.4 out of 1.0 to \"Research Activity\". This metric is based solely on federal funding [9], the large majority of which comprises NIH grants. While US News & World Reports began publishing a campus ethnic diversity index in 2020 [10] it is not incorporated into the \"Best Medical Schools for Research\" calculation and does not currently influence these rankings. As Ginther has shown [3,4] and researchers within the NIH have recently acknowledged and expanded upon [5,6], there remains a significant gap between NIH funding rates of white principal investigators (PIs) and Black/African American (B/AA) PIs. As such, there is an inherent tension between medical school rankings and faculty diversity.\n\nThe need for increased diversity in academic medicine and the biomedical workforce has been well substantiated. While many academic institutions advocate for increased equity among faculty sub-demographics, there remains a dearth of quantitative information supporting specific interventions. Understandably, academic administrators and faculty leaders are hesitant to implement reforms that could unintentionally compound existing inequities or even create new systemic problems. The issues are considered too important to get wrong. This sense of policy paralysis, in turn, can lead institutions into a cycle of calls for action followed by a series of educational events that, while important, are insufficient on their own to effect policy change.\n\nOne practical step forward is for academic administrators to utilize the proposal databases that have already been created at their institutions to understand and evaluate diversity in academic research. Given the importance of extramural grant funding to academic research and the\n\nsubsequent emphasis placed upon grant funding in everything from individual faculty promotion and tenure review to departmental evaluation, it is reasonable to begin any study of potential research inequity with an analysis of research grant proposal submissions and awards. This will not only increase the collective knowledge about how our research funding system works in all its complexity, but it will also, perhaps most importantly, represent a starting point for changing faculty development and research support procedures, performance metrics and their interpretation, as well as promotion and tenure review systems.\n\nDr. James Hildreth noted that at historically black colleges, there is an \"intimidation factor\" about submitting to the NIH and a presumption that proposals will not be evaluated fairly [11]. This anecdote, along with the reported racial/ethnic differences in award rates by the NIH, led us to investigate the relationship between race/ethnicity and submission behaviors for principal investigators at the University of Michigan Medical School (UMMS). We hypothesized that principal investigators adjust their proposal submission strategies to compensate for Award Rate Inequality (ARI), established or perceived from lived experience, across funding sources.\n\n## **Supporting information**\n\n**S1 Table. Proposal Award Rates for Proposals from Asian vs. White Researchers.**\n\n**S2 Table. Proposal Award Rates for Proposals from B/AA vs White Researchers.**\n\n**S3 Table. Proposal Award Rates for Proposals from Hispanic/Latino vs. White Researchers.**\n\n**S4 Table. Proposal Submission Percentages by Asian vs. White Researchers.** \n\n**S5 Table. Proposal Submission Percentages by B/AA vs. White Researchers.**\n\n**S6 Table. Proposal Submission Percentages by Hispanic/Latino vs. White Researchers.**\n\n**S7 Table. Comparison of Submission and Award Rates.** The award and submission ratios for each racial/ethnic group-submission category pair.\n\n**S8 File. Proposal Submission and Award Data by Submission Category and PI Race/Ethnicity.**\n\n### Figure 1\n\n[_page_17_Figure_1.jpeg]: </F>\n['<FG id=\"_page_17_Figure_1.jpeg\">\\n**Figure 1**: Figure 1\\n<F href=\"_page_18_Figure_2.jpeg\">\\n<FG id=\"_page_16_Figure_1.jpeg\">\\n**Figure 1**: Figure 1\\n<F href=\"_page_18_Figure_2.jpeg\">\\nFigure 1\\n</F>\\n</FG>']",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Biomedical Convergence Facilitated by the Emergence of Technological and Informatic Capabilities.",
      "url": "https://arxiv.org/abs/2103.10641?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "_page_6_Figure_3.jpeg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-arxiv/629d4469-d1dd-50e0-ad30-6204719f806f/_page_6_Figure_3.jpeg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22_page_6_Figure_3.jpeg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPV5OQWRFZ%2F20251010%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251010T132733Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEFUaCXVzLWVhc3QtMSJHMEUCIGs0WbAdX9PoJZeMAVIlLr0EBM47UWspWFOznEUk2zEgAiEA4anfPJwct9VtRWarBON0oBwjcbxBKli1fgerkOSLtKIqkgQI7v%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FARAAGgw2Mjc2NjU4NTU1MTkiDBU129RrJ3%2Fvq0qjBSrmA4L7PM9R1n8R3lwAHdELGjr9orrzDJhEhtFXg0zbJ6BwtchdfifBcKsgIWC6COqdsVv6Xhs6MWpDatojLIXJDsUqi54uEIfiFTatQBMlFA4kTEcNWAXjj5w29hQmKQzokJbjAMYW0YxaxXWcMw0BLd%2FzIobFUwkVYuLiRED%2Ft6fnKLSzcgiMIrOJiQ1yCEOdtBaGy8Nmx%2BqqgnhjTRWzLIHg8%2BfszrJhC6b5cjbWq8t%2By%2F0N1mVmvm2RlM4koezhdtzBEhEsSFXrfW8SZmrkDuZKF18YE3UO%2B5K0fNBdNh9b2QJaI%2B5WX0ppr66Oxib6%2Fn8bJ10VMJpL2IPLAHHKhj0M1V%2FVcRjHTjJEZHF0A1dbiGpO8bxLXhaxuLobsH7QNBkGe4AcxVEY0apqys2YofktoDxonECTL26yCMJKPCXYwv%2FPtTOa4cY4nbH7AhfUtrN2CzMCZ7aSNIex2O4WlENshw9keaga9%2FkuA4Ydy%2BZqvLCBJmpPdckU2CPahWJjFZ10wr4bGc5dsiVekKCOjnZhn%2BKPaHp71%2FDxTyb%2FfEHIF%2B7W6ot7GMTKp9dGlWMN5mWC4Wx3IXXsexyfjJOOjL%2F2bqOngZHPd1WSKy3SCT53RRlFohCCuugfQtOvFgFBPlnLmt6d2zCPgKTHBjqlAUuXPmr8Evp7HmRY7LQFeLwfZ%2BB9swti0kQAaxvpL0mOclJMvu7FexRSNcqF7qp2R86ZFDxfP5KXJtfbceTvwnC5IJ4CxubdAPnGjdIbCSQMOIArGvO6zfGe3sTPaIIJfVM5XiZfAWtPBAzVLw29TSzm7ERZPaxkC4h1pGORWXX1uoDB7ixA2iqyeo5fLcm%2B1O7cQoRUQN9opiUJfVUWGS%2FduGooBg%3D%3D&X-Amz-Signature=4ccac9fc365131be1bf18f823d9d77a6c1738cf6fbaf40b79aafcb8c11dcbbee"
      },
      "content": "The second cluster is comprised of diagnostic methods associated with particular diseases and the systems they affect, as represented by MeSH primarily from branches A (\"Anatomy\"), C (\"Chemicals and Drugs\") and E (\"Analytical, Diagnostic and Therapeutic Techniques, and Equipment\"). The third cluster is comprised of biological entities and the phenomena that relate them, from cells to chemicals and the multi-scale processes that connect inputs, outputs and characteristics of their reaction environments.\n\nHistorical co-occurrence trends. The last half-century of biomedical research has witnessed incredible transition from a descriptive field – focused around identifying molecules, higher-order structures, reaction pathways and mediators – into a field seeking to identify holistic mechanisms underlying systemic abnormalities in an effort to develop pointed therapies. This transition is illustrated through the Nobel Prizes awarded for Chemistry and Physiology or Medicine, which up until the 1970s and 1980s predominantly awarded research documenting key structural entities and reactions. Based upon this early work, subsequent Nobel research has transitioned to addressing challenges at the nexus of the medical innovation triple helix – where societal demand and industrial supply for acute solutions are facilitated by technological capabilities [18].\n\nTo illustrate this point, Fig. 2(A) shows the top ten stemmed keywords from Nobel Prize \"rationale\" statements, identifying prominent contextual themes across the last half century. Indeed the 1980s brought forth novel imaging, laboratory control and synthesis technologies, fundamental in the 1990s to map the genetic blueprints encoding biological structure [28]. Polymerase chain reaction (PCR), among other high-throughput techniques, accelerated science to the realm of highly controllable, scalable and permutable processes that hitherto have been primarily restricted to traditional computational domains. Since then, the last twenty years has been marked by the rapid development of bioengineering capabilities, such as CRISPR gene editing tools [48] and powerful demonstration of stem cell pluripotency [49], which allow scientists to more precisely understand emergent structure-function relations, opening the door for synthetic biology applications [50] that (re)design biological systems [51] or even develop altogether new building blocks [52].\n\nTo visualize this history unfold, we disaggregated the MeSH co-occurrence data into four non-overlapping periods: 1970- 1989, 1990-1999, 2000-2009 and 2010-2018. For each period we tabulate the co-occurrence matrix, denoted by M(1) y (M(2) y ), where y denotes a given period. Figure 2(B) illustrates the structural dynamics at the L1 level, identifying branch E and J as vacillating domains switching between the two dominant clusters. The first L1 cluster is characterized by D, A, G and B – largely descriptive SA, with the exception of \"Phenomena and Processes\" (G). The second cluster is comprised of N, F and L – peripheral SA which are increasingly convergent with the traditional SA, as indicated by extreme off-diagonal elements representing cross-domain integration.\n\nAt higher resolution, Fig. 2(C) shows the structural evolution of M(2) y , which is characterized by two relatively stable clusters and a more diverse and vacillating intermediate cluster. Note that MeSH are sorted within each cluster in decreasing order of prevalence, calculated as the sum of co-occurrence values across a given row of M(2) y . Notably, \"Information Science\" (L01) and \"Technology, Industry, and Agriculture\" (J01) are located in this intermediate cluster during the 1970-1989 period, where they play less dominant roles as indicated by their ranks within the cluster. However, over time their prominence within this\n\n[_page_5_Figure_0.jpeg]: Prominent convergence bridges. (A) For each MeSH, we analyzed the time series of bridge rank, Ri,t, a normalized ranking based upon the knowledge bridge score (βi) defined in Eq. (1). Smaller rank values (Ri,t) correspond to larger βi values, representing MeSH that are highly co-occurrent with MeSH belonging to other knowledge clusters. Plotted are smoothed time series to facilitate visual inspection. Notably, J01 and L01 are rapidly emerging convergence bridges arising from the highly generalizable, scalable and codifiable nature of techno-informatic tools and algorithms facilitating novel non-invasive imaging, high-throughput analysis, measurement, and data integration. Other MeSH shown here identify the emerging convergence nexus of Health Care (N04, N05) and Behavior (F01). (B) MeSH neighborhood subnetworks for J01 and L01 each show the ten most frequently co-occurring MeSH for the indicated period – sorted clockwise, starting from the top, with nodes sized proportional to M(2) ij ; each MeSH's SA is indicated by its node/label color. Links are plotted with thickness and shade proportional to M(2) jj0 , thereby indicating the crossdomain linkages among prominent neighbors that are facilitated by i. Each node includes its MeSH identifier and a knowledge cluster identifier, the latter indicated by a gray scale gradient. For example, MeSH J01 \"Technology, Industry, and Agriculture\" (which is a member of C3 for the first three periods and subsequently transitioning to C1 in the most recent period) is highly connected to MeSH from all other clusters (C1-C3), in particular to L01 until its disassociation in the most recent period 2010-2018; interestingly, L01 \"Information Science\" diverged from J01 as early as the first period 1970-1989, subsequently becoming more strongly coupled with members of branch E and G. See Figs. S3-S4 for extended analysis of bridge ranks and neighborhood subnetworks for the re-\n['<FG id=\"_page_5_Figure_0.jpeg\">\\n**Figure 3**: Figure 3\\n<F href=\"_page_6_Figure_3.jpeg\">\\nFIG. 3: Prominent convergence bridges. (A) For each MeSH, we analyzed the time series of bridge rank, Ri,t, a normalized ranking based upon the knowledge bridge score (βi) defined in Eq. (1). Smaller rank values (Ri,t) correspond to larger βi values, representing MeSH that are highly co-occurrent with MeSH belonging to other knowledge clusters. Plotted are smoothed time series to facilitate visual inspection. Notably, J01 and L01 are rapidly emerging convergence bridges arising from the highly generalizable, scalable and codifiable nature of techno-informatic tools and algorithms facilitating novel non-invasive imaging, high-throughput analysis, measurement, and data integration. Other MeSH shown here identify the emerging convergence nexus of Health Care (N04, N05) and Behavior (F01). (B) MeSH neighborhood subnetworks for J01 and L01 each show the ten most frequently co-occurring MeSH for the indicated period – sorted clockwise, starting from the top, with nodes sized proportional to M(2) ij ; each MeSH\\'s SA is indicated by its node/label color. Links are plotted with thickness and shade proportional to M(2) jj0 , thereby indicating the crossdomain linkages among prominent neighbors that are facilitated by i. Each node includes its MeSH identifier and a knowledge cluster identifier, the latter indicated by a gray scale gradient. For example, MeSH J01 \"Technology, Industry, and Agriculture\" (which is a member of C3 for the first three periods and subsequently transitioning to C1 in the most recent period) is highly connected to MeSH from all other clusters (C1-C3), in particular to L01 until its disassociation in the most recent period 2010-2018; interestingly, L01 \"Information Science\" diverged from J01 as early as the first period 1970-1989, subsequently becoming more strongly coupled with members of branch E and G. See Figs. S3-S4 for extended analysis of bridge ranks and neighborhood subnetworks for the re-\\n</F>\\n</FG>']",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "<i> Regenerative Medicine Research </i> : an open access translational medicine journal",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC4376332?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "I am, as an Editor-in-Chief joining BioMed Central, so excited to announce the launch of a new biomedical journal, *Regenerative Medicine Research*. In this open access, online journal, we aim to publish research relating to both the fundamental and practical aspects of regenerative medicine, with a particular emphasis on translational research.\n\nRegenerative medicine is an emerging field with the potential to empower medical research and practice. The process of tissue regeneration is essential to many organisms for a healthy life, from the highly studied axolotl, to us as human beings. In many ways regenerative medicine has become the leading edge of biomedical research and clinical practice, due to its key implications for the treatment of increasingly prevalent diseases, such as heart disease.\n\nThe field is in the infant stage of its development but it is growing at an impressively fast pace. For instance, based on a PubMed search, there were less than 200 articles relating to regenerative medicine published in 2002, but more than 3,000 articles published in 2012. However, comprehensive information or research data on regenerative medicine cannot presently be efficiently gathered, but can only be scrutinized through a diversity of different journals in various fields. Regenerative medicine is, by current definition, the process of creating living, functional tissues to repair or replace tissue or organ function lost due to age, disease, damage, or congenital defects [1]. Obviously, this requires a multidisciplinary approach, and one that looks beyond tissue engineering and stem cells. This need calls for a comprehensive journal and therefore, the launch of *Regenerative Medicine Research* takes place.\n\nWe hope to publish articles that shed light on the signalling pathways involved in cell/tissue regeneration, as well as those that address how biomaterials and stem cells can be adapted or integrated into the failing organ system. Two of the first articles published in the journal today focus on the effects of chronic alcohol consumption on tissue repair and regeneration; Dekeyser *et al.*[2] study the effect on skeletal muscle and Borrisser-Pairó *et al.*[3] look at levels of IGF-1 myocardial expression. In addition, Coletti *et al*. [4] provide a comprehensive review comparing the cellular mechanisms of skin, nerve and muscle regeneration.\n\nAs an open access journal, articles accepted for publication in *Regenerative Medicine Research* are made rapidly available online following acceptance**.** This ensures efficient dissemination of information and experimental data to scientific communities and the medical practice field. Furthermore, a highly respected Editorial Board composed of internationally well-recognized experts in the field facilitates a fair, timely and rigorous peer review process.\n\nThe Editorial Board, Publisher, and myself assure the authors and readers that we are committed to making *Regenerative Medicine Research* a preeminent platform for exchanging research protocols and experimental data in this exciting, emerging field. We look forward to receiving your high quality contributions to the journal.\n",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Resveratrol and Wine: An Overview of Thirty Years in the Digital News",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC9740773?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## 4. Conclusions\nPeople today are exposed to multiple forms of digital media. As the digital media environment evolves, it is important to understand how news is produced, namely the ones that could influence people’s choices regarding their health. Due to the connection between resveratrol and wine consumption, in this study, we analyzed the resveratrol posts published in the digital news between 1990 and 2020, to cover the 30 years since the French Paradox study was published.\nWe observed that a higher number of posts was published in the years in which the literature points out as the beginning of the intensive use of the internet by people to seek information about health, diet, and nutrition. We also found that David Sinclair’s notoriety could explain the high number of posts between 2013 and 2018. The “Sinclair effect”, as we called it, emphasizes the importance of scientists communicating with the public and not just with their peers and the importance of doing so through the means that the public commonly uses, such as digital media.\nAccording to this study, universities’ press releases are the main source of the news about resveratrol published in the digital media. This is in accordance with previous reports that most online journals chose to publish news stories, largely or entirely based on press releases from academic and research centers [63]. This can be considered a problem because the posts were, in most cases, a replication of the press releases.\nThis practice leads to the loss of the research function of journalism, which must be critical and vigilant of the public interest. This result alerts us to the importance of having science journalists in newsrooms, skilled in evaluating universities’ press releases critically and impartially.\nThe post-scientific background (name of the papers, authors, affiliation, journal title, DOI) depends on the editorial policy. The inclusion of these data is of crucial importance because it increases the post’s credibility and allows the reader to look for more information. Most of the posts analyzed reported results of preclinical studies, which highlighted the need for more research, especially involving cohort and clinical trials. Regarding the relationship between resveratrol and wine, the doses of resveratrol used are unlikely to be provided by wine in the frame of “responsible” consumption. Despite that, wine was commonly mentioned in the posts and their titles. Wine is used in a post title in a way that is intended to provoke public interest or excitement; however, these headlines are incongruent, since they do not accurately represent the information contained in the post. In our opinion, digital media must avoid attractive and profitable titles that do not mirror scientific results, particularly when these titles could influence people’s behavior with consequences for their health.\nThis is the first study reporting on the representation of the relationship between resveratrol and wine in digital news. A limitation of the current study is that it is a retrospective qualitative content analysis of online news, and the results obtained may or may not be like those obtained by analyzing other journalistic sources. Thus, the triangulation method is required for collecting more robust data. Nevertheless, these results are a new overview of the relationship between resveratrol and wine in online news and form a good basis for improving science communication, which should be audience centered. Additional research is necessary to establish more exhaustive and reproducible measures of misleading headlines over health biomedical science. The study of factors contributing to those headlines, particularly at the cultural and social levels of research, is needed to develop ways of reducing this practice. Researchers and journalists should be aware of ways to avoid it to guarantee precise research interpretation and publication. In conclusion, this report shows that scientists and scientific institutions intensify their efforts to communicate with the public to increase people’s health literacy. Scientists must have training in science communication. It also suggests that digital media should have journalists skilled in exploring scientific data and their translation into a simple and accurate language.\n",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Merck Expands Tulisokibart Clinical Development Program With Initiation of Phase 2b Trials in Three Additional Immune-Mediated Inflammatory Diseases - Merck.com",
      "url": "https://www.merck.com/news/merck-expands-tulisokibart-clinical-development-program-with-initiation-of-phase-2b-trials-in-three-additional-immune-mediated-inflammatory-diseases/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cts.businesswire.com/ct/CT?id=bwnews&sty=20251006817829r1&sid=q4-prod&distro=nx&lang=en",
        "1": "https://www.merck.com/wp-content/themes/cex-wpvip-mhh-mhh2-mcc-theme/images/stories-rl-1-.png",
        "2": "https://www.merck.com/wp-content/themes/cex-wpvip-mhh-mhh2-mcc-theme/images/stories-rl-2.png",
        "3": "https://www.merck.com/wp-content/themes/cex-wpvip-mhh-mhh2-mcc-theme/images/stories-rl-3.png"
      },
      "content": "# Merck Expands Tulisokibart Clinical Development Program With Initiation of Phase 2b Trials in Three Additional Immune-Mediated Inflammatory Diseases\n\nOctober 6, 2025 6:45 am EDT\n\nTulisokibart, an investigational anti-TL1A monoclonal antibody currently in Phase 3 trials for ulcerative colitis and Crohn’s disease, to be studied in hidradenitis suppurativa, radiographic axial spondyloarthritis and rheumatoid arthritis\n\nRAHWAY, N.J.--(BUSINESS WIRE)-- Merck (NYSE: MRK), known as MSD outside of the United States and Canada, announced it has initiated three Phase 2b trials evaluating the safety and efficacy of tulisokibart (MK-7240), an investigational humanized monoclonal antibody targeting tumor necrosis factor (TNF)-like cytokine 1A (TL1A), in patients with three immune-mediated inflammatory diseases:\n\n- MK-7240-12 ( NCT06956235) studying patients with moderate to severe hidradenitis suppurativa(HS)\n\n- MK-7240-013 ( NCT07133633) studying patients with radiographic axial spondyloarthritis(r-axSpA; also known as ankylosing spondylitis)\n\n- MK-7240-014 ( NCT07176390) studying patients with rheumatoid arthritis(RA)\n\nGlobal recruitment of these trials has begun, targeting enrollment of more than 640 patients across the three studies.\n\n“The expansion of our tulisokibart clinical development program reflects Merck’s ongoing commitment to addressing the burden of immune-mediated inflammatory diseases,” said Dr. Aileen Pangan, vice president and head of immunology, global clinical development, Merck Research Laboratories. “We’re excited to further evaluate the potential of tulisokibart as a treatment for patients across multiple diseases in rheumatology and dermatology.”\n\nWith the initiation of these Phase 2b trials, tulisokibart is now being investigated in a total of six diseases. Merck is also currently conducting two Phase 3 studies evaluating the efficacy and safety of tulisokibart in patients with two different types of inflammatory bowel disease (IBD), ATLAS-UC (NCT06052059) in ulcerative colitis (UC) and ARES-CD (NCT06430801) in Crohn’s disease (CD), and a Phase 2 study in systemic sclerosis-associated interstitial lung disease (SSc-ILD) (NCT05270668). For an overview of Merck’s clinical development program in immunology, please click here.\n\nAbout hidradenitis suppurativa (HS) Hidradenitis suppurativa is a chronic inflammatory skin condition that affects hair follicles and is characterized by small, painful abscesses under the skin in areas of the body such as the armpits, groin, buttocks and breasts. Hidradenitis suppurativa affects a variable proportion of the population, with prevalence estimates ranging from 0.1% to 0.8%.\n\nAbout radiographic axial spondyloarthritis (r-axSpA) Radiographic axSpA (also known as ankylosing spondylitis) is characterized by chronic inflammation and pain involving the spine and the joints that connect the bottom of the spine to the pelvis. As its name suggests, damage associated with r-axSpA is visible on X-rays. Worldwide, it is thought to affect 0.1% to 1% of all people.\n\nAbout rheumatoid arthritis (RA) Rheumatoid arthritis is a chronic autoimmune condition characterized by the inflammation of joints, which can lead to pain, swelling and stiffness. Rheumatoid arthritis can also affect other parts of the body, including the skin, eyes, mouth, heart and lungs. Globally, it is estimated that 17.9 million people are affected by RA, which represents a 13.2% increase since 1990.\n\nAbout tulisokibart Tulisokibart is an investigational humanized monoclonal antibody directed to a novel target, tumor necrosis factor (TNF)-like cytokine 1A (TL1A), that is associated with both intestinal inflammation and fibrosis. Tulisokibart is thought to bind both soluble and membrane-bound human TL1A. Clinical studies suggest that tulisokibart may inhibit inflammatory pathways involved in inflammatory bowel disease (IBD), and help reduce intestinal fibrosis, which may be important in altering disease progression in IBD. Merck is developing tulisokibart for the treatment of immune-mediated inflammatory diseases including ulcerative colitis (UC), Crohn's disease (CD), systemic sclerosis-associated interstitial lung disease (SSc-ILD), hidradenitis suppurativa (HS), radiographic axial spondyloarthritis (r-axSpA), and rheumatoid arthritis (RA).\n\nMerck’s commitment to immunology Advances in our understanding of human biology have led to the emergence of innovative medicines and new modalities that aim to change approaches to treatment of immune-mediated inflammatory diseases. Our scientists are applying their expertise to the discovery and development of therapies to help people with immune-mediated inflammatory diseases. Our research efforts are focused on investigating novel targets such as TL1A and CD30L and their potential role in many immune-mediated inflammatory diseases.\n\nForward-Looking Statement of Merck & Co., Inc., Rahway, N.J., USA This news release of Merck & Co., Inc., Rahway, N.J., USA (the “company”) includes “forward-looking statements” within the meaning of the safe harbor provisions of the U.S. Private Securities Litigation Reform Act of 1995. These statements are based upon the current beliefs and expectations of the company’s management and are subject to significant risks and uncertainties. There can be no guarantees with respect to pipeline candidates that the candidates will receive the necessary regulatory approvals or that they will prove to be commercially successful. If underlying assumptions prove inaccurate or risks or uncertainties materialize, actual results may differ materially from those set forth in the forward-looking statements.\n\nRisks and uncertainties include but are not limited to, general industry conditions and competition; general economic factors, including interest rate and currency exchange rate fluctuations; the impact of pharmaceutical industry regulation and health care legislation in the United States and internationally; global trends toward health care cost containment; technological advances, new products and patents attained by competitors; challenges inherent in new product development, including obtaining regulatory approval; the company’s ability to accurately predict future market conditions; manufacturing difficulties or delays; financial instability of international economies and sovereign risk; dependence on the effectiveness of the company’s patents and other protections for innovative products; and the exposure to litigation, including patent litigation, and/or regulatory actions.\n\nThe company undertakes no obligation to publicly update any forward-looking statement, whether as a result of new information, future events or otherwise. Additional factors that could cause results to differ materially from those described in the forward-looking statements can be found in the company’s Annual Report on Form 10-K for the year ended December 31, 2024 and the company’s other filings with the Securities and Exchange Commission (SEC) available at the SEC’s Internet site (www.sec.gov).\n\nMedia Contacts:\n\nEilyn Segura (203) 940-6259\n\nElizabeth Sell (484) 689-9978\n\nInvestor Contacts:\n\nPeter Dannenbaum (732) 594-1579\n\nSteven Graziano (732) 594-1583\n\n## Multimedia\n\nMerck Logo Horizontal Teal Grey RGB (211 KB)\n\n#### Related links\n\nCompany Statements\n\nRead our latest company statements.\n\nMedia library\n\nAccess videos, logos, photos, and infographics.\n\nAbout Merck\n\nWe are committed to providing leading innovations for today and the future that save and improve lives around the world.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "News | Applied Clinical Trials Online",
      "url": "https://www.appliedclinicaltrialsonline.com/news?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/act/e942a9537def770e0ab1390f44e2cbfb1d4efd81-1280x720.png?w=350&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/act/19299660bd0ac22ca487aadfc2095b44100ca0eb-1280x720.png?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/act/6016c07468d492ca78a8ff7e8dbe946b3cbb8e02-1280x720.png?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/act/da80bbd7f12780f91544614fa7cf1f43ce5ad535-1264x702.png?w=350&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/act/7d4ca3e95c1451f83110572701bcbf65798913e8-1498x1494.png?w=350&fit=crop&auto=format"
      },
      "content": "# News\n\n### Integrating AI Across Legacy Clinical Trial Systems\n\nGain perspective on how agentic AI can bridge eCOA, EDC, IRT, and CTMS platforms to reduce manual effort and improve operational efficiency.\n\n### Balancing Human Oversight and Automation in AI-Driven Trials\n\nUnderstand how adaptive human-in-the-loop frameworks can maintain safety and decision quality as AI becomes more embedded in trial monitoring and data review.\n\n### 2025 SCRS Global Site Solutions Summit: How Standardized CDAs Can Accelerate Site Activation\n\nLearn how streamlined confidentiality agreements and consistent workflows can speed site activation and improve sponsor-site transparency.\n\n### Focusing on Site Needs and Challenges: Quick Tips for Sponsors/CROs\n\nGain insight into how listening to site feedback and prioritizing engagement, training, and local patient understanding can drive smoother startups and stronger study outcomes.\n\n### AI in Action: Breaking Down Clinical Trial Bottlenecks\n\nThe convergence of AI, decentralized technologies, behavioral science, and real-world evidence opens the door to a new era in which the clinical trial industry proactively addresses participation barriers, integrates social determinants of health, and reimagines patient centricity.\n\n### Unlocking the Potential of Agentic AI to Reduce Trial Delays\n\nGain insight into how AI-powered agents can eliminate inefficiencies, shorten development timelines, and free clinical teams to focus on strategic decision-making.\n\n### 2025 SCRS Global Site Solutions Summit: How to Streamline Site Qualification and Initiation Training\n\nExplore ways to reduce redundancy in site training by applying adult learning principles and focusing on enrollment and randomization essentials.\n\n### NIH Implements Contingency Plan as Government Shutdown Impacts Research Funding\n\nThe latest federal shutdown leaves the NIH operating with just one-quarter of its staff to maintain patient care at its Clinical Center, while broader funding cuts and proposed agency consolidations threaten the future stability of US biomedical research.\n\n### Assay Reproducibility in Hemostasis Diagnostics: Practical Methods to Reduce Variability and Strengthen Trial Outcomes\n\nBy adopting structured practices today, clinical trials can deliver diagnostics that are reliable, impactful, and ready for tomorrow’s healthcare needs.\n\n### 2025 SCRS Global Site Solutions Summit: How Technology Vendors Can Reduce Site Burden and Improve Trial Execution\n\nDiscover how early site involvement, streamlined training, and AI-driven tools can simplify system complexity and enhance efficiency in clinical trials.\n\n### ACT Brief Weekly Recap: AI Monitoring, Biotech Scaling, and Site Interoperability Lead This Week’s Top Stories\n\nA look back at last week’s most-viewed content highlights how AI-driven monitoring could improve management of cytokine release syndrome in oncology, how biotech startups are leveraging scalable platforms to accelerate clinical trial operations, and why interoperability challenges remain a top concern for research sites.\n\n### 2025 SCRS Global Site Solutions Summit: Best Practices for Building Strong Site Partnerships and Choosing the Right Technology\n\nLearn how internal infrastructure, cultural buy-in, and workflow-focused technology choices can strengthen collaboration and reduce site burden in clinical trials.\n\n### Value Proposition: Strategic R&D Investment Landscape Analysis – 2025 and Beyond\n\nIn today’s high-cost R&D environment, pharma success depends less on cost-cutting and more on evidence-based portfolio decisions, niche-buster strategies, and real-world data-driven indication expansion to maximize both ROI and patient outcomes.\n\n### 2025 SCRS Global Site Solutions Summit: How Technology Partners Can Simplify Site Workflows and Training\n\nLearn how integrated platforms, single sign-on tools, and streamlined training approaches can reduce site burden while supporting compliance and study startup.\n\n### 2025 SCRS Global Site Solutions Summit: How Sponsors and CROs Can Streamline Feasibility to Support Sites\n\nDiscover how reducing redundancy in feasibility processes and leveraging shared databases can improve collaboration and ease site burden.\n\n### 2025 SCRS Global Site Solutions Summit: Navigating Site Mergers & Acquisitions\n\nAt the 2025 SCRS Global Site Solutions Summit, site leaders shared insights on when and how to sell a clinical research site, stressing the importance of timing, cultural alignment, personal goals, and clear terms for long-term success.\n\n### FDA Announces Ramifications of Government Shutdown Due to 2026 Lapse in Funding\n\nFDA outlines its limited operations during the funding lapse, focusing on essential public health activities while halting new drug applications.\n\n### 2025 SCRS Global Site Solutions Summit: Enhancing Community Visibility & Engagement\n\nIn a breakout session at the 2025 SCRS Global Site Solutions Summit, industry leaders from SCRS, QCR, and Syneos Health discussed how sites can prioritize patient empowerment, strengthen community outreach, and collaborate with CROs and sponsors to secure resources for engagement initiatives.\n\n### 2025 SCRS Global Site Solutions Summit: The Interoperability Challenges Sites Face With Clinical Trial Technology\n\nLearn how the lack of integration across platforms creates complexity for sites and why holistic solutions are key to reducing data entry and system burden.\n\n### 2025 SCRS Global Site Solutions Summit: Scaling Success: Strategies For Sustainable Growth\n\nAt the 2025 SCRS Global Site Solutions Summit, industry experts discussed how sites can balance culture, staffing, and training while expanding across multiple locations.\n\n### 2025 SCRS Global Site Solutions Summit: Why Collaboration and Feedback Loops Are Essential in Clinical Research\n\nExplore how stronger collaboration and closed feedback loops can improve communication, change management, and site engagement in clinical trials.\n\n### Resourcing and Outsourcing Trends in Drug Development\n\nInterviews with biopharma leaders and outsourcing partners reveal emerging trends in clinical trial resourcing models, highlighting a shift away from traditional full-service CRO arrangements toward hybrid strategies that balance in-house expertise, trusted consultants, and selective outsourcing.\n\n### 2025 SCRS Global Site Solutions Summit: How Sites Can Overcome Technology Burdens in Clinical Trials\n\nSteve Rosenberg, CEO, uMotif, discusses the challenges sites face with eCOA, eConsent, and ePRO platforms and the support needed to reduce technical burdens.\n\n### How AI-Driven Continuous Monitoring Can Improve Management of Immunotherapy-Related Cytokine Release Syndrome in Oncology Patients\n\nRemote monitoring solution for cytokine release syndrome paves the way for more consistent patient care, a deeper understanding of immune responses, ultimately widening patient access to life-saving immunotherapy and reducing recruitment barriers in clinical trials.\n\n### ACT Brief Weekly Recap: Data Innovation, Cybersecurity, and Contracting Bottlenecks in Clinical Trials\n\nLast week’s top stories explored the push for digital-first clinical data systems, why cybersecurity must be central in CRO qualification, and how AI-driven contracting tools are helping sponsors cut delays and accelerate trial timelines.\n\n### How Biotech Startups Scale Clinical Trial Operations with Proven Platforms\n\nTom Cowen, head, healthcare, life sciences, Conga, explains how biotech startups use scalable contract management platforms to efficiently manage clinical trials, support CRO partnerships, and accelerate drug development pipelines.\n\n### FDA Approves Inluriyo for ESR1-Mutated Advanced Breast Cancer Based on Phase III EMBER-3 Trial Data\n\nThe FDA has approved Eli Lilly’s Inluriyo (imlunestrant), the first oral estrogen receptor antagonist for adults with ER-positive, HER2-negative, ESR1-mutated advanced or metastatic breast cancer, based on Phase III EMBER-3 results showing a 38% reduction in risk of progression or death versus endocrine therapy.\n\n### Success Stories of Pharma Companies Using Contract Lifecycle Management in Trials\n\nTom Cowen, head, healthcare, life sciences, Conga, shares how leading pharmaceutical companies are using Contract Lifecycle Management to streamline global studies, reduce onboarding times, and standardize clinical trial processes.\n\n### Preparing for the Operational Burden of OS Requirements in Oncology Trials\n\nIn this video interview, Ananth Kadambi, VP of real-world evidence and modeling solutions at Certara, highlights how clinical operations teams must enhance patient tracking, engage data monitoring committees earlier, and plan subgroup analyses to meet FDA’s overall survival guidance.\n\n### FDA Grants Priority Review for Enhertu Plus Pertuzumab in First-Line HER2-Positive Breast Cancer\n\nBased on Phase III DESTINY-Breast09 results showing a 44% reduction in risk of progression or death versus standard therapy, AstraZeneca and Daiichi Sankyo’s Enhertu-pertuzumab combination could mark the first major advance in this treatment setting in over a decade.\n\n## Trending on Applied Clinical Trials Online\n\n### AI in Action: Breaking Down Clinical Trial Bottlenecks\n\n### Integrating AI Across Legacy Clinical Trial Systems\n\n### Unlocking the Potential of Agentic AI to Reduce Trial Delays\n\n### Balancing Human Oversight and Automation in AI-Driven Trials\n\n### 2025 SCRS Global Site Solutions Summit: How Standardized CDAs Can Accelerate Site Activation\n\n- About\n\n- Advertise\n\n- Contact Us\n\n- Editorial Contacts\n\n- Do Not Sell My Personal Information\n\n- Terms and Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Q&A: Redefining Clinical Trials Through Community-Based Dermatology | Dermatology Times - Dermatology News and Clinical Insights",
      "url": "https://www.dermatologytimes.com/view/q-a-redefining-clinical-trials-through-community-based-dermatology?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/84f043d44f222ae037def41a7bc4d51a8368e40b-576x720.jpg",
        "1": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/f0c218b32e8344a976c1059fbaf344cc0bb9e60b-5333x3555.jpg?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/deeab30f37748f3316d073f9976fa16d3f2a903c-3006x1682.png?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/07109ded97de1c222f4d0c254bd0e03896a69150-6000x4000.jpg?w=350&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/dermatologytimes/8d04b5170329c3091448549f5c8f6871bbb75f4c-613x342.png?w=350&fit=crop&auto=format"
      },
      "content": "In a recent interview with *Dermatology Times,* Jorge Garcia-Zuazaga, MD, MBA, FAAD, FACMS, discussed how Apex Skin and Apex Clinical Research Center are redefining access to dermatology trials through a community-based model. As founder and CEO, Garcia-Zuazaga highlighted the importance of representation, patient access, and real-world applicability in research. He also shared how Apex Skin's multisite network, bilingual staff, and collaborative partnerships are helping bring innovative dermatologic therapies to more diverse patient populations across Ohio and beyond.\n\n#### Q: What gaps in dermatology research do you see Apex Skin uniquely positioned to fill?\n\n**A**: Apex is uniquely positioned to fill several key gaps in dermatology research, especially around representation, accessibility, and real-world applicability. Many dermatology studies have historically lacked diversity in patient populations, leading to data that doesn't always reflect the needs of all communities. Through its broad network of community-based practices, Apex can recruit more diverse participants across age, ethnicity, skin type, and socioeconomic status. Additionally, being embedded in everyday clinical settings allows Apex to bring research to underrepresented populations who might not otherwise have access to academic research centers—helping generate more inclusive, real-world data that can drive better patient outcomes.\n\n#### Q: How does the multisite model at Apex Skin improve trial execution compared with single-site practices?\n\n**A**: The multisite model at Apex offers scalability, consistency, and speed. By running trials across a network of aligned dermatology practices, Apex can standardize trial protocols and best practices, ensuring quality and compliance across all sites. This model allows for faster patient enrollment, more robust data collection, and greater geographic diversity, which strengthens study outcomes. It also allows trial sponsors to work with a single centralized operational hub while benefiting from the reach and trust of local providers—a major advantage over traditional single-site models.\n\n#### Q: With over 20,000 patients a month across clinics, how does Apex Skin balance clinical care with research recruitment to best serve patients?\n\n**A**: Apex integrates research seamlessly into the patient care journey. Our providers are trained to identify research opportunities that align with patient needs during routine clinical visits, ensuring that trials are offered as an extension of care—not a disruption. Dedicated research coordinators and support teams handle the logistical and regulatory aspects, allowing clinicians to focus on patient relationships. By maintaining this balance, we not only improve access to cutting-edge treatments but also build trust with patients, who see research as a natural part of their care, not a separate or burdensome process.\n\n#### Q: How have you seen bilingual staff and culturally tailored communication play in patient satisfaction and retention?\n\n**A**: Bilingual staff and culturally competent communication are essential in building trust, improving trial adherence, and reducing dropout rates. Patients are far more likely to participate and remain in a study when they feel heard, respected, and understood. Apex prioritizes culturally tailored outreach and employs multilingual staff to bridge gaps in understanding, especially in communities where language and cultural differences have historically been barriers to research participation. This not only improves patient satisfaction but also supports equity in access to care and representation in research.\n\n**Q: What innovations in trial design or technology do you think will most impact dermatology research in the next 5 years?**\n\n**A**: Decentralized and hybrid trial models, enabled by digital tools like eConsent, remote monitoring, and teledermatology, are set to transform dermatology research. These approaches reduce the burden on patients by minimizing the need for in-person visits and make it easier to collect real-time, real-world data. Additionally, AI-powered diagnostic tools and image-based analytics can accelerate both patient identification and outcome assessments. Apex is well-positioned to adopt and scale these innovations through its integrated clinical and research infrastructure, helping trials become more patient-centric and efficient.\n\n#### Q: How do you see Apex Skin collaborating with community dermatologists outside your network to expand research access?\n\n**A**: Apex is committed to building bridges with independent and community dermatologists who may not have the infrastructure to run trials themselves but want to offer research opportunities to their patients. We collaborate by providing access to trials through referral partnerships. This helps extend the reach of research into more communities without requiring providers to fully shift into a research-based model. By working together, we can enhance access to cutting-edge dermatologic therapies and ensure more patients benefit from the latest innovations in care.\n\n#### Q: What final message would you share with colleagues about clinical trial research?\n\n**A**: I would say that anyone considering clinical trials should know it can be a great addition to their practice. However, it’s not something that can be done casually or “on the side.” You can’t just dedicate an hour a week and expect meaningful results—clinical research requires real commitment, time, and energy because there are so many moving parts.\n\nFor those interested, I highly encourage you to pursue it. Conducting clinical trials keeps you at the forefront of new technologies and emerging therapies. It elevates you as a physician by keeping you current with the latest advancements, and it also enhances your practice by allowing you to offer patients access to innovative treatments.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Regeneron scores in adjuvant skin cancer | ApexOnco - Clinical Trials news and analysis",
      "url": "https://www.oncologypipeline.com/apexonco/regeneron-scores-adjuvant-skin-cancer?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.oncologypipeline.com/apexonco/sites/default/files/styles/large/public/articles/iStock-1029895804.jpg",
        "1": "https://www.oncologypipeline.com/apexonco/sites/default/files/styles/large/public/articles/iStock-1029895804.jpg?itok=hadjcuPP",
        "2": "https://www.oncologypipeline.com/apexonco/sites/default/files/styles/normal_size/public/articles/iStock-2016791323.jpg?itok=PDaSHmPH",
        "3": "https://www.oncologypipeline.com/apexonco/sites/default/files/styles/normal_size/public/articles/Red%20and%20green%20lights.jpg?itok=BLE2pEqs",
        "4": "https://www.oncologypipeline.com/apexonco/sites/default/files/styles/normal_size/public/articles/iStock-1356070671.jpg?itok=pu89mT9d"
      },
      "content": "Start Display article for teaser page\n\nStart Display article for detail page\n\nRegulatory\n\n# Regeneron scores in adjuvant skin cancer\n\n9 October 2025\n\nBatirtze Areitio\n\nContenido regular\n\nRegeneron has had its ups and downs in 2025, but this time the company has landed some good news. The FDA has approved Libtayo as adjuvant therapy for patients with cutaneous squamous cell carcinoma at high risk of recurrence following surgery and radiation. Notably, Regeneron left Catalent’s Indiana facility out of the BLA; according to an [FDA inspection report](https://www.statnews.com/wp-content/uploads/2025/08/catalent-form-483-jul-2025.pdf), this plant was found to be contaminated with mammalian hair and other particulates. Issues at the site led to a [second complete response letter for Regeneron’s CD20-targeting T-cell engager odronextamab](https://www.oncologypipeline.com/apexonco/more-delays-regeneron) in August, in follicular lymphoma. The project had previously been rejected by the FDA in March 2024, in follicular lymphoma and diffuse large B-cell lymphoma, because confirmatory trials weren't sufficiently enrolled. While it’s unclear what this means for Regeneron’s collaboration with Catalent, which was acquired by Novo Nordisk last year, it’s possible that the company wasn’t willing to risk another setback. The adjuvant nod, meanwhile, comes with no immediate competition in sight. Merck & Co.’s Keytruda stumbled in its Keynote-630 study, and for now no other contenders appear to be chasing this indication.\n\n**Regeneron’s 2025 regulatory journey**\n\n| Product | Note |\n| --- | --- |\n| Libtayo | US approved for adjuvant cutaneous squamous cell carcinoma in Oct 2025; first approved in Sep 2018 for CSCC not eligible for curative surgery or radiation |\n| Odronextamab | Received second CRL for 3rd-line FL in Aug 2025, owing to issues with Catalent facility; received first CRL in Mar 2024 for 3rd-line FL & DLBCL owing to confirmatory studies not being sufficiently enrolled |\n| Lynozyfic | FDA approved in multiple myeloma in Jul 2025, following CRL in Aug 2024 on manufacturing issues |\n| Eylea high-dose | FDA decisions delayed from Aug 2025 to Q4 2025, owing to issues with Catalent facility |\n\nSource: OncologyPipeline.\n\n## Link to OncologyPipeline project\n\n[https://www.oncologypipeline.com/oncologia/pipeline/47](https://www.oncologypipeline.com/axpeonco?email=)\n\n706\n\n## Tags\n\nCompanies Regeneron\n\nTumors CSCC\n\nMonoclonal antibody\n\nMolecular Drug Targets PD-1\n\n## RELATED ARTICLES\n\n03 October 2025 US shutdown freezes new drug applications 01 October 2025 FDA red and green lights: September 2025 26 September 2025 Second in line for ESR1-mutant patients 22 September 2025 US action on subcutaneous cancer drugs 22 September 2025 Replimune crashes after FDA meeting 10 September 2025 J&J’s bladder hope gets its first approval\n\nEnd Display article for detail page\n\nRegeneron scores in adjuvant skin cancer 9 October 2025\n\nPD-L1 degraders emerge 9 October 2025\n\nESMO 2025 preview – Junshi goes pivotal in PI3Kα 8 October 2025\n\nSome backing for Arcus's HIF2α bet 6 October 2025\n\nGirentuximab nears the finish line, maybe 6 October 2025\n\nPfizer fuels Cartography push 3 October 2025\n\nDifferent problem, same result for Bolt 2 October 2025\n\nDebiopharm ups its bispecific conjugate push 1 October 2025\n\nCCR8 expectations 18 April 2024\n\nAstraZeneca's phase 3 TIGIT surprise 2 November 2023\n\nRevolution pushes home its pan-KRAS advantage 27 February 2024\n\n5,000 patients later Roche scraps its TIGIT 24 July 2025\n\nPfizer dials down its atirmociclib ambitions 25 March 2025\n\nPfizer bets big on a bispecific 20 May 2025",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "FDA Quietly Removes Draft Guidance on Diversity in Clinical Trials Following Executive Order on DEI | AJMC",
      "url": "https://www.ajmc.com/view/fda-quietly-removes-draft-guidance-on-diversity-in-clinical-trials-following-executive-order-on-dei?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/ajmc/29f50a50749d5b42870bfbf652a620b3fce97dcb-1200x738.jpg",
        "1": "https://cdn.sanity.io/images/0vv8moc6/ajmc/57c43a15ea5d3b012b45508980f7b3574f659282-5001x2626.png?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/ajmc/c4c711ba47074f68e77863b2aeb96b1455f13a57-2879x1611.png?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/ajmc/7e2b816610fc95ef1ee1dcec8ae4e652eee953de-1920x1080.png?w=350&fit=crop&auto=format",
        "4": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/4pmsxtz04gdm-PTCE_AMCP-Nexus-2024_Satellite-Symposium_Food-Allergy_093024v3_800x385.png"
      },
      "content": "# FDA Quietly Removes Draft Guidance on Diversity in Clinical Trials Following Executive Order on DEI\n\n### Key Takeaways\n\n- The FDA's removal of draft guidance on clinical trial diversity raises concerns about its commitment to diversity and compliance with statutory obligations.\n\n- The draft guidance aimed to improve the inclusion of underrepresented populations in clinical trials, requiring sponsors to submit Diversity Action Plans.\n\n- The sudden removal leaves sponsors uncertain about compliance and the FDA's ability to meet its statutory deadline for final guidance by June 2025.\n\n- Historical underrepresentation in clinical trials, such as in cardiovascular research, highlights the importance of diversity for generalizable and effective medical findings.\n\nThe FDA removed previously issued draft guidance on diversity in clinical trials from its website without public notice or explanation.\n\nDays after President Donald J. Trump issued an executive order (EO) curtailing diversity, equity, and inclusion (DEI) programs and prohibiting federal recognition of gender identity apart from biological sex, the FDA removed previously issued draft guidance on diversity in clinical trials from its website.1 The move, made without public notice or explanation, was noted by the public on January 23, 2025, raising concerns about the agency’s stance on clinical trial diversity requirements and the statutory obligations of sponsors as the news spreads.\n\nWhile the deleted guidance was still in draft form, it is highly unusual for the FDA to revoke or alter draft guidance without issuing a formal announcement, according to a statement from Crowell & Moring LLP. Typically, draft guidance provides sponsors with insights into the agency’s current thinking on best practices for clinical trial design, statistical analysis, and regulatory expectations. Without this document, sponsors are left with uncertainty about how the agency will evaluate Diversity Action Plans required under the Food and Drug Omnibus Reform Act (FDORA), particularly as the statutory deadline for final guidance approaches on June 26, 2025.\n\n### Recommendations From the Now-Removed Guidance\n\nThe guidance released in June 2024 aimed at improving the enrollment of participants from historically underrepresented populations in clinical studies involving drugs, biological products, and medical devices.2 The agency draft mandated that sponsors submit Diversity Action Plans (DAPs) as part of their investigational new drug (IND) applications or premarket submissions, aligning with the regulatory framework established under sections 505(z) and 520(g)(9) of the Federal Food, Drug, and Cosmetic Act.\n\nAccording to the FDA, diversity in clinical trials is not just a regulatory requirement; it is essential for producing reliable data that reflects the varied demographics of the population that will ultimately use these products. Clinical studies that include diverse participants are more likely to yield results that are applicable to the entire patient population.\n\n#### Key Elements of Diversity Action Plans for IND\n\nUnder sections 505(z) and 520(g)(9) of the Federal Food, Drug, and Cosmetic Act, the DAPs would be required to detail:\n\n- enrollment goals specific to their clinical studies, disaggregated by race, ethnicity, sex, and age group of the clinically relevant population to ensure that different demographic factors are appropriately represented in the study cohort\n\n- rationale for goals explaining the significance of these targets in terms of the study's objectives and outcomes\n\n- strategies for meeting goals where sponsors would outline the methods to be employed to achieve these enrollment and retention goals, including community engagement, cultural competency training for researchers, and targeted outreach to underrepresented populations\n\n#### Addressing Race, Ethnicity, Sex, and Age Group Diversity\n\nThe FDA's guidance was specific in its call for sponsors to consider and implement strategies that focus on:\n\n- sex, as recognized in prior guidance documents, to acknowledge the imperative of including both male and female participants and ensuring that the findings are valid across different genders, including diverse gender identities\n\n- representation of diverse age groups, particularly in pediatric studies, where the health needs and responses to treatments can differ significantly across age\n\n#### Implementation of Strategies\n\nThe FDA recommended that sponsors proactively identify barriers that may hinder participation and address these within their DAPs. Effective strategies may include:\n\n- community engagement and collaboration with health advocates and local providers to raise awareness and build trust among potential participants\n\n- cultural competency training to ensure that clinical trial staff are equipped to communicate effectively with a diverse population, which can improve participant interactions and reduce biases\n\n### Health and Industry Implications\n\nThe final guidance was stated to be legally due by June 2025, but with the draft guidance now missing from the FDA website, uncertainty looms over whether the agency will meet this deadline and how sponsors should proceed in the interim.1\n\nGiven the historical underrepresentation of women, intersex individuals, and those with differences in sex development in medical device trials, the guidance aimed to improve research inclusivity and the generalizability of clinical findings by ensuring diverse participant representation.\n\nOne example revealing the detriment of revoking such guidelines can be seen in cardiovascular disease, the leading cause of death in the US, which historically focused research on men’s health.3 Vast research has shown that women were systematically underrepresented in cardiovascular clinical trials, resulting in treatments and guidelines being developed without fully understanding how heart disease affects women differently.\n\nIn 1977, the FDA issued guidelines that exacerbated this disparity by discouraging the participation of women of childbearing age in clinical trials due to concerns about potential harm to fetuses. As a result, sex-specific differences in cardiovascular disease went largely unstudied; the impact is still felt today.\n\n### What Now?\n\nThe sudden removal of the draft guidance leaves sponsors with significant uncertainty regarding clinical trial diversity expectations.1 Although FDORA mandates that sponsors submit Diversity Action Plans only after FDA finalizes its guidance, many sponsors have already begun voluntarily incorporating these plans into their submissions, Crowell stated. A recent FDA report to Congress indicated that hundreds of drug and device sponsors have proactively submitted diversity plans, recognizing their importance in evaluating product safety and effectiveness.\n\nThe move also raises concerns about whether the FDA will meet its statutory deadline for final guidance. Given the executive order’s broader restrictions on DEI efforts, stakeholders are left questioning whether the agency will uphold its prior commitments to diversity in clinical research or whether further policy shifts may be forthcoming.\n\nAs industry leaders and policymakers await clarification, the firm noted that the removal of this guidance signals a shift in how regulatory agencies interpret and enforce diversity-related requirements in clinical trials under the current administration.\n\nReferences\n\n1. After Trump executive orders, FDA removes diversity guidance from website. Crowell & Moring LLP. News release. January 27, 2025. https://www.crowell.com/en/insights/client-alerts/after-trump-executive-orders-fda-removes-diversity-guidance-from-website\n\n2. FDA. Diversity Action Plans to improve enrollment of participants from underrepresented populations in clinical studies. Guidance document. https://web.archive.org/web/20241225134729/https://www.fda.gov/regulatory-information/search-fda-guidance-documents/diversity-action-plans-improve-enrollment-participants-underrepresented-populations-clinical-studies\n\n3. Klein H. Why are we still seeing gaps in women’s heart care? AJMC. October 15, 2025. Accessed January 31, 2025. https://www.ajmc.com/view/why-are-we-still-seeing-gaps-in-women-s-heart-care-\n\n### Newsletter\n\n## Related Content\n\n### Optimizing Revisit Intervals: Reducing Variability to Enhance Health Care Efficiency\n\n### AI Should Support Clinicians, Not Replace Them: Vivek Subbiah, MD\n\n### A \"One-Two Punch\" to Innovation? The Most Favored Nation Order and Broader US Drug Pricing Reform\n\n### Defining the Role of Rilzabrutinib in ITP Management\n\n### LUNA 3 Trial Evaluation: Understanding BTK Inhibition in ITP Management\n\n## Latest CME\n\n## From Strict Avoidance to Tailored Therapies: Transforming Food Allergy Care\n\n1.5 Credits / Allergy, Immunology\n\n## The Evolving Strategies for Managing nAMD and DME: Empowering Managed Care Decisions for Improved Patient Outcomes\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Ophthalmology/Optometry\n\n## Managing Schizophrenia: Evidence-Based Care and Optimizing Value of New and Emerging Therapies\n\n1.0 Credit / Psychiatry\n\n## Closing Gaps in CLL Care: Managed Care Insights and Strategies\n\n1.5 Credit / Hematologic Cancer, Oncology\n\n## Revolutionizing Acute Pain Relief: Emerging Non-Opioid Therapies and the Essential Role of Pharmacists\n\n1.5 Credit / Pain Management/Opioids\n\n## Overview and Burden of Migraine\n\n0.5 Credit / Neurology\n\n## The Role of the Pharmacist Migraine Management\n\n## The Evolving Treatment Landscape of Migraine\n\n## Evidence-Based Guidelines Point to Leap in Care for Hypertrophic Cardiomyopathy\n\n1.0 Credit / Cardiology\n\n## ASH Annual Meeting Coverage: Highlighting the Recent Updates in TKI Use in the Treatment of CML – Insights and Application for Managed Care\n\n1.0 Credit / Oncology, Hematology, Hematologic Cancer\n\n## New and Approved: FDA’s 2024 Drug Lineup\n\n1.5 Credits / General Pharmacy\n\n## Innovations in Medicine: 2024 Lineup of New and Approved Specialty Drugs\n\n2.0 Credits / General Pharmacy\n\n## Revolutionizing Acute Pain Relief: Emerging Nonopioid Therapies and the Essential Role of Managed Care\n\n2.0 Credits / Pain Management\n\n## Leveraging Managed Care to Optimize Patient Outcomes: Integrating Novel Treatments in Schizophrenia\n\n1.5 Credits / Neurology, Psychiatry\n\n## Advancing Immunotherapy in Endometrial Cancer: A Managed Care Perspective on Personalized Care\n\n1.5 Credits / Gynecologic Cancer, Health Equity, Diversity & Inclusion, Oncology, Women's Health\n\n## Overcoming Operational and Clinical Barriers in Multiple Myeloma: Managed Care Strategies for Antibody-Based Regimens\n\n1.5 Credits / Hematologic Cancer, Hematology, Oncology\n\n## Exploring Therapeutic Advances in Myelofibrosis and Key Considerations for Effective Management\n\n1.5 Credits / Oncology, Hematology\n\n## Driving Better Outcomes in Hypertrophic Cardiomyopathy: A Managed Care Imperative\n\n1.5 Credits / Cardiology\n\n## Optimizing the Uptake of Long-Acting Injectables in HIV Treatment and Prevention: Considerations for Managed Care\n\n1.5 Credits / HIV/AIDS, Infectious Disease\n\n## Harnessing Data-Driven Insights and Innovations to Enhance AMD and DME Management: Strategic Approaches for Managed Care\n\n1.5 Credits / Ophthalmology/Optometry\n\n## Navigating the Advancements in Oral Therapy Options in HR+ Metastatic Breast Cancer\n\n1.5 Credits / Breast Cancer, Oncology, Women's Health\n\n## Navigating the Changing Treatment Paradigm of Metabolic Dysfunction-Associated Steatohepatitis: A Guide for Managed Care Pharmacists\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Gastroenterology\n\n## Managed Care Approaches and Models for Equitable Access to Innovations in Major Depressive Disorder Treatment\n\n1.5 Credits / Psychiatry\n\n## Evaluating the Effectiveness and Value of Novel Nonhormonal Treatments in the Management of Menopause-Related Vasomotor Symptoms\n\n1.5 Credits / Women's Health\n\n## Updated Guidance and Managed Care Strategies to Optimize Respiratory Syncytial Virus Vaccination Coverage\n\n1.5 Credits / Immunization, Infectious Disease, Pulmonology\n\n## Leveraging Biologics and Immunotherapies in the Management of Food Allergies\n\n1.5 Credits / Immunology, Allergy\n\n## Advancing Care in Neovascular Age-Related Macular Degeneration and Diabetic Macular Edema: Optimizing Outcomes With Emerging Therapies\n\n## The Evolving Landscape of Transthyretin Amyloidosis Cardiomyopathy: New Therapies and Treatment Strategies\n\n1.5 Credits / Cardiology, Rare Diseases\n\n## Reflecting on the Real-World Use of Biologic Therapy in Asthma Management\n\n1.5 Credits / Immunology, Pulmonology\n\n## Advancing Cystic Fibrosis Management: The Evolving Role of Specialty and Managed Care Pharmacists\n\n1.5 Credits / Pulmonology\n\n## Pulmonary Arterial Hypertension: Real-World Applications of New Therapies and Management Strategies\n\n1.5 Credits / Pulmonology, Cardiology, Rare Diseases\n\n## Targeting Chronic Rhinosinusitis With Nasal Polyps With Biologics: Optimizing Outcomes and Reducing Health Care Burden\n\n1.5 Credits / Immunology\n\n## Emerging Treatment Options for Inflammatory Bowel Disease: A Focus on IL-23 Pathway Inhibition\n\n1.5 Credits / Gastroenterology, Immunology\n\n## Transforming Metabolic Dysfunction-Associated Steatohepatitis Management: Pharmacist Considerations for the Evolving Treatment Landscape\n\n1.5 Credits / Gastroenterology\n\n## Innovations in Inflammatory Bowel Disease Therapy: How IL-23 Inhibitors Are Shaping Treatment and Managed Care Approaches\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Applying Evidence-Based Strategies and Guideline Updates for Managed Care\n\n1.0 Credit / Immunology, Nephrology\n\n## Leveraging Novel Therapies to Transform Demodex Blepharitis Care (Pharmacy Technician Credit)\n\n1.5 Credit / Ophthalmology/Optometry\n\n## Leveraging Novel Therapies to Transform Demodex Blepharitis Care\n\n## The Changing Paradigm in Pain Management and Supporting Access to Novel Therapies\n\n1.0 Credit / Pain Management/Opioids\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: A Case-Based Exploration of Optimized Patient Outcomes\n\n## Opioids, Pain Management, and Substance Use Disorder: A Practical Overview\n\n2.0 Credits / Pain Management/Opioids\n\n## Trending on AJMC\n\n### Telemedicine Boosts Quality of Life, Inhaler Technique for Severe COPD\n\n### Bispecific Antibodies in Multiple Myeloma Are Moving From Clinical Trials to Community Practice\n\n### Physician Peer Influence Drives Uptake of Opportunistic Salpingectomy for Ovarian Cancer Prevention\n\n### Efgartigimod Outperforms Standard IVIG in Averting Myasthenic Crisis\n\n### CAR T-Cell Therapy Holds Potential in SCLC, but Significant Barriers Remain\n\n- About\n\n- Contact\n\n- Editorial Boards\n\n- Advertise\n\n- Do Not Sell My Information\n\n- Terms & Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Precision medicine: affording the successes of science",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC9812011?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Clinical trials: a new standard of care?\nThese concepts have clear application in oncology, where advances in genomics have radically accelerated drug development. It is estimated that, of more than 840 oncology drugs in development in 2018, >90% are biomarker-dependent17. A biomarker, as defined by FDA and the National Institutes of Health, is a “characteristic that is measured as an indicator of normal biological processes, pathogenic processes, or responses to an exposure or intervention, including therapeutic interventions”18. As noted above, clinical trials are not a core part of standard oncology practice. In the 1990s, a phase 1 study of a new chemotherapy offered a low response rate (e.g., 5%) with unquantifiable risk of toxicities. The situation is changing rapidly. Participation in a phase 1 study of a rationally-designed drug directed at a matched biomarker now offers a response rate in excess of 30%19. Consider doxorubicin, a standard of care for a patient with newly diagnosed metastatic sarcoma, with response rates of between 10% and 30%20-22. For patients carrying the relevant biomarker, a phase 1 study today appears to offer a better chance of response than the standard of care.\nIt is important to note that trials-based therapies carry inherently greater uncertainty than standard-of-care treatment, which should be considered in the following proposed model. For this reason, we have focused on the terminal stages of a cancer patient journey, where most patients run out of standard-of-care options. In these circumstances of unmet medical needs, clinical trials of biomarker-dependent therapies offer additional important options for patients who remain fit enough for treatment. Further, we anticipate that trial drugs may have roles even at earlier stages of the cancer journey, where standard-of-care treatments exist. Participation ethically approved clinical trials randomizing new against standard-of-care cancer treatments could offer access to promising new therapies. Given the uncertainty attached to the clinical benefits of participation in clinical trials, it will be important to monitor clinical outcomes prospectively as part of the proposed model.\n",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "HIV/AIDS research",
      "url": "https://en.wikipedia.org/wiki/HIV/AIDS%20research?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "In March 2016, researchers at Temple University, Philadelphia, reported that they have used genome editing to delete HIV from T cells. According to the researchers, this approach could lead to a dramatic reduction of the viral load in patient cells.\n\nIn March 2019, a patient with Hodgkin's lymphoma was also reported to possibly have been cured using similar treatment to Brown.\n\nSee also \nDiscovery and development of CCR5 receptor antagonists\nDiscovery and development of HIV-protease inhibitors\nDiscovery and development of non-nucleoside reverse-transcriptase inhibitors\nBroadly neutralizing HIV-1 antibodies\nInnate resistance to HIV\nHealth interventions\nHIV superinfection\nHistory of HIV/AIDS\nSex education\n\nReferences\n\nExternal links \nHIV and AIDS News (ScienceDaily)\nHIV and AIDS News (Medical News Today)\nTreatment Action Group – Clinical Trials",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Nucleus Network | Clinical Trials",
      "url": "https://www.nucleusnetwork.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.nucleusnetwork.com/wp/wp-content/uploads/2025/07/nuculusnetwork-share.jpg",
        "1": "https://www.nucleusnetwork.com/wp/wp-content/uploads/2025/04/world-map.png",
        "2": "https://www.nucleusnetwork.com/wp/wp-content/uploads/2025/06/Homepage_Blue-shirt.png",
        "3": "https://www.nucleusnetwork.com/wp/wp-content/uploads/2025/08/J30719-NN-LinkedIn-Announcement-Post-ƒ-4-1080x727.jpg",
        "4": "https://www.nucleusnetwork.com/wp/wp-content/uploads/2025/04/Broadcast-Channel.jpg"
      },
      "content": "# Advancing medicine, improving lives.\n\n- Brisbane Brisbane, AU Australia’s only Phase l unit dedicated to early clinical development of New Biological Entities (NBE’s), Biosimilars and Vaccines. 60-bed facility, co-located within the Royal Brisbane and Women’s Hospital 275 trials completed Brisbane clinical trials\n\nBrisbane, AU\n\nAustralia’s only Phase l unit dedicated to early clinical development of New Biological Entities (NBE’s), Biosimilars and Vaccines.\n\n- 60-bed facility, co-located within the Royal Brisbane and Women’s Hospital\n\n60-bed facility, co-located within the Royal Brisbane and Women’s Hospital\n\n- 275 trials completed\n\n275 trials completed\n\n- Melbourne Melbourne, AU A leading Phase I facility capable of delivering patients for pharmacokinetic studies in hepatic and renal patients. Over 111 beds (95 inpatient, 16 outpatient), co-located within the Alfred Hospital 450 trials completed Melbourne clinical trials\n\nMelbourne, AU\n\nA leading Phase I facility capable of delivering patients for pharmacokinetic studies in hepatic and renal patients.\n\n- Over 111 beds (95 inpatient, 16 outpatient), co-located within the Alfred Hospital\n\nOver 111 beds (95 inpatient, 16 outpatient), co-located within the Alfred Hospital\n\n- 450 trials completed\n\n450 trials completed\n\n- Minneapolis Minneapolis, US A leading Phase I facility capable of delivering patients for pharmacokinetic studies in hepatic and renal patients. 50-bed facility, co-located within the University Enterprise Labs (UEL) and Medical Alley 120 trials completed Minneapolis clinical trials\n\nMinneapolis, US\n\n- 50-bed facility, co-located within the University Enterprise Labs (UEL) and Medical Alley\n\n50-bed facility, co-located within the University Enterprise Labs (UEL) and Medical Alley\n\n- 120 trials completed\n\n120 trials completed\n\n- London London, UK A world-renowned early phase unit specialising in first-in-human trials and studies in healthy and patient volunteers. 145-bed facility, purpose-built for Phase I research and based in Central London Over 1,000 trials completed for global biopharma and biotech sponsors London clinical trials\n\nLondon, UK\n\nA world-renowned early phase unit specialising in first-in-human trials and studies in healthy and patient volunteers.\n\n- 145-bed facility, purpose-built for Phase I research and based in Central London\n\n145-bed facility, purpose-built for Phase I research and based in Central London\n\n- Over 1,000 trials completed for global biopharma and biotech sponsors\n\nOver 1,000 trials completed for global biopharma and biotech sponsors\n\n2500\n\nPhase 1 clinical trials conducted\n\n210000\n\nin-house database of dedicated participants\n\n300\n\nPhase 1 clinical trial beds\n\n## Why we lead, not follow\n\nFrom early-phase clinical trials to global partnerships, we bring new therapies to life with precision, care, and scientific excellence.\n\nAt Nucleus Network, we help move treatments from bench to bedside by generating the high-quality data needed to guide smarter, faster development. As a trusted partner to biotech and pharma, we combine world-class research with a deep commitment to people, because behind every data point is a person, and behind every breakthrough is a partnership.\n\n## Global network. Unified purpose.\n\nFind a trial near you\n\n## Progress takes partnership\n\nEvery medical breakthrough begins with collaboration, between the teams developing new therapies and the people who make clinical research possible.\n\nAt Nucleus Network, we work side by side with global sponsors and dedicated research participants to turn promising science into meaningful outcomes. Whether you’re advancing a new therapy or taking part in a clinical trial, you’re helping shape the future of medicine.\n\nBecause without partnership, there is no progress.\n\nLearn more about participating in a trial Explore partnership opportunities\n\n## Join the conversation\n\nWe’re driving progress in human health and expanding access to innovative medical therapies.\n\nOur focus is on enhancing global well-being and building a sustainable healthcare future through cutting-edge medical advancements.\n\nTogether with our clients, we are driven by our purpose:\n\nAdvancing medicine, improving lives.\n\n#### Nucleus Network Acquires Hammersmith Medicines Research\n\nNucleus Network, a global leader in early phase clinical research, today announced the acquisition of Hammersmith Medicines Research (HMR), one of the United Kingdom’s most respected early phase clinical trial organisations. This milestone marks a significant step in Nucleus Network’s global growth, establishing the only early phase provider with dedicated facilities in Australia, the United States, and the United Kingdom.\n\nLearn more about the acquisition\n\n#### Have you joined our Broadcast Channels?\n\nWe will post regular updates on new trials open for recruitment in our Melbourne and Brisbane clinics. Each clinic has its own channel, so you will only see updates relevant to your city.\n\nJoin Our Broadcast Channels\n\n- Brisbane Clinic Channel\n\n- Melbourne Clinic Channel\n\n#### Follow Nucleus Network on LinkedIn\n\n#### Check your eligibility\n\nInterested in participating in a clinical trial?\n\nCheck your eligibility in just a few minutes to see if you qualify for one of our current studies.\n\n#### Have Questions About Clinical Trials?\n\nOur team is here to help.Call us to learn more about current studies, eligibility, and how to get started.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Brain transplant",
      "url": "https://en.wikipedia.org/wiki/Brain%20transplant?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "See also \n Cyborgs in fiction (for stories of brains transplanted into wholly artificial bodies)\n Donovan's Brain\n Isolated brain\n Robotics\n Robert J. White\n\nReferences\n\nExternal links \nDr Robert White, profile by David Bennun in The Sunday Telegraph Magazine, 2000\nToday / Brain Transplants (BBC Radio4)\n \nDr. Robert J. White to Discuss \"Rise and Fall of the Human Brain\" (Lakeland Community College)\n\nThe BBC Radio drama by Matthew Broughton ‘’Tracks - Origins’’\n\nSpinal cord regeneration\n Researchers Stretch Nerve Fibers to New Limits (Fox News)\n Spinal Cord Bridge Bypasses Injury To Restore Mobility (EmaxHealth)\n Cancer-Causing Protein May Heal Damaged Spinal Cord & Brain Cells (Newswise.com)\n Swiss make breakthrough in spinal research: Novartis has started clinical trials into spinal cord regeneration (swissinfo.ch)\n\nOrgan transplantation\nEmerging technologies\nNeurosurgery",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Getting It Right: Being Smarter about Clinical Trials Policy Forum",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC1435786?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Conclusion: Prospects for the Future\nIn spite of the shortcomings in observational studies that have led to mistakes in the interpretation or application of evidence, there was an overall air of optimism at the meeting that taming the new technologies and applying strategies for rigorous statistical and study design may help resolve some of the uncertainties that bedevil clinical trials today. Greater knowledge of pharmacogenetics and metabolomics, and a better understanding of how genes interact with each other and with environmental variables, may lead to new designs for clinical trials. Medicine may see an acceleration of the movement toward prevention of disease and maintenance of health and well-being. All this will be welcome news to the public, advocacy groups, the media, policy makers-and scientists themselves, who are among the first to admit, as Aristotle said, that “the investigation of truth is in one way hard, in another, easy.”\n<TB>\n\n## Box 1. Recommendations Arising from the Meeting\n1.\n   Be aware of and eliminate bias and confounders to the extent possible.\n2.\n   Establish formal means of setting priorities for conducting large clinical trials.\n3.\n   Employ meta-analyses and systematic reviews to enhance means of weighing evidence, but beware of potential systematic biases.\n4.\n   Give equal weight to determining safety and efficacy in clinical trials.\n5.\n   Validate biomarkers and surrogate end points before basing policy guidelines for public health on them.\n6.\n   Employ the technologies of the “-omics” revolution and systems biology approaches, but with caution.\n7.\n   Communicate results of clinical trials in an accurate and timely manner.\n8.\n   Establish two-way communications with communities, consumers, and patient advocacy groups during development, implementation, and reporting of clinical trials.\n9.\n   Establish criteria to inform public policy and decision making.\n\n</TB><TB>\n\n## Box 2. Factors Affecting the Decision to Conduct a Clinical Trial\n1.\n   Strength of existing evidence: promising, but not conclusive data from pre-clinical and observational studies/small trials\n2.\n   Potential impact on public health and/or medical science\n3.\n   Therapeutic equipoise: difficulty deciding which of two therapies is better without a head-to-head test\n4.\n   Portfolio balance: a research organization may adjust its priorities to give more (or less) attention to specific areas to achieve optimal use of its resources\n5.\n   A potential for runaway practice, e.g., a new diagnostic test that is being widely marketed, but has not been adequately evaluated\n6.\n   Social/political context/pressures-from legislators, community leaders, patient advocacy groups\n\n</TB><TB>\n\n## Presenting Relative Risks Alone Can Be Misleading\n“… a 68% reduction!”\nThis ad for an antiosteoporosis drug claimed that individuals taking the drug in a year's trial experienced a 68% reduction in clinical vertebral fractures over a comparable group on placebo.\nWhat were the actual figures? The rate of fractures among placebo users was 0.738%. The rate of fractures among the drug users was 0.238%. Thus, the absolute risk reduction was 0.738% - 0.238% = 0.5%, which translates to five fewer fractures per 1,000 women-hardly headline news. But by presenting the data in terms of relative risk reduction-relative risk reduction = 1 - 0.238%/0.738% = 0.678 (approximately 68%)-the impressive 68% figure was advertised. Computations of relative risk reduction will always appear impressively large when actual event rates are low.\n\n</TB>\n",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Pharmaceutical Executive - Leadership, Strategy & Market Access",
      "url": "https://www.pharmexec.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/pharmexec/9dae14cd816aecb0e2254f82fbd3b0b0ce94c289-1280x720.jpg?rect=654,0,626,720&w=600&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/pharmexec/6e28461577e7a65145ee7f4d8edfeebe53584417-1280x720.jpg?rect=0,0,644,720&w=300&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/pharmexec/9dae14cd816aecb0e2254f82fbd3b0b0ce94c289-1280x720.jpg?rect=654,0,626,720&w=240&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/pharmexec/db7a0df3355df0d703c6990de6cb894288c96170-1917x1080.png?w=240&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/pharmexec/6e28461577e7a65145ee7f4d8edfeebe53584417-1280x720.jpg?rect=0,0,644,720&w=240&fit=crop&auto=format"
      },
      "content": "## Regulatory\n\nabout 23 hours ago\n\n2 days ago\n\n3 days ago\n\n4 days ago\n\n7 days ago\n\n8 days ago\n\n9 days ago\n\n11 days ago\n\n14 days ago\n\n# Latest Content\n\n### Preparing The Market for Blood-Based Biomarkers\n\n#### FDA Approves Libtayo for Immunotherapy for Adjuvant Treatment of Cutaneous Squamous Cell Carcinoma\n\n#### Novo Nordisk Enters $4.7 Billion Definitive Agreement with Akero Therapeutics\n\n#### Challenges of Positioning an Ultra-Sensitive Platform\n\n#### Pharmaceutical Executive Daily: Amgen Launches New Direct-To-Consumer Platform\n\n##### Preparing The Market for Blood-Based Biomarkers\n\n##### The Situation We Faced: The Development and Commercialization of MariTide\n\n##### Challenges of Positioning an Ultra-Sensitive Platform\n\n##### How Will US Drug Price Negotiations Impact Global Market Dynamics?\n\n##### How Will Pharma Companies React to the Administration's Efforts?\n\n##### Translating Complex Scientific Findings into Actionable Insights\n\n##### How Does the Industry View GLP-1s in Terms of Treatment Potential?\n\n##### The Secrets of Successful Drug Launches: Cleaning Up Operations\n\n##### What is the Real-World Impact of the Rise of GLP-1 Medications?\n\n##### NETSseq's Impact On Cerevance's Approach to Drug Discovery\n\n## Shorts\n\n## Paul Hudson: A Mindset for Miracles\n\nWith healthcare at a key crossroads of policy, technology, and science, Sanofi CEO Paul Hudson shares the Big Pharma’s formula for navigating the new age of innovation, where running from risk is not an option.\n\n## Pharmaceutical Executive: September 2025 Issue (PDF)\n\nClick the title above for a link to open the Pharmaceutical Executive September 2025 issue in an interactive PDF format.\n\n## Coaching Flag Football—And Guiding a Biotech Through Commercialization\n\nUseful tips and parallels for staying in the game following a complete response letter.\n\n## From Lab to Market: Tracking Today’s Shifting Pathways for Biotech\n\nOutlining the key touchpoints for embracing change and opportunity in the “messy, tough—and fun” R&D-to-commercial transition journey.\n\n## Podcasts\n\n## Videos\n\n##### Key Scientific and Clinical Insights Leading to Cerevance's Pursuit of Solengepras\n\n##### What Would Happen if Foreign Markets Became Friendlier to Innovation than the US?\n\n##### The Secrets of Successful Drug Launches: The Six Root Causes of New Product Launch Failure, Part 2\n\n##### Is Pharma Becoming More Personalized\n\n##### Is the MFN Order a Potential Solution for High Drug Prices?\n\n##### What Could the Global Impact of the MFN Order Be?\n\n##### How is AI Already Being Used in Pharma Commercialization?\n\n##### Altering The Treatment Paradigm for Obesity and MACE Indications with Oral GLP-1's\n\n##### How is Oncology R&D Already Being Impacted by Existing Regulatory Concerns?\n\n##### Injectable and Oral GLP-1's Impact on The Clinical Landscape\n\n## All News\n\n### FDA Approves Jascayd for Idiopathic Pulmonary Fibrosis Treatment\n\nFDA approves Jascayd, the first new treatment for idiopathic pulmonary fibrosis in over a decade, significantly reducing mortality risk for patients.\n\n### FDA Approves Johnson & Johnson’s Simponi for Pediatric Ulcerative Colitis\n\nJohnson & Johnson's Simponi gains FDA approval for treating pediatric ulcerative colitis, expanding options for young patients with this chronic condition.\n\n### Translating Complex Scientific Findings into Actionable Insights\n\nShana Tetrault, PhD, Director of Product Marketing at Quanterix, discussed translating complex scientific findings into actionable insights for healthcare providers and stakeholders, emphasizing the importance of early disease detection.\n\n### Pharmaceutical Executive Daily: FDA Lifts Clinical Hold on NUZ-001\n\nIn today’s Pharmaceutical Executive Daily, we cover the FDA lifting its clinical hold on Neurizon Therapeutics’ lead program Nuz-001, the agency’s export ban on Sun Pharma’s Halol facility, and new insights on how small biotechs can better navigate regulatory and market complexities.\n\n### Algen Biotechnologies Announces Multi-Target Partnership with AstraZeneca\n\nAlgen Biotechnologies partners with AstraZeneca to enhance AI-driven drug discovery, targeting chronic inflammatory conditions for innovative therapeutic solutions.\n\n### Chiesi Group & Arbor Biotechnologies Announce Global Strategic Partnership Aiming to Develop Gene Editing Program ABO-101\n\nChiesi Group partners with Arbor Biotechnologies to advance gene editing therapies for rare diseases, focusing on primary hyperoxaluria type 1.\n\n### Amgen Launches New Direct-To-Patient Program AmgenNow\n\nAmgen introduces AmgenNow, a direct-to-patient program for Repatha, offering affordable access to life-saving cardiovascular treatment.\n\n### Pharmaceutical Executive Daily: Updated Vaccine Recommendations\n\nStay informed on key pharmaceutical news, including FDA insights, Takeda's strategic shifts, and updated CDC COVID-19 vaccination guidelines.\n\n### CDC Supports Vaccine Advisor’s Updated Covid-19 Vaccine Recommendation\n\nCDC introduces shared-decision making for COVID-19 vaccinations, emphasizing informed consent and individual consultation with healthcare providers.\n\n### FDA Lifts Clinical Hold on Neurizon Therapeutics Lead Investigational Drug NUZ-001\n\nNeurizon Therapeutics advances ALS treatment as FDA lifts clinical hold on NUZ-001, paving the way for Phase II and III trials.\n\n### Former NIAID Director Alleges She Was Fired Over Whistleblower Complaints\n\nDr. Jeanne Marrazzo's firing highlights concerns over political interference in health research and vaccine safety advocacy amid whistleblower allegations.\n\n### Pharmaceutical Executive Daily: FDA's new Fast-Track Review\n\nIn today’s Pharmaceutical Executive Daily, we cover the FDA’s new fast-track review program for U.S.-made generics, Novartis’ FDA approval of Rhapsido for chronic spontaneous urticaria, and Halozyme’s $750 million acquisition of Elektrofi to strengthen drug delivery innovation.\n\n### FDA Announces New Domestic Generic Drug Fast-Track Review Program\n\nProducts tested and manufactured exclusively from domestic materials will be eligible for the program.\n\n### Tecentriq in Combination with Lurbinectedin Receives FDA Approval for Extensive- Stage Small Cell Lung Cancer\n\nRoche's Tecentriq and lurbinectedin combo gains FDA approval, significantly improving outcomes for extensive-stage small cell lung cancer patients.\n\n### FDA Approves Zepzelca in Combination with Atezolizumab for Extensive-Stage Small Cell Lung Cancer Therapy\n\nJazz Pharmaceuticals announces FDA approval of Zepzelca and Atezolizumab for extensive-stage small cell lung cancer, enhancing treatment options and survival rates.\n\n## Trending on PharmExec\n\n### Most Favored Nation Order: Legal Battles, Market Shifts, and the Future of Drug Pricing Reform\n\n### FDA Approves Libtayo for Immunotherapy for Adjuvant Treatment of Cutaneous Squamous Cell Carcinoma\n\n### Novo Nordisk Enters $4.7 Billion Definitive Agreement with Akero Therapeutics\n\n### Pharmaceutical Executive Daily: Amgen Launches New Direct-To-Consumer Platform\n\n### The Situation We Faced: The Development and Commercialization of MariTide\n\n- About\n\n- Advertise\n\n- Contact Us\n\n- Editorial Board\n\n- Editorial Submission Guidelines\n\n- Do Not Sell My Personal Information\n\n- Terms and Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "New Product Newswire | Drug Topics",
      "url": "https://www.drugtopics.com/view/new-product-newswire-73?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/ffd0d9605669ed3afcc980b5588ff6747775df28-1800x1200.jpg?w=350&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/bb9a42064b2434f007f7f74cb2c234fed24de034-4800x2700.jpg?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/6e565037e47df47ae94f777d14195d9662b2e596-4608x3072.jpg?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/b7dcd7cdc41f83d6a1d5ecda8966db730333446c-6048x4024.jpg?w=350&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/a281e84845b9b2679c5ad45c931dbf311918fa2c-3840x2160.jpg?w=350&fit=crop&auto=format"
      },
      "content": "# New Product Newswire\n\nHyperammonemia, a condition of dangerously heightened levels of ammonia in the bloodstream, can be life-threatening in patients with urea cycle disorder (UCD), an inborn error of urea cycle metabolism. Ammunol, from Medicis Pharmaceutical Corp., Scottsdale, Ariz., (602) 808-8800, combines 10% sodium phenylacetate and 10% sodium benzoate in a new product intended for intravenous hospital use in the event of hyperammonemic crisis. The drug was recently approved for marketing as a \"rescue medication.\"\n\nRxNEW DRUGS Hyperammonemia, a condition of dangerously heightened levels of ammonia in the bloodstream, can be life-threatening in patients with urea cycle disorder (UCD), an inborn error of urea cycle metabolism. Ammunol, from Medicis Pharmaceutical Corp., Scottsdale, Ariz., (602) 808-8800, combines 10% sodium phenylacetate and 10% sodium benzoate in a new product intended for intravenous hospital use in the event of hyperammonemic crisis. The drug was recently approved for marketing as a \"rescue medication.\"\n\nMedicis Pharmaceutical has received FDA approval for Vanos (fluocinonide 0.1% topical cream), a Class I corticosteroid for the treatment of plaque-type psoriasis. The high-potency cream is available in 30- and 60-gm sizes.\n\nPeople with weakened immune systems or certain skin conditions are susceptible to vaccine complications. A new drug was approved by the FDA as the first intravenous human plasma-derived product available to treat a number of rare complications of smallpox vaccination. Vaccinia Immune Globulin Intravenous (VIGIV) is made from the pooled plasma of donors who receive booster immunizations with the licensed smallpox vaccine Dryvax and is licensed to DynPort Vaccine Co. LLC, Frederick, Md., (301) 607-5000.\n\nNEW FORMULATIONS From Schering-Plough Corp., Kenilworth, N.J., (908) 298-4000, a new nonsedating Clarinex (desloratadine) Syrup (0.5 mg per 1 mL) is now available nationwide. It is indicated for the treatment of indoor allergies and hives in children as young as six months of age and for the relief of outdoor allergy symptoms in children two years of age and older. It is available in bubblegum flavor.\n\nEverett Laboratories, West Orange, N.J., (800) 964-9650, is introducing a chocolate chewable calcium and folic acid supplement intended to help support the skeletal and cardiovascular systems in premenopausal, menopausal, and postmenopausal women. The new fast-dissolving CalciFol Chewable Wafers contain calcium carbonate, vitamin D3, magnesium, folic acid, vitamin B6, boron, and vitamin B12. One tablet in the morning is the recommended dosage.\n\nNEW TREATMENT OPTION For Roche Pharmaceuticals, Nutley, N.J., (800) 526-6367, the FDA has approved Pegasys (peginterferon alfa-2a) and Copegus (ribavirin, USP) in combination for the treatment of patients co-infected with chronic hepatitis C and HIV. It is the first and only approved combination regimen for treating these coexisting conditions. Pegasys is dosed at 180 mcg as a once-weekly subcutaneous injection; Copegus is available as a 200-mg tablet and is administered orally two times a day as a split dose.\n\nREINTRODUCTION TEVA Pharmaceuticals and Savient Pharmaceuticals, East Brunswick, N.J., have joined forces for the U.S. launch of TEV-TROPIN (somatropin [rDNA origin]) for injection. The growth hormone, a polypeptide of recombinant DNA origin, is indicated for the long-term treatment of children with short stature due to endogenous growth hormone deficiency. For further information, call TEVA at (215) 591-3030, or Savient at (732) 418-9300.\n\nNEW GENERICS TEVA USA, North Wales, Pa., (888) TEVA USA, is introducing amoxicillin and clavulanate potassium chewable tablets USP. Available in 400 mg/57 mg strength in bottles of 20, the tablets are AB rated to GlaxoSmithKline's Augmentin, indicated for the treatment of lower respiratory tract infections, otitis media, sinusitis, skin and skin structure infections, and urinary tract infections.\n\nTentative approval has been granted to Ranbaxy Pharmaceuticals, Princeton, N.J., (609) 720-9200, for donepezil hydrochloride tablets in strengths of 5 mg and 10 mg. Indicated for the treatment of mild to moderate dementia of the Alzheimer's type, it offers a generic alternative to Eisai's Aricept.\n\nTwo companies are introducing pilocarpine tablets in 5-mg strength. The product is a generic version of MGI Pharma's Salagen 5-mg tablets. The medication is indicated for the treatment of dry mouth from salivary gland hypofunction caused by radiotherapy for cancer of the head and neck in patients with Sjögren's syndrome. Pilocarpine tablets are available from Alpharma Inc., Fort Lee, N.J., (201) 947-7774 and from Roxane Laboratories, Columbus, Ohio, (614) 272-4774.\n\n### Newsletter\n\n## Related Content\n\n### FDA Approves Roflumilast Cream 0.05% for Atopic Dermatitis in Children 2 to 5\n\n### FDA Quietly Approves Generic Mifepristone Tablet for Abortion\n\n### FDA Approves Remibrutinib for Adults With Chronic Spontaneous Urticaria\n\n### FDA Approves Guselkumab for the Treatment of Pediatric Plaque Psoriasis, Psoriatic Arthritis\n\n### FDA Approves Bumetanide Nasal Spray for Edema Associated With Heart Failure, Liver Disease\n\n## Latest CME\n\n## SimulatEd™: Patient-Centered Care to Improve Outcomes in Chronic Lymphocytic Leukemia\n\n1.0 Credit / Hematologic Cancer\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## From Strict Avoidance to Tailored Therapies: Transforming Food Allergy Care\n\n1.5 Credits / Allergy, Immunology\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## The Evolving Strategies for Managing nAMD and DME: Empowering Managed Care Decisions for Improved Patient Outcomes\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Ophthalmology/Optometry\n\n## Exploring Immunizations Updates and Strategies for Addressing Vaccine Hesitancy\n\n1.0 Credit / Immunization\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n## The Essential Role of Pharmacists in Improving Influenza Vaccination Coverage: Strategies to Increase Vaccine Uptake and Optimally Utilize Available Vaccines\n\n1.0 Credit / Immunization, Infectious Diseases\n\n## The Latest Updates and Pharmacist Perspectives on RET Inhibitors in Non‒Small Cell Lung Cancer\n\n0.5 Credit / Oncology, Lung Cancer\n\n## Collaborating Across the Continuum™: Identifying and Preventing Hepatic Encephalopathy in Long-Term Care Settings\n\n1.25 Credits / Neurology\n\n## The Role of Pharmacists in Pneumococcal Prevention: Strategies to Improve Vaccine Uptake\n\n1.0 Credit / Immunization, Infectious Diseases, Pulmonology\n\n## Addressing the Unmet Needs in the Management of Myasthenia Gravis: The Role of New and Emerging Therapies\n\n1.5 Credits / Neurology\n\n## Balancing the Burden of Moderate to Severe Atopic Dermatitis in Pediatric Patients: Navigating the Use of Targeted Biologic Therapies and Caregiver Challenges\n\n1.5 Credits / Dermatology, Immunology\n\n## In-Depth Insights and Application in the Management of Immunoglobulin Therapy\n\n1.0 Credit / Neurology, Immunology\n\n## Glucagon for Diabetes: Overcoming Barriers for Optimal Management in the Long-Term Care Setting\n\n## Insights in Influenza Immunization: The Long-Term Care Pharmacist’s Role in Improving Health Outcomes in At-Risk Populations and Vaccine Uptake\n\n## Harnessing the Potential of SGLT2 Inhibitors in Cardiorenal Metabolic Health: Strategies for Long-term Care and Consultant Pharmacists\n\n1.0 Credit / Cardiology, Endocrinology, Diabetes, & Metabolism, Nephrology\n\n## Managing Schizophrenia: Evidence-Based Care and Optimizing Value of New and Emerging Therapies\n\n1.0 Credit / Psychiatry\n\n## Transforming Small Cell Lung Cancer Management With DLL3-Targeted Therapies\n\n1.0 Credit / Oncology, Lung Cancer\n\n## Cytokine Release Syndrome With Bispecific Antibodies: A Pharmacist's Guide to Safe Management\n\n1.0 Credit / Hematologic Cancer, Lung Cancer, Oncology\n\n## A Pharmacist's Guide to the Safe and Effective Management of BTK and BCL-2 inhibitors in Chronic Lymphocytic Leukemia\n\n1.0 Credit / Hematologic Cancer, Oncology\n\n## How Artificial Intelligence Is Transforming Cancer Care: Essential Insights for Oncology Pharmacists\n\n1.0 Credit / Oncology\n\n## Charting the Course: The Pharmacist's Role in Safeguarding Patients From Immune-Related Adverse Events\n\n## Enhancing Endometrial Cancer Management: Highlights of Molecular Insights, Treatment Approaches, and Toxicity Management\n\n1.0 Credit / Gynecologic Cancer, Oncology, Women's Health\n\n## Closing Gaps in CLL Care: Managed Care Insights and Strategies\n\n1.5 Credit / Hematologic Cancer, Oncology\n\n## Enhancing Safety in Cancer Care: Expert Guidance on Toxicity Management of HER2, TROP2, and HER3-Targeted Antibody-Drug Conjugates",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "FDA approves Regeneron's Libtayo for high-risk CSCC",
      "url": "https://www.pharmaceutical-technology.com/news/regeneron-libtayo-cscc/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/24/2025/10/shutterstock_1826152037.jpg",
        "1": "https://www.pharmaceutical-technology.com/wp-content/uploads/sites/24/2025/10/shutterstock_1826152037-430x241.jpg",
        "2": "https://www.pharmaceutical-technology.com/wp-content/themes/goodlife-wp-B2B/assets/img/report.png",
        "3": "https://www.pharmaceutical-technology.com/wp-content/themes/goodlife-wp-B2B/assets/images/strategic-int.png",
        "4": "https://www.pharmaceutical-technology.com/wp-content/themes/goodlife-wp-B2B/assets/images/icon-report.png"
      },
      "content": "Libtayo was developed through the VelocImmune technology of Regeneron. Credit: lev radin/Shutterstock.com.\n\nThe US Food and Drug Administration (FDA) has granted approval to Regeneron Pharmaceuticals’ fully human monoclonal antibody Libtayo(cemiplimab-rwlc) as an adjuvant therapy for adults with cutaneous squamous cell carcinoma (CSCC).\n\nThe approval is intended for patients who face an increased risk of the disease returning after surgery and radiation.\n\n### Go deeper with GlobalData\n\n- Reports LOA and PTSR Model - Cemiplimab in Angiosarcoma - Reports LOA and PTSR Model - Cemiplimab in Head And Neck Cancer Squamous Ce...\n\n##### Go deeper with GlobalData\n\nThe gold standard of business intelligence.\n\n[Find out more](https://www.pharmaceutical-technology.com/buy-reports/?utm_source=LGP-Article&utm_content=Find_out_more&utm_campaign=LGP_Premium-Insight-Landing-Page)\n\n.about-premium-insights\n\n#### Discover B2B Marketing That Performs\n\nCombine business intelligence and editorial excellence to reach engaged professionals across 36 leading media platforms.\n\n[Find out more](https://www.globaldatamarketingsolutions.com/)\n\nThe agency’s decision to approve the programmed cell death protein 1 inhibitor was expedited through its priority review process.\n\nMeanwhile, an application for the drug is under consideration by the European Union, with an outcome anticipated by the first half of 2026.\n\nThe latest approval was granted based on the data of the Phase III C-POST study, which compared the use of adjuvant Libtayo to a placebo in patients.\n\nThe study revealed that the antibody reduced the disease recurrence or mortality risk by 68% in comparison to the placebo group.\n\nGlobalData Strategic Intelligence\n\n# US Tariffs are shifting - will you react or anticipate?\n\nDon’t let policy changes catch you off guard. Stay proactive with real-time data and expert analysis.\n\nBy GlobalData\n\n[Learn more about Strategic Intelligence](https://www.reports.globaldata.com/strategic-intelligence-request-demo/?campaignid=701Ti00000TMijIIAT)\n\nLibtayo’s safety profile aligns with its established safety record when used as a single agent for advanced cancers.\n\nThe antibody was developed through the company’s VelocImmune technology.\n\nRegeneron Pharmaceuticals president, chief scientific officer and board co-chair George Yancopoulos stated: “This approval provides patients with CSCC at high risk of disease recurrence following surgery and radiation a much-needed option, as Libtayo is the only immunotherapy to demonstrate efficacy in this setting.\n\n“Now with five FDA-approved indications, Libtayo is firmly established as a strong and versatile PD-1 inhibitor option for patients with a variety of cancers.”\n\nThe therapy has already been authorised by health regulatory bodies in more than 30 nations for indications including certain cases of advanced basal cell carcinoma, advanced cervical cancer, and advanced non-small cell lung cancer.\n\nIn the US, the antibody is known by its generic name cemiplimab-rwlc for its approved uses, with “rwlc” as its suffix. This is in line with the agency’s guidance on the nonproprietary naming of biological products.\n\nOutside the US, the generic name for Libtayo remains cemiplimab.\n\nThe US regulator recently [expanded the approval](https://www.pharmaceutical-technology.com/news/regeneron-evkeeza-hofh/) of the company’s Evkeeza for the treatment of homozygous familial hypercholesterolemia in children aged between one and four.\n\nNewsletter banner start\n\n<link rel=\"stylesheet\" href=\"\">\n\n### Sign up for our daily news round-up!\n\n### Give your business an edge with our leading industry insights.\n\n[Sign up](https://www.pharmaceutical-technology.com/all-newsletters/?utm_source=media-website&utm_medium=&utm_content=Sign_Up_Button&utm_campaign=newsletter_Pharmaceutical Technology)\n\nNewsletter banner end\n\n## Pharmaceutical Technology Excellence Awards - The Benefits of Entering\n\nGain the recognition you deserve! The [Pharmaceutical Technology Excellence Awards](https://www.pharmaceutical-technology.com/excellence-awards/?utm_source=verdict_news&utm_medium=footer_cta&utm_campaign=EA_2025_news&utm_id=exawards2025) celebrate innovation, leadership, and impact. By entering, you showcase your achievements, elevate your industry profile, and position yourself among top leaders driving pharmaceutical advancements. Don’t miss your chance to stand out—submit your entry today!\n\n**Nominate Now**\n\n.cell .large-8\n\n### Go deeper with GlobalData\n\n- Reports LOA and PTSR Model - Cemiplimab in Angiosarcoma - Reports LOA and PTSR Model - Cemiplimab in Head And Neck Cancer Squamous Ce...\n\n##### Go deeper with GlobalData\n\nThe gold standard of business intelligence.\n\n[Find out more](https://www.pharmaceutical-technology.com/buy-reports/?utm_source=LGP-Article&utm_content=Be_better_informed&utm_campaign=LGP_Premium-Insight-Landing-Page)\n\n.about-premium-insights\n\n.grid-x\n\n.gdm-recommended-reports\n\n#### Discover B2B Marketing That Performs\n\nCombine business intelligence and editorial excellence to reach engaged professionals across 36 leading media platforms.\n\n[Find out more](https://www.globaldatamarketingsolutions.com/)\n\n.companies-intelligence\n\n.data-feeds\n\n.gdm-sidebar\n\n.grid-x",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "The Evolving World of Pharma Marketing | Pharmacy Times",
      "url": "https://www.pharmacytimes.com/view/the-evolving-world-of-pharma-marketing?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/7325ba49eb651331e6ba06add8f9fc9bff1a0698-604x360.jpg",
        "1": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/d9516e78e2d215da32c000640cc820ead3a62df3-1140x638.png?w=350&fit=crop&auto=format",
        "2": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/wa0h5ycg4hu4-PTCE_Hyperglycemia_10-14_Webinar_090525v1_800x385.png",
        "3": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/l5w87od5cj18-PTCE_DIOP-2025_092625v2_West-Coast_800x385.png",
        "4": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/56qgws8xs1cp-PTCE_IgAN-2_Webinar_090425v1_800x385.png"
      },
      "content": "# The Evolving World of Pharma Marketing\n\nPharma companies that shift their attention to what providers, payers, and patients are asking for will profit from the growing worldwide market on preventative care.\n\nPharmaceutical marketing today: It’s about the drugs, not the user\n\nPharmaceutical marketing is big business and it continues to grow at a rapid rate. In fact, the marketing spend in the pharmaceutical sector has increased by nearly 70% in the past 20 years and now totals nearly $30 billion dollars.1\n\nThe question is whether the current approach to pharma marketing will continue to work in the evolving new world of patient advocacy, preventative care, and strong proof of outcomes demands? We believe the future of pharma marketing looks bright.\n\nThose businesses that embrace the power of digital innovation and a customer-first business model will succeed in building more effective interactions, deeper loyalty, and lasting brand preference. Despite the squeeze of cost-control, regulatory restrictions, and global competition, the marketing world of pharma will adapt going forward to focus on the user, not the drugs.\n\nThe one-size-fits all approach won’t work anymore\n\nTraditional marketing strategies in this industry have revolved around vigorous product marketing of the prescription drugs that the decision-makers think will make money. Commercial success is attributed to aggressive digital marketing and promotional activity—usually targeted to the physician.2 Responding to the needs and expectations of patients, providers, and payers hasn’t typically been the top goal, but that’s about to change.\n\nThe current state of pharmaceutical marketing is complex and usually takes 1 of 2 paths: direct-to-consumer or direct-to-provider/payer. Pharmaceutical firms today don’t normally differentiate between these 2 channels.\n\nThey tend to take more of a one-size-fits-all approach. This runs counter to today’s way of thinking, which is all about personalization, customer experience, and targeted omni-channel marketing of the right product, at the right time, to the right user, and using the right media.\n\nThe shift to value-based health care has arrived\n\nOur fast-changing market demands more value than ever before from pharmaceutical manufacturers. In this case, value means more cost efficiency, proven patient outcomes, and greater contribution to the overall health care experience throughout the value chain.\n\nThose pharma companies that shift their attention to what providers, payers, and patients are asking for will profit from the growing worldwide market on preventative care. The key will be becoming a key player in the integrated health management model that ties traditional pharmaceutical marketing into mobile communications, and other online platforms for diagnosis and marketing.3\n\nThe tight regulatory environment surrounding pharmaceutical marketing continues to be a challenge to providing value-based health care. Notably, there is no evidence to suggest that the regulatory landscape for marketing pharmaceuticals will become clearer and easier any time soon.\n\nAn alternative to the heavy regulation of mass-marketing advertising might be found in less traditional, more relationship-focused digital marketing channels that better align with the new environment of patient/provider/payer control, values-based outcomes, chronic disease prevention, the internet as an information gathering tool, and specialized marketing of specialty information to a targeted pool of relevant patients.3\n\nChanging the consumer experience\n\nBy 2050, there will be 2 billion people around the world who are over 60 years of age. As well, the number of seniors (65+ years of age) in the United States is expected to double to 100 million by 2060.4 This aging demographic will boost the market for prescription drug treatments to approximately $1.2 trillion by 2024.4 Without a doubt, demographics is a powerful driver of change.\n\nA multi-disciplinary approach to health care\n\nThe health care system is responding to the evolving trend toward integrated health management by implementing a multi-disciplinary approach to health care. Pharmaceutical companies are responding with personalized and improved offerings that have been fine-tuned to address patients’ specific needs throughout the health care value chain.5\n\nHealth care technology is the key to enabling a patient-centric approach. This approach could perhaps be achieved using predictive analytics tools, powered by artificial intelligence and machine learning to help determine which patients are at the highest risk of hospital readmission.\n\nOr it may be mobile apps and wearables to help monitor patients’ at-home recovery. It could be something as simple as packaging information better and more consistently online to accommodate the evolving ways patients research and consume drug information.6\n\nRegardless of which technologies are used and how they are levered, those pharmaceutical companies who insert themselves into this value chain in a meaningful way with patients, providers, and payers, will build value, trust, and loyalty with their constituents. In doing so, they’ll be miles ahead of the pharmaceutical companies who cling to in-person physician visits and sales sampling that worked in the past.\n\nThe advent of personalized, omnichannel marketing\n\nAs the outcomes-based approach to health care grows in popularity, now is the time for pharmaceutical agencies to benefit from a new personalized, omnichannel approach to marketing. This means enabling different strategies for marketing directly to consumers and in detailing to physicians, as well as payers.\n\nAdvanced pharma marketers are moving into precision marketing, which is all about targeting on digital platforms with custom messaging for a specialty segment of consumers who need the information most.6 Others are experimenting with programmatic advertising, which is a marketing tool that automatically optimizes digital campaigns using machine learning, which serves ads to users based on their online visits and behavior.7\n\nTo be successful with specialty marketing to smaller segments with custom treatment offerings, an investment in technologies to leverage the power of big data is a prerequisite.\n\nDisruptive technologies in pharma marketing\n\nPatients today require a different approach to addressing their health problems. Mobile technologies, social media, the cloud, and the Internet of Things (IoT) are just some of the new realities that are disrupting health care today.8\n\nSavvy pharmaceutical marketers see the opportunity that lies in leveraging tools that can monitor a patient’s health and provide real-time, personalized feedback to help improve outcomes. Making just minor tweaks to the marketing approach, along with taking advantage of disruptive technologies, can have a huge impact on growth and performance.\n\nUnlimited possibilities with personalization and segmentation\n\nFor example, a care plan for a Parkinson’s patient could include a “chip on a pill” to monitor drug-taking. This, along with a smartwatch or other sensor to monitor a patient’s condition, could set the stage for more robust engagement with health care professionals.\n\nOther technologies could provide the ability to send reminders about prescribed treatments and appointments. Such services are likely to improve outcomes beyond the need for expensive specialty drugs. Medication will always play a role in improving patient outcomes, but when it is combined with greater personalization and targeting, there’s no limit to what can be achieved.8\n\nA well thought-out strategy for data analytics and segmentation, customer journey mapping, and omni-channel marketing is what drives customer insights, targeted segment nurturing, and actionable insights that form the basis of powerful relationships and unforgettable experiences.\n\nSocial Marketing: A New Approach\n\nSocial marketing has been successful in delivering public health behavior changes for many years. It is an effective tool in understanding the methods for delivering information in a way that induces behavioral change.\n\nFor pharmaceutical companies, this means taking a holistic view of how to market medicine. They can no longer focus solely on the positive or negative health impacts of taking a drug. Instead, they need to delve more deeply into the social, cultural, economic, and ethical impacts of their medicine, and use these insights to personalize their approach to consumers. For example, if a certain group values preventive and community medicine, pharmaceutical companies must devise approaches to target this group, knowing that traditional pharmaceutical marketing won’t work.\n\nThe right information for the right channel\n\nClose to 85% of patients believe they can take responsibility for their own health and access the online resources they need.8 Nevertheless, the need for pharmaceutical companies to inform and influence patients and other stakeholders is more important than ever.\n\nThe ease of information flow can open up a whole new set of opportunities in marketing. The shift in types of interactions such as virtual care, patient portals, and other online resources can allow pharmaceutical companies to derive value by building advanced digital marketing and engagement capabilities similar to companies in other consumer goods industries.8\n\nAs mentioned above, the regulations for this industry are only becoming tougher as the scrutiny on personal data privacy increases. This will be the biggest obstacle for pharmaceutical companies to overcome in the future.\n\nThe Opportunity\n\nIn order for pharmaceutical companies to continue thriving, they need to engage with patients, who are becoming more aware of their health and are more focused on holistic health outcomes. This means expanding their offerings and capabilities to beyond drugs with a focus on continuous patient outcomes, using behavioral insights to drive how they market specific drugs, and using the appropriate channels to deliver the right information.\n\nBecoming visible, active partners in consumers’ management of their health might feel like an ambitious target at the moment, but technology evolves fast. In just a few years, the early health tech-adopting pharma companies may have earned the right to sit beside consumers in their homes.\n\nInvesting in emerging technologies isn’t without risk. For pharma firms in particular, regulatory considerations do not come without risk. Still, for those firms that embrace the power of technologies and put the customer first, the opportunity is endless.\n\nAbout The Author\n\nAnton Morrison is vice president, Experience & Design, at Appnovation. He has been creating effective digital experiences and strategies for some of the world’s most recognizable brands for over 20 years. His expertise runs seamlessly through design strategy, user experience, with an excellent track record of effective client relationships.\n\nReferences\n\n- https://jamanetwork.com/journals/jama/fullarticle/2720029\n\n- https://pharmaphorum.com/views-analysis-digital/nine-pharma-trends-for-2020/\n\n- https://mccannhealth.com/wp-content/uploads/2015/10/McCann-Health-Pharma-2020-From-Vision-to-Decision.pdf\n\n- https://www.visualcapitalist.com/future-pharma-market/\n\n- https://www.appnovation.com/blog/four-digital-health-trends-set-reinvent-and-re-energise-pharma\n\n- https://www.digitalpharmasummit.ca/wp-content/uploads/2019/12/FPM_Ebook_2020.pdf\n\n- https://www.pharmaceutical-technology.com/comment/pharma-digital-marketing-looks-take-personalised-approach/\n\n- https://www.mckinsey.com/industries/pharmaceuticals-and-medical-products/our-insights/the-road-to-digital-success-in-pharma\n\n### Newsletter\n\n## Related Content\n\n### Tramadol and Antidepressants Linked to Increased Seizure Risk in Older Adults\n\n### How a Government Shutdown Could Delay FDA Actions, Disrupt Pharmacy Operations\n\n### Viral Mimicry in DNA Repeats Offers Clues for Cancer Therapy\n\n### Poor Blood Sugar Control in Diabetic Teens May Lead to Nerve Damage Later in Life\n\n### Study Highlights Safety Concerns With Tramadol, Calls for Careful Prescribing\n\n## Latest CME\n\n## Clinical Presentation of Hyperglycemia With PI3K and AKT Inhibitors\n\nOctober 14, 2025 | 1:00 PM & 8:00 PM ET\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Translating New Clinical Evidence and Updated Guidelines Into Managed Care Strategies\n\nOctober 21, 2025 | 1:00 PM & 8:00 PM ET\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## New Horizons in ATTR-CM: Therapeutic Advances and Strategic Insights\n\nOctober 29, 2025 | 12:00 PM\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## Asembia Specialty Pharmacy Day of Education 2025\n\nThursday, November 6, 2025\n\n## Addressing Gaps in Care for Hyperkalemia With Novel Oral Potassium Binding Agents\n\nNovember 12, 2025 | 4:00 PM ET\n\n## Advancing Treatment Strategies in Extensive-Stage Small Cell Lung Cancer: Enhancing Pharmacist Competence in Therapy Selection, Administration, and Adverse Event Management\n\nNovember 12, 2025 | 1:00 PM & 8:00 PM ET\n\n## Pharmacists at the Forefront: Enhancing Targeted Therapy Implementation and Patient Outcomes in Advanced Gastric Cancer\n\nNovember 19, 2025 | 1:00 PM & 8:00 PM ET\n\n## Best Practice Approaches for Understanding Chronic Obstructive Pulmonary Disease and Precision Medicine Treatment\n\nNovember 20, 2025 | 1:00 PM & 8:00 PM ET\n\n## ASHP Midyear 2025\n\nDecember 8, 2025 | 11:30 AM - 1:00 PM PT\n\n## Exploring Advances in the Management of DOAC-Associated Bleeding With Reversal Agents: Role of the Health-System Pharmacists\n\n1.5 Credits / Cardiology, Patient Safety\n\n## Revolutionizing Acute Pain Relief: Emerging Nonopioid Therapies and the Essential Role of Managed Care\n\n2.0 Credits / Pain Management\n\n## PBM Challenges and the Evolving Role of Oncology Pharmacists in Community Practices\n\n0.75 Credit / Oncology, Law\n\n## Targeting Chronic Rhinosinusitis With Nasal Polyps With Biologics: Optimizing Outcomes and Reducing Health Care Burden\n\n1.5 Credits / Immunology\n\n## Aiming for Accuracy in Non-Small Cell Lung Cancer Treatment: Precision Strategies for Oncology Pharmacists\n\n0.75 Credit / Oncology, Lung Cancer\n\n## Advancing Chronic Lymphocytic Leukemia Treatment in the Community: Practical Updates and Clinical Pearls for Oncology Pharmacists\n\n0.75 Credit / Oncology, Hematologic Cancer, Hematology",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Five things for pharma marketers to know for Thursday, October 9, 2025",
      "url": "https://www.mmm-online.com/news/five-things-for-pharma-marketers-october-9-2025/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.mmm-online.com/wp-content/uploads/sites/2/2024/01/5-Things-Rx-Rundown_Jan-2024_Web-Art-fin-004-1280x900-1.png",
        "1": "https://www.mmm-online.com/wp-content/uploads/sites/2/2025/09/MMM-Aug-Sept-2025-cover-222x300.png",
        "2": "https://www.mmm-online.com/wp-content/uploads/sites/2/2024/01/5-Things-Rx-Rundown_Jan-2024_Web-Art-fin-004-1280x900-1-860x574.png",
        "3": "https://www.mmm-online.com/wp-content/uploads/sites/2/2025/08/MMM_State-of-Pharma_1280x900_1280-x-900__01-150x150.png",
        "4": "https://www.mmm-online.com/wp-content/uploads/sites/2/2024/01/5-Things-Rx-Rundown_Jan-2024_Web-Art-fin-004-1280x900-1-150x150.png"
      },
      "content": "- Share on Facebook\n\n- Share on Twitter\n\n- Share on LinkedIn\n\n- Share on Reddit\n\n- Share by Email\n\n- Print\n\nAccording to STAT, pharma companies are scrambling to make deals with Trump after the Pfizer-White House agreement. The publication reported that deals could be announced as soon as this week. (STAT News)\n\nAmazon said that its pharmacy business will start filling medications for common prescriptions at One Medical primary care locations in December. The company plans to roll out drugs like antibiotics, asthma inhalers and prescriptions for blood pressure. (Reuters)\n\nA court ruling allows Medicare to negotiate prices for a larger number of drugs. The federal judge rejected Novo Nordisk’s appeal to challenge the Medicare drug pricing program. (MSN)\n\nVerona Pharma plc’s trading on Nasdaq has been suspended. This comes a week after the company said it will be acquired by pharma giant Merck in a $10 billion acquisition. (Yahoo Finance)\n\nSix former U.S. surgeon generals wrote an op-ed, warning the public about HHS Robert F. Kennedy Jr. In the op-ed, they stated that Kennedy is “endangering the health of the nation,” noting that never before have all six come together to issue a statement like this. (Axios)\n\nTo read yesterday’s edition of Five things for pharma marketers to know, click here.\n\n- The state of pharma’s chief marketing officers in 2025: Goals in a changing healthcare landscape Lecia Bushak October 8, 2025\n\n- Five things for pharma marketers to know for Wednesday, October 8, 2025 Heerea Rikhraj October 8, 2025\n\n- Five things for pharma marketers to know for Tuesday, October 7, 2025 Heerea Rikhraj October 7, 2025\n\n- MM+M Media Summit 2025 Now in its fourth year, the MM+M Media Summit brings together trailblazers from across health media and pharma marketing for a full day of bold, forward-looking conversations.\n\n## MM+M Media Summit 2025\n\nNow in its fourth year, the MM+M Media Summit brings together trailblazers from across health media and pharma marketing for a full day of bold, forward-looking conversations.\n\n- From Our Partners Partner Content Places to Be 2024 Get to know each of these companies by learning about their culture, work/life balance, D&I initiatives and more. Partner Content Turning nudges into big wins in point-of-care marketing How artificial intelligence can deliver more meaningful business outcomes for marketers. Partner Content For pharma brands, streaming is critical for awareness By leveling up their streaming campaigns, advertisers can achieve big lifts in awareness and sales of their medications among all demographics. Partner Content HCG: Accelerating the impact of your science In a world where healthcare is moving fast, HCG is moving faster. Always ahead of the curve, HCG is spearheading the charge to turn scientific potential into real-world impact.\n\n## From Our Partners\n\n###### Partner Content\n\n##### Places to Be 2024\n\nGet to know each of these companies by learning about their culture, work/life balance, D&I initiatives and more.\n\n###### Partner Content\n\n##### Turning nudges into big wins in point-of-care marketing\n\nHow artificial intelligence can deliver more meaningful business outcomes for marketers.\n\n###### Partner Content\n\n##### For pharma brands, streaming is critical for awareness\n\nBy leveling up their streaming campaigns, advertisers can achieve big lifts in awareness and sales of their medications among all demographics.\n\n###### Partner Content\n\n##### HCG: Accelerating the impact of your science\n\nIn a world where healthcare is moving fast, HCG is moving faster. Always ahead of the curve, HCG is spearheading the charge to turn scientific potential into real-world impact.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "AI in Drug Discovery Market Transforming Pharmaceutical Research with Intelligent Automation",
      "url": "https://www.openpr.com/news/4218150/ai-in-drug-discovery-market-transforming-pharmaceutical?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.open-pr.com/L/a/La10806087_g.jpg",
        "1": "https://cdn.open-pr.com/L/a/La10305094_g.jpg",
        "2": "https://cdn.open-pr.com/L/a/La10306941_g.jpg",
        "3": "https://cdn.open-pr.com/L/a/La10294316_g.jpg"
      },
      "content": "# AI in Drug Discovery Market Transforming Pharmaceutical Research with Intelligent Automation\n\n## Press release from: Exactitude Consultancy\n\nAI in Drug Discovery Market\n\nPermanent link to this press release:\n\n### You can edit or delete your press release AI in Drug Discovery Market Transforming Pharmaceutical Research with Intelligent Automation here\n\n## More Releases from Exactitude Consultancy\n\nAll 5 Releases\n\n## More Releases for Drug\n\n- Home\n\n- Categories Advertising, Media Consulting, Marketing Research Arts & Culture Associations & Organizations Business, Economy, Finances, Banking & Insurance Energy & Environment Fashion, Lifestyle, Trends Health & Medicine Industry, Real Estate & Construction IT, New Media & Software Leisure, Entertainment, Miscellaneous Logistics & Transport Media & Telecommunications Politics, Law & Society Science & Education Sports Tourism, Cars, Traffic RSS-Newsfeeds\n\n- Submit Press Release Submit Press Release Free of Charge Pressemitteilung kostenlos veröffentlichen\n\n- Order Credits\n\n- Archive\n\n- Magazine\n\n- PR-Wiki",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Revolutionising health care: Exploring the latest advances in medical sciences",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC10401902?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "jogh-13-03042-F1.jpg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-pubmed/1a29c3ef-534f-5592-aae9-76b794c70ac8/jogh-13-03042-F1.jpg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22jogh-13-03042-F1.jpg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QP6I6QYZKM%2F20251010%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251010T132742Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEFUaCXVzLWVhc3QtMSJIMEYCIQCg5%2FoEktiEeZvXyYExqoxsYBN6kbDVIJPzgre4g1rpoQIhALsEW9waySNbHqvRXVuxhZRFBcMc8U54IKBWTNLcvGgLKpIECO3%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMNjI3NjY1ODU1NTE5Igy1GEvyf346Ny5Clv0q5gP4g3FGbMu8HdBTio1DmNzsw0EXSu4C8GDtOuuZRXdtK8LxQMrStUWRlRFWqnlxaZGjz1S%2F6pOTCeR1DZ%2BHDsWFcNAN5Vny2qTg0UYDwaKK6srgy8NJt7hHeLB7nX7t520Up1Y%2Flo8s6xwYKPikfITZH4gFSs924WdIRXnHoFUWHSA%2Bc%2BCYu%2FflHUXb1Jh2gzmCBRLbRpGODD9O%2FG3B4Ad0rOc7sjaLYjkVAG8ukqImTG4ismD2le3jMhyStO8YRefIOeFypj6u%2BcIU28geljTyikIrvOglqqHHfA4IUyfDWriRr8g%2Fy5i97i6UqnLSLzVffiRfJ4iKizUg9difcaaSX3ggCLRIECIV0AHe9FapeslJSypTIqda5GGXXWT0jSEgZTs0gVGB8hm0exWFjWPT1LbCfNNG2lfLkSVBwaRglktUfWEdhm9yndc4NGs8835tS%2Box78a%2Bh4PrNtlCPQrrhncrgDD19lnQ94IqxOQJ2mUY2rLU1NRzV1pnI06YQgRK6pAXGaql%2FVFir7m8jVWvGBV9F15b8Eiw50Czx9icRZ0w4sfeKQW89aUzGdA0LQN0t1jK%2FkuQ0hWHHNqBY4Nv%2Bsld7HfBP3ZQR5pw62EG9gnwkP14iqM4KEbZJRQO%2BNsS66KA6OAws%2FSjxwY6pAEfnbiwmD8SztA1cDF5H558Cig5mOitluAggP5ALKStDHAKT%2FjZhvz05TrJnZ32%2BWQwh1X5Cz0XkkdAB5Z6ZIwMtkUvIh6aTA%2F9GLSlS2H9hrorMBNEvVxtxi9VWSlAPF7QTm8HYDkaFa6FhLzWL0v8Es8du6FOQ1xOBR%2FkfJOTCP7gYeOljLQEtJDjLAqETdE4dTf7G6IhveGujb3NyTj%2BidhupA%3D%3D&X-Amz-Signature=049e872df9b104254550f3304287e1d00849f181c64616349e30de9c8d3df3db"
      },
      "content": "Recent years have seen a revolution in the domain of medical science, with ground-breaking discoveries changing health care as we once knew it [1]. These advances have considerably improved disease diagnosis, treatment, and management, improving patient outcomes and quality of life [2-5]. These innovations range from the creation of novel medications and treatments to the utilization of cutting-edge technologies. For instance, gene editing technologies like Clustered Regularly Interspaced Palindromic Repeats (CRISPR-Cas9) have opened up new treatment options for genetic illnesses [6], while the development of mRNA vaccines has offered a desperately needed response to the coronavirus disease 2019 (COVID-19) pandemic [7]. Moreover, wearable technology and telemedicine have improved accessibility, convenience, and personalization of health care, whereas 3D printing and nanotechnology breakthroughs have made it possible to create individualized implants and drug delivery systems [8-10]. This article examines some of the most recent developments in medical research and how they might completely change health care delivery.\n\nThe selection process for identifying the latest advances in medical sciences for this article was as follows. We aimed to showcase ground-breaking developments with the potential to revolutionise health care practices and significantly impact patient outcomes. We extensively searched reputable scientific journals, conferences, and reports from recognized health care organisations and institutes. We included the novelty and significance of the advancements, their ability to address existing health care challenges, the level of scientific evidence supporting their efficacy, and their potential for widespread adoption and implementation. By utilizing this process, we ensured that the selected advancements represent diverse medical fields and have the capacity to drive significant advancements in patient care, diagnostics, treatment modalities, and health care delivery.\n\n## REGENERATIVE THERAPY TREATMENT\nRegenerative medicine is a rapidly growing field that seeks to restore, replace, or regenerate damaged tissues and organs using a variety of approaches, including cell therapy, tissue engineering, and gene therapy [11]. This field has the potential to revolutionise the treatment of many diseases and injuries that are currently incurable or difficult to treat. For example, stem cell therapy has been shown to be effective in treating spinal cord injuries [12], with several studies reporting significant improvements in motor function and sensory perception [13]. Tissue engineering approaches are being developed to replace damaged or diseased organs using 3D printing, such as the liver, pancreas, and heart [11,14]. Gene therapy is being used to target genetic disorders, such as sickle cell anaemia and cystic fibrosis, with promising results [15]. The development of regenerative medicine has the potential to transform the treatment of many diseases and injuries, providing hope for patients with conditions that are currently considered untreatable [16-18].\n\n## DEVELOPMENT OF IMPLANTABLE ARTIFICIAL ORGANS\nVarious replacement or augmentation devices for organs, such as the eyes, kidneys, heart, muscle, liver, skin, and brain, have been developed due to the creation of implantable artificial organs [4]. Artificial organs can be developed from a number of substances, such as polymers and biological tissues, and are intended to mimic the shape and functionality of actual organs [19]. For instance, the Wearable Artificial Kidney (WAK) has promise for enhancing the quality of life for individuals with end-stage of renal illness [20]. The creation of artificial hearts ([F1]), such as the Total Artificial Heart (TAH), has the potential to extend the lives of patients awaiting heart transplants [21-23].\n\nFurthermore, scientists are developing artificial muscles, liver tissue replicas, skin grafts, and brain implants. For instance, a study by Kolesky et al. [24] reported the successful implantation of a 3D-printed artificial skin graft. Additionally, a study by White [25] and Weng et al. [26] revealed the development of a 3D-printed muscle tissue construct [26]. Although the research into implantable artificial organs is still in its infancy, it has the potential to transform how organ failure is treated and enhance patient outcomes [4].\n\n## ADVANCEMENTS IN NANOTECHNOLOGY IN HEALTH SCIENCE\nAnother fast-expanding and highly promising area of use for nanotechnology is in the field of medicine. Drugs and other therapeutic substances can be delivered directly to a disease site using nanoparticles because they can target particular cells or tissues in the body [27]. This technology may improve the efficacy of therapies, lessen their negative effects, and potentially enable the treatment of previously incurable diseases [28].\nCurrent developments in nanotechnology have demonstrated considerable promise for the medical field. A study by Foglizzo and Marchio [10] created a multifunctional nano platform that delivered chemotherapeutic medication and an immunomodulatory substance to tumour cells, increasing antitumor activity and minimizing adverse effects. Using nanotechnology, a magnetic resonance imaging (MRI) contrast agent that can specifically target and image pancreatic cancer cells was created [29]. Moreover, nanotechnology has demonstrated promise in the treatment of diseases like brain tumours that were previously incurable. A study by Chen et al. [30] created a nano platform that specifically targeted and delivered medications to brain tumour cells, improving survival rates in a mouse model. These recent developments show how nanotechnology has the potential to enhance therapeutic efficacy, lessen adverse effects, and broaden the scope of diseases that can be treated [31,32].\n<FG id='F1'>\n**Figure 2**: Figure 1\n<F href='jogh-13-03042-F1.jpg'>\nArtificial Intelligence, Brain. Image by Gerd Altmann. Source: Pixabay, free to use under Content License ([https://pixabay.com/service/license-summary/]()).\n</F>\n</FG>",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Biomedical sciences",
      "url": "https://en.wikipedia.org/wiki/Biomedical%20sciences?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Biomedical sciences are a set of sciences applying portions of natural science or formal science, or both, to develop knowledge, interventions, or technology that are of use in healthcare or public health.  Such disciplines as medical microbiology, clinical virology, clinical epidemiology, genetic epidemiology, and biomedical engineering are medical sciences.  In explaining physiological mechanisms operating in pathological processes, however, pathophysiology can be regarded as basic science.\n\nBiomedical Sciences, as defined by the UK Quality Assurance Agency for Higher Education Benchmark Statement in 2015, includes those science disciplines whose primary focus is the biology of human health and disease and ranges from the generic study of biomedical sciences and human biology to more specialised subject areas such as pharmacology, human physiology and human nutrition. It is underpinned by relevant basic sciences including anatomy and physiology, cell biology, biochemistry, microbiology, genetics and molecular biology, immunology, mathematics and statistics, and bioinformatics. As such the biomedical sciences have a much wider range of academic and research activities and economic significance than that defined by hospital laboratory sciences. Biomedical Sciences are the major focus of bioscience research and funding in the 21st century.\n\nRoles within biomedical science\nA sub-set of biomedical sciences is the science of clinical laboratory diagnosis. This is commonly referred to in the UK as 'biomedical science' or 'healthcare science'. There are at least 45 different specialisms within healthcare science, which are traditionally grouped into three main divisions:\n specialisms involving life sciences\n specialisms involving physiological science\n specialisms involving medical physics or bioengineering\n\nLife sciences specialties\n\n Molecular toxicology\n Molecular pathology\n Blood transfusion science\n Cervical cytology\n Clinical biochemistry\n Clinical embryology\n Clinical immunology\n Electron microscopy\n External quality assurance\n Haematology\n Haemostasis and thrombosis\n Histocompatibility and immunogenetics\n Histopathology and cytopathology\n Molecular genetics and cytogenetics\n Molecular biology and cell biology\n Microbiology including mycology\n Bacteriology\n Tropical diseases\n Phlebotomy\n Tissue banking/transplant\n Virology\n\nPhysiological science specialisms\n\nPhysics and bioengineering specialisms\n\nBiomedical science in the United Kingdom \nThe healthcare science workforce is an important part of the UK's National Health Service. While people working in healthcare science are only 5% of the staff of the NHS, 80% of all diagnoses can be attributed to their work.\n\nThe volume of specialist healthcare science work is a significant part of the work of the NHS. Every year, NHS healthcare scientists carry out:\n nearly 1 billion pathology laboratory tests\n more than 12 million physiological tests\n support for 1.5 million fractions of radiotherapy\n\nThe four governments of the UK have recognised the importance of healthcare science to the NHS, introducing the Modernising Scientific Careers initiative to make certain that the education and training for healthcare scientists ensures there is the flexibility to meet patient needs while keeping up to date with scientific developments.\nGraduates of an accredited biomedical science degree programme can also apply for the NHS' Scientist training programme, which gives successful applicants an opportunity to work in a clinical setting whilst also studying towards an MSc or Doctoral qualification.\n\nBiomedical Science in the 20th century \nAt this point in history the field of medicine was the most prevalent sub field of biomedical science, as several breakthroughs on how to treat diseases and help the immune system were made. As well as the birth of body augmentations.\n\n1910s \nIn 1912, the Institute of Biomedical Science was founded in the United Kingdom. The institute is still standing today and still regularly publishes works in the major breakthroughs in disease treatments and other breakthroughs in the field 117 years later. The IBMS today represents approximately 20,000 members employed mainly in National Health Service and private laboratories.\n\n1920s \nIn 1928, British Scientist Alexander Fleming created the first antibiotic penicillin. This was a huge breakthrough in biomedical science because it allowed for the treatment of bacterial infections.\n\nIn 1926, the first artificial pacemaker was made by Australian physician Dr. Mark C. Lidwell. This portable machine was plugged into a lighting point. One pole was applied to a skin pad soaked with strong salt solution, while the other consisted of a needle insulated  up to the point and was plunged into the appropriate cardiac chamber and the machine started. A switch was incorporated to change the polarity. The pacemaker rate ranged from about 80 to 120 pulses per minute and the voltage also variable from 1.5 to 120 volts.\n\n1930s \nThe 1930s was a huge era for biomedical research, as this was the era where antibiotics became more widespread and vaccines started to be developed. In 1935, the idea of a polio vaccine was introduced by Dr. Maurice Brodie. Brodie prepared a killed poliomyelitis  vaccine, which he then tested on chimpanzees, himself, and several children. Brodie's vaccine trials went poorly since the polio-virus became active in many of the human test subjects. Many subjects had fatal side effects, paralyzing, and causing death.\n\n1940s \nDuring and after World War II, the field of biomedical science saw a new age of technology and treatment methods. For instance in 1941 the first hormonal treatment for prostate cancer was implemented by Urologist and cancer researcher Charles B. Huggins. Huggins discovered that if you remove the testicles from a man with prostate cancer, the cancer had nowhere to spread, and nothing to feed on thus putting the subject into remission. This advancement lead to the development of hormonal blocking drugs, which is less invasive and still used today. At the tail end of this decade, the first bone marrow transplant was done on a mouse in 1949. The surgery was conducted by Dr. Leon O. Jacobson, he discovered that he could transplant bone marrow and spleen tissues in a mouse that had both no bone marrow and a destroyed spleen. The procedure is still used in modern medicine today and is responsible for saving countless lives.\n\n1950s \nIn the 1950s, we saw innovation in technology across all fields, but most importantly there were many breakthroughs which led to modern medicine. On 6 March 1953, Dr. Jonas Salk announced the completion of the first successful killed-virus Polio vaccine. The vaccine was tested on about 1.6 million Canadian, American, and Finnish children in 1954. The vaccine was announced as safe on 12 April 1955.\n\nSee also\n\nReferences\n\nExternal links\nExtraordinary You: Case studies of Healthcare scientists in the UK's National Health Service\nNational Institute of Environmental Health Sciences\nThe US National Library of Medicine\nNational Health Service\n\nHealth care occupations\nScience occupations",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "Medical Biochemistry BSc | University of Leicester",
      "url": "https://le.ac.uk/courses/medical-biochemistry-bsc/2026?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://le.ac.uk/-/media/uol/images/course-pages/cls-2020-heros/medical-biochem-bsc-hero.jpg",
        "1": "https://le.ac.uk/-/media/uol/images/course-pages/cls-2020-heros/medical-biochem-bsc-hero.jpg?cx=0&cy=0&cw=480&ch=409&hash=2C6C765C484B3EB9ED21B52A6C0926E5",
        "2": "https://le.ac.uk/-/media/uol/images/course-pages/quotes/ug/ug-bio-sci-quote.jpg?la=en&h=179&w=627&mw=627&hash=392569622F3769146A09AB9CEC37DBE1"
      },
      "content": "Medical Biochemistry BSc\n\n## 3-4 years\n\nMany of today’s common diseases are linked to defects in the molecular processes that occur in the body. To make big breakthroughs in diagnosing and treating disease, we therefore often have to look at life at the molecular level. Studying biochemistry in this way will give you an understanding of some of the world’s most pressing health issues.\n\n[Submit course enquiry](https://le.ac.uk/study/undergraduates/enquire)\n\nMAIN CONTENT\n\nUCAS code\n\nstart: page-intro\n\n# Medical Biochemistry BSc,    3-4 years\n\nMany of today’s common diseases are linked to defects in the molecular processes that occur in the body. To make big breakthroughs in diagnosing and treating disease, we therefore often have to look at life at the molecular level. Studying biochemistry in this way will give you an understanding of some of the world’s most pressing health issues.\n\nDisplay course years\n\nStart date: 2026\n\n## Course information\n\nTypical offer ABB\n\nUCAS CODES\n\nUCAS code C720\n\nInstitute code L34\n\nSubject area\n\n- [Biological Sciences facilities](https://le.ac.uk/biological-sciences/study/undergraduate/facilities) - [Scholarships](https://le.ac.uk/study/undergraduates/scholarships-bursaries-discounts)\n\nBelow are the three different elements that can go into this area (Image only, Text/Link and Video popup)\n\nThis course is accredited by the Royal Society of Biology. School of Biological Sciences website\n\nend: page-intro\n\n### Course description\n\n## Course description\n\nThis course will give you a firm grounding in modern biochemistry, covering a broad range of topics with particular emphasis on how the subject relates to medicine and health issues. You will explore the fundamental biochemical processes of cells and how they are controlled, and learn about how these processes go wrong in disease states. By understanding the molecular defects that occur in a particular disease, you will learn how scientists and clinicians can work together to design appropriate drugs that target the affected molecules. There is an emphasis on emerging technologies that are being used to address key issues in human health, including gene editing, as well as consideration of the ethics dilemmas of these approaches.\n\nOn this course you will develop a range of skills that are valued by employers, including practical, analytical and problem-solving skills, as well as gaining experience in handling complex information. You will also develop transferable skills in time-management, meeting deadlines, giving oral presentations and working in teams to achieve a goal. You will have some flexibility to study modules in other biological sciences specialisms, enabling you to apply your knowledge across the boundaries of traditional disciplines and become a valuable and powerful asset in scientific environments and in many other walks of life.\n\nThis course is identical to the first three years of the [MBiolSci in Medical Biosciences (Biochemistry)](https://le.ac.uk/courses/medical-biosciences-biochemistry-mbiolsci).\n\nThis course is accredited by the Royal Society of Biology for the purpose of meeting (in part) the academic and experience requirement for the Membership and Chartered Biologist (CBiol). Accredited degree programmes contain a solid academic foundation in biological knowledge and key skills, and prepare graduates to address the needs of employers. The accreditation criteria require evidence that graduates from accredited programmes meet defined sets of learning outcomes, including subject knowledge, technical ability and transferable skills.\n\n### What's the difference?\n\nAt the University of Leicester, we offer seven Biological Science subjects and four Medical Bioscience subjects, all as BSc (three years) and most as MBiolSci (four years), plus a Foundation Year option, giving you an impressive range of different courses to choose from.\n\n- **Biological Science** covers major aspects of biology and molecular science across a wide range of organisms from bacteria and fungi to humans and plants. All 14 courses share a common first year so you can change to a different degree before the end of Year 1. - **Medical Science** allows you to select specialist modules that focus more closely on the application of biological principles to medicine. All eight courses share a common first year so you can change to a different degree before the end of Year 1.\n\nIt is possible to switch between a Biological Science course and a Medical Bioscience course during the first half of your first year, but after that the two fields diverge.\n\n[Watch the full subject spotlight on Springpod](https://www.springpod.com/subject-spotlights/university-of-leicester/biological-sciences/SS-00161)\n\n### Entry requirements\n\nstart: requirement-block\n\n## Entry requirements\n\n- **A-levels**: ABB, including at least two relevant science subjects from Biology, Chemistry, Maths, Physics or Psychology. We may consider two AS-levels in place of one A-level. General Studies not accepted. - **EPQ with A-levels**: BBB + EPQ grade B. A-level subjects to include two relevant science subjects from Biology, Chemistry, Maths, Physics or Psychology. General Studies not accepted. - **Level 3 Core Maths with A-levels**: BBB + Level 3 Core Maths grade B (if Maths not taken as a full A or AS level). A-level subjects to include two relevant science subjects from Biology, Chemistry, Physics or Psychology. General Studies not accepted. - **GCSE**: At least Grade 4/C in both English Language and Maths (if not held at A2/AS-level). - **Access to HE Diploma**: Pass Science diploma with 45 credits at level three, 30 of which must be at distinction. - **International Baccalaureate**: Pass Diploma with 30 points to include grade 6 and 5 in at least two relevant HL science subjects from Biology, Chemistry, Maths, Physics or Psychology. Must include a minimum of grade 4 in SL Maths or 3 at HL and grade 4 in English A or 5 in English B if minimum of grade 4/C not held in English Language and Maths at GCSE. - **BTEC Nationals**: Pass Applied Science Diploma with D*DD plus five GCSEs at B/5 or above including two relevant sciences. - **T Levels**: Distinction in Science (with an Occupational Specialism in Laboratory technician).\n\nOther official national and international qualifications considered from across the world. You can review some of the qualifications we accept on our [countries page](https://le.ac.uk/study/international-students/countries) and [English Language equivalencies](https://le.ac.uk/study/international-students/english-language-requirements/equivalent).\n\nIf your qualification or country is not listed, please [contact us](https://le.ac.uk/study/undergraduates/enquire) for more information, including the name and result of the qualification you have studied.\n\nSecond year entry may be possible with suitable qualifications.\n\n### Flexible entry requirements\n\nWe welcome applications from motivated students whose predicted grades are slightly below our standard entry requirements. We understand that predicted grades are not always an accurate reflection of your final results, and we’re happy to consider your application. Although we can’t guarantee an offer due to the high volume of applications, if you’re eligible, we may still offer you a place based on our standard requirements.\n\n### Contextual offers\n\nThe University of Leicester is committed to providing equitable opportunities for all applicants from all backgrounds. We make contextual offers to support students who may be impacted by the area they live in, their personal circumstances or who have completed one of our [progression programmes](https://le.ac.uk/study/schools-and-colleges/post-16). These offers are usually one or two grades lower than the standard entry requirements. To qualify for a contextual offer, you must apply for an eligible course and meet specific criteria – [check if you’re eligible](https://le.ac.uk/policies/admissions/after-applying/undergraduates/your-offer/contextual).\n\n### Selection Process\n\nWhen considering your application, we will look for evidence that you will be able to fulfil the objectives of the course and achieve the standards required. We will take into account a range of factors including previous exam results.\n\nApplicants are not normally interviewed. If you receive an offer you will be invited to visit the School of Biological Sciences.\n\n### English Language Requirements\n\nIELTS 6.5 or equivalent. If your first language is not English, you may need to provide evidence of your [English language ability](https://le.ac.uk/study/international-students/english-language-requirements). If you do not yet meet our requirements, our [English Language Teaching Unit (ELTU)](https://le.ac.uk/cite/eltu) offers a range of courses to help you to improve your English to the necessary standard.\n\n### International Qualifications\n\nFind your country in this list to check equivalent qualifications, scholarships and additional requirements.\n\nCountries list\n\nend: requirement-block\n\n### Fees and funding\n\n## Fees and funding\n\n### UK Students\n\n#### Starting in 2026\n\nTuition fees for 2026/27 are yet to be confirmed. As an indication of what you might pay, the fees for students who started in 2025/26 were:\n\n- **£9,535**in your first year. Tuition fees may increase in subsequent years in line with inflation, subject to government regulations. The inflation rate used will be the Retail Price Index excluding mortgage payments (RPIX) - **Year Abroad:** your fee will be £1,430 for that year - **Year in Industry:** your fee will be £1,905 for that year - **Year in Research:** your fee will be £1,905 for that year - **Year in Enterprise:** your fee will be £1,905 for that year\n\nFind out more about [scholarships and funding](https://le.ac.uk/study/undergraduates/fees-funding).\n\n### International Students\n\n#### Starting in 2026\n\n- **£25,100** per year - **Year Abroad**: £6,275 which is 25% of the full-time tuition fee - **Year in Industry**: £3,765 which is 15% of the full-time tuition fee - **Year in Research**: £3,765 which is 15% of the full-time tuition fee - **Year in Enterprise**: £3,765 which is 15% of the full-time tuition fee\n\nIf you are resident outside the UK and the Republic of Ireland, you will need to [pay a deposit of £3,000](https://le.ac.uk/study/undergraduates/fees-funding/paying-your-fees/deposit) to secure your place. This will be subtracted from your total tuition fee.\n\nIf you are an EU national with settled or pre-settled status under the EU settlement scheme, you may qualify for the UK fee (subject to criteria).\n\nFind out more about [scholarships and funding](https://le.ac.uk/study/undergraduates/fees-funding).\n\n### Careers and employability\n\nstart: department-block\n\n## Careers and employability\n\nOur degrees prepare you for a wide range of career opportunities.\n\nYou will get excellent training in analytical thinking, data-analysis, problem-solving, the communication of complex concepts, and in how to apply scientific methodology to projects.\n\nThis unique transferable skills set means that University of Leicester Biological Sciences graduates are highly desirable to employers.\n\n### Bespoke careers support\n\nThe School of Biological Sciences offers a wide range of bespoke careers support tailored to your year or study to help you on your employability journey from day one.\n\nThis includes:\n\n- Timetabled “careers hours” given by school staff with specialist technical knowledge, employers (such as AstraZeneca, GSK, the NHS, and MERCK) and the Careers and Employability Team. Sessions run twice a month and are designed to give you practical advice, support and insider knowledge to get you into the career, or further study pathway, that you want. - Our 'careers after Biological Sciences' series of lectures features Leicester graduates giving insights and tips based on their career experiences with the exact degree that you will gain. - In the summer vacation between years 2 and 3, support to find research placements in laboratories, giving you the chance to develop your scientific skills. - Support in finding and obtaining “year out” opportunities such as a Year in Industry (for example current students are based in research institutes, the NHS, and the pharmaceutical industry) or to Study Abroad (for example in Europe, Japan, and the United States). - As a student in the School of Biological Sciences, you are welcome to attend seminars in any department, presented by national and international experts in the biosciences. - A tailored weekly bulletin of all biosciences-relevant careers opportunities. - Named points of contact in the University’s Careers and Employability Team with specific biosciences expertise.\n\n**Hear from Drew, a Medical Biochemistry student who completed her Year in Industry at GSK and has now secured a role in Marketing at Roche:**\n\n### Graduate destinations\n\nMany of our graduates follow further training for research careers in biology, often through our MSc or PhD programmes at Leicester.\n\nOthers gain positions in the NHS, in medical or pharmaceutical laboratories, in environmental management, in teaching, or in skilled professions outside of biology.\n\nA few examples of pathways that our graduates have successfully taken include:\n\n- Graduate medicine - Postgraduate research (MSc or PhD) - Laboratory Research Scientist - The NHS Scientist Training Programme - NHS Clinical Scientist (physiologist, genetic counsellor, mental health support) - Clinical trials coordination - Teaching - Science communication - Wildlife protection - Financial Auditor\n\n### The Royal Society of Biology\n\nThis course is accredited by the Royal Society of Biology. This means that for the duration of your studies, you will receive free membership of the Royal Society of Biology. This will open up networks for you, which can be important when applying for jobs.\n\nThe Royal Society of Biology is the leading professional body for the biological sciences in the United Kingdom. It represents over 17,500 biologists from all areas of the life sciences, as well as almost 100 organisations which make up the diverse landscape of biology in the UK and overseas. The Royal Society of Biology offers members unique opportunities to engage with the life sciences and share their passion for biology. Whichever area of biology you wish to gain a career in, membership will help you:\n\n- Stay up to date with what is happening across the life sciences - Gain additional recognition for your skills and experience - Develop your professional network - Demonstrate your support for the future of biology\n\nIn accrediting our degrees, the Royal Society of Biology, highlighted our “timetabled, bespoke, and structured employability support sessions” as an area of good practice that makes our Biological Sciences degrees stand out from the crowd.\n\n### Careers and Employability Service\n\nGet career-ready at Leicester with guidance from our award-winning Careers and Employability Service. We’re here to support your journey towards a successful future, including securing a great graduate job. With a lifetime offer of support (even after graduation) our specialist careers advisers and mentors will guide you every step of the way. From crafting standout CVs and acing interviews to accessing volunteering opportunities and placements, we’re here to help you achieve your professional goals.\n\nend: department-block\n\n### Sustainable Development Goals\n\n## Sustainable Development Goals\n\nWe are committed to providing skills and knowledge to help prepare you tackle global challenges. We have mapped our undergraduate degrees for learning which aligns to the [17 UN Sustainable Development Goals](https://le.ac.uk/about/making-a-difference/sdgs).\n\nThis degree includes learning which relates to the following UN Sustainable Development Goals:\n\n- **Goal 3:** [Health and well-being](https://le.ac.uk/about/making-a-difference/sdgs/health-and-wellbeing)\n\n[Find out more about the UN Sustainable Development Goals](https://le.ac.uk/about/making-a-difference/sdgs)\n\nCourse overview CTA\n\n### Apply now\n\n### Fees and funding\n\n### Receive email updates\n\n## Course structure\n\nAccordion / tab wrapper\n\n### Year 1\n\n## Year 1\n\n### Modules\n\n- [The Molecules of Life: An Introduction to Biochemistry and Molecular Biology](https://le.ac.uk/modules/2026/bs1030) (double module) - [The Cell: An Introduction to Cell Biology and Microbiology](https://le.ac.uk/modules/2026/bs1040) (double module) - [From Individuals to Populations: An Introduction to Genetics](https://le.ac.uk/modules/2026/bs1050) - [Multicellular Organisation: An Introduction to Physiology, Pharmacology and Neuroscience](https://le.ac.uk/modules/2026/bs1060) (double module) - [Introduction to Medical Bioscience](https://le.ac.uk/modules/2026/mb1080)\n\n**The modules listed reflect those currently available to students. Every year, we review our modules and their content to ensure that our courses maintain the best academic and student experience possible. Whilst this does mean elements of your course may change in future academic years, it ensures your course is giving you a research-inspired education and preparing you for your future.**\n\n### Year 2\n\n## Year 2\n\n### Core modules\n\n- [Biochemical Approaches to Therapeutic Development](https://le.ac.uk/modules/2026/mb2050) - [Research Skills 1](https://le.ac.uk/modules/2026/bs2000) - [Research Skills 2](https://le.ac.uk/modules/2026/bs2200) - [From Genes to Proteins](https://le.ac.uk/modules/2026/bs2091) - [Molecular Cell Biology](https://le.ac.uk/modules/2026/bs2092) - [Protein Structure and Function](https://le.ac.uk/modules/2026/bs2093)\n\n### Option modules\n\nChoose **one option module** from:\n\n- [Genomes](https://le.ac.uk/modules/2026/bs2009) - [Physiology and Pharmacology](https://le.ac.uk/modules/2026/bs2013) - [Physiology of Excitable Cells](https://le.ac.uk/modules/2026/bs2015) - [Principles of Microbiology](https://le.ac.uk/modules/2026/bs2030) - [A Field Guide to Evolution](https://le.ac.uk/modules/2026/bs2078) - [Medical Microbiology](https://le.ac.uk/modules/2026/mb2020) - [Introduction to Python programming for Bioscientists](https://le.ac.uk/modules/2026/bs2094)\n\nThen choose **one option module** from:\n\n- [Bioinformatics](https://le.ac.uk/modules/2026/bs2040) - [Contemporary Techniques in Biological Data Analysis](https://le.ac.uk/modules/2026/bs2004) - [Exercise Physiology and Pharmacology](https://le.ac.uk/modules/2026/bs2014) - [Genes, Development and Inheritance](https://le.ac.uk/modules/2026/bs2026) - [Immunology and Eukaryotic Microbiology](https://le.ac.uk/modules/2026/bs2032) - [Immunology and Eukaryotic Microbiology (with science enterprise trip)](https://le.ac.uk/modules/2026/bs2033) - [Behavioural Neurobiology](https://le.ac.uk/modules/2026/bs2066) - [Neurobiology and Animal Behaviour](https://le.ac.uk/modules/2026/bs2077)\n\n**The modules listed reflect those currently available to students. Every year, we review our modules and their content to ensure that our courses maintain the best academic and student experience possible. Whilst this does mean elements of your course may change in future academic years, it ensures your course is giving you a research-inspired education and preparing you for your future.**\n\n### Experience Year (optional)\n\n## Experience Year (optional)\n\nIf you want to, you can spend your third year studying abroad at one of our partner institutions, working in an industrial placement or even exploring your own business venture.\n\nThese options are competitive, and your success will be based on your academic performance, motivation and the strength of your application. You will receive guidance and support throughout the process to help you secure the opportunity that best aligns with your career aspirations.\n\n### Year Abroad\n\nWe’ll make sure you have everything you need for your future career: not just by awarding you a high quality degree, but also by helping you to develop the skills, knowledge and confidence you need to make your mark in the world as a Citizen of Change. One way you can do this is by opting to take a Year Abroad between Years 2 and 3 of your degree.\n\nStudying abroad is not just for people who are interested in travelling and meeting new people. It is about acquiring life skills that are becoming increasingly significant for a wide range of jobs in our modern globalised society. Whether you go on to a career in the private, public or third sector - or plough your own furrow as an entrepreneur – you will find the experience invaluable.\n\nFor more information, including a list of destinations, please visit our [Study Abroad website](https://le.ac.uk/cite/study-abroad-unit/outgoing).\n\n#### Please note\n\n- A year spent abroad still incurs a tuition fee, but this is much lower than for a normal year at Leicester. See the Fees and Funding tab of this page for details. - You may be eligible for a travel grant from [Student Finance England](https://www.gov.uk/travel-grants-students-england). - Places are offered on a competitive basis, and eligibility is dependent on your academic performance in Years 1 and 2. - Language courses, at beginners or advanced level, are available through our [Languages at Leicester](https://le.ac.uk/languages-at-leicester) scheme.\n\n### Year in Industry\n\nChoosing the ‘Year inh Industry’ pathway means you’ll spend a year immersed in a real-world work environment. During this placement year, you'll join a company where you can put your academic knowledge into practice, build your professional network, and enhance your employability.\n\nThis is a competitive programme and you it will be your responsibility to secure a placement, but throughout your journey you will be supported by the [Careers and Employability Service](https://le.ac.uk/study/undergraduates/careers). This includes access to digital tools, skills workshops, and one-to-one support drop-ins, among many other offers designed to help you achieve your goal.\n\nDuring your placement, you'll be supported by a dedicated industrial placement tutor who will provide guidance and conduct regular check-ins at your host company, ensuring you get the most out of your experience.\n\nA Year in Industry still incurs a tuition fee, but this is much lower than for a normal year at Leicester. You may also be eligible for financial support through Student Finance. See the Fees and Funding tab of this page for details.\n\nHear from Esther as she discusses her Year in Industry experience at the medical research charity, LifeArc:\n\n### Year in Research\n\nChoosing the 'Year in Research' pathway means you’ll spend a year immersed in a real-world research environment. During this placement year, you'll join a research team where you can apply your academic knowledge to practical research projects, develop your specialised skills, and build your professional network.\n\nThis is a competitive programme and it will be your responsibility to secure a research placement, but throughout your journey you will be supported by the [Careers and Employability Service](https://le.ac.uk/study/undergraduates/careers). This includes access to digital tools, skills workshops, and one-to-one support drop-ins, among many other offers designed to help you achieve your goal.\n\nDuring your placement, you'll be supported by a dedicated research placement tutor who will provide guidance and conduct regular check-ins at your host institution, ensuring you get the most out of your experience.\n\nA Year in Research still incurs a tuition fee, but this is much lower than for a normal year at Leicester. You may also be eligible for financial support through Student Finance. See the Fees and Funding tab of this page for details.\n\n### Year in Enterprise\n\nChoosing the 'Year in Enterprise' pathway means you’ll spend a year developing your business idea in a real-world, self-employed setting – typically between your second and third years at Leicester. During this placement year, you'll have the chance to turn your entrepreneurial vision into reality while gaining invaluable experience in launching and managing your venture.\n\nIt will be your responsibility to secure a Year in Enterprise placement through our competitive University-managed application and selection process. However, throughout your first and second years, you’ll be fully supported by the [Careers and Employability Service](https://le.ac.uk/study/undergraduates/careers). This support includes skills workshops, one-to-one support drop-ins, and a range of enterprise initiatives to help you prepare and develop a viable business idea.\n\nOnce on placement, you’ll have access to a nurturing entrepreneurial community and support programme to aid building your venture. You’ll need to be based within commuting distance of the University of Leicester, working both remotely and from designated co-working spaces and University facilities.",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    },
    {
      "title": "FasterCures",
      "url": "https://en.wikipedia.org/wiki/FasterCures?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "FasterCures is a Washington, D.C.–based think tank that focuses on accelerating medical research. This healthcare-related non profit is the Milken Institute's Center for Accelerating Medical Solutions. FasterCures describes itself as an \"action tank\" that works on many diverse projects in collaboration with industry, academia, non profits, government agencies and philanthropic foundations. FasterCures' mission is to save lives by saving time in the discovery, development and deployment of new therapies for deadly and debilitating diseases. The executive director of FasterCures is Tanisha Carino.\n\nBackground \nIn 2003, The Milken Institute founded FasterCures as its center for accelerating medical solutions. It is now one of five Milken Institute centers. Gregory Simon was the first president of FasterCures and remained there until moving on to be Senior Vice President, Patient Engagement at Pfizer, Inc.  After Simon's departure, Margaret Anderson became the Executive Director of FasterCures.  Melissa Stevens is currently the Deputy Executive Director. FasterCures is additionally funded by a $35 million grant given in 2007 from the Sumner M. Redstone Charitable Foundation.\n\nSince 2003, FasterCures has grown and evolved to be a leading authority in promoting innovation in medical research. It has partnered with numerous disease research organizations and associations, such as the Council for American Medical Innovation, to spread their message and accomplish common goals.\n\nMission \nFasterCures advocates for patient-centered and patient-driven advancements in the medical research community.  It works with patient advocates,  investors, policymakers, researchers, and any other leaders of medical development to advance four basic areas:\n• Stimulate innovation through collaborations among academia, industry, government, investors, and non-profits.\n• Optimize use of patient data and increase patient engagement in medical research and development.\n• Improve research process and policy to optimize development and approval of new therapies.\n• Facilitating more efficient access and allocation of capital to support  medical research\nFasterCures has a number of focused programs that execute these above goals with the purpose of saving lives by saving time.\n\nPrograms \nPartnering for Cures is FasterCures' annual meeting that brings together diverse participants to discuss and solve the crucial issues facing the medical research world today. Partnering for Cures is structured with thought-provoking panels that host well-known speakers from the different sectors of the medical world; presenters from organizations that are boasting innovative approaches to the issues facing health; pro-bono, personalized advice from experts across medical research fields; and a unique partnering systems that allows conference participants to schedule meetings throughout the weekend to collaborate and create new approaches to save and improve lives. The 2012 Partnering for Cures meeting will be the fourth annual conference and will take place on November 28–30, 2012 at the Grand Hyatt New York, New York.\n \nTRAIN Central Station is a portal that provides tools for venture philanthropists. It identifies and promotes innovative venture philanthropies and acts as a model and resource for other nonprofits, industry, academia, policy makers and the media. TRAIN also provides webinars on hot-button medical research issues in today's world. The most recent ones included an informational session on NCATS and a question and answer session with FDA Commissioner Margaret Hamburg. \n \nThe Philanthropy Advisory Service (PAS) seeks to improve access to medical solutions by easing the philanthropy process. PAS helps philanthropists makes informed decisions about where they should invest their money. PAS was designed to help philanthropists make more impactful donations to medical research by providing information about innovative and efficient disease foundations so that the philanthropists could match their interests to a quality organization and donate wisely.\n \nPatients Helping Doctors is a program that FasterCures offers to connect patients with resources that will facilitate medical breakthroughs. The different aspects of this program include improving electronic health records, facilitating patient enrollment in clinical trials through a partnership with Emerging Med, and engaging with community physicians to help them participate in clinical research. \n \nTime Equals Lives, a social media campaign that FasterCures launched in 2012, spotlights patient stories that are submitted through the www.timeequalslives.org portal. The campaign also provides infographics highlighting key facts and messages about medical research.\n\nFasterCures advocates for greater resources at the Food and Drug Administration. Additionally, FasterCures is invested in promoting translational research through the National Institutes of Health.\n\nPublications \nFasterCures has released publications to inform different sectors of the medical research industry. The topics surrounding their publications include bridging the “Valley of Death,” improving biobanking, advancing the use of electronic health records, maximizing the impact of patient advocates, how to optimize philanthropic decisions, and FasterCures annual progress reports.\n\nReferences\n\nLinks \nhttps://www.fastercures.org/\n\nBiotechnology\nLobbying in the United States",
      "source": "News Source",
      "date": "2025-10-10T13:28:10.529Z"
    }
  ],
  "timestamp": 1760102890531
}