{
  "newsItems": [
    {
      "title": "ScienceDaily: Your source for the latest research news",
      "url": "https://www.sciencedaily.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Top Science News\n\nOctober 9, 2025\n\nTiny Asteroid Flew Right over Antarctica, and No One Saw It Coming Oct. 9, 2025 — Asteroid 2025 TF zipped past Earth above Antarctica, coming within 428 km of the surface. Roughly the size of a small car, it was detected hours after the flyby and posed no danger. ESA astronomers later confirmed its trajectory with extraordinary ... Common Medications May Secretly Rewire Your Gut for Years Oct. 9, 2025 — Drugs taken years—even decades—ago can leave lasting imprints on the gut microbiome, reshaping the community of microbes long after treatment stops. Scientists analyzing over 2,500 Estonian Biobank samples discovered that antibiotics aren’t ... Glowing Shark and Hidden Crab Found Deep Off Australia Oct. 9, 2025 — In a stunning glimpse into the mysteries of the deep, scientists have uncovered two new marine species off Western Australia—a glowing lanternshark and a tiny porcelain crab. The discoveries, made from specimens collected during a 2022 CSIRO ... Scientists Shocked as Birds Soaked in “Forever Chemicals” Still Thrive Oct. 9, 2025 — Tree swallows in polluted U.S. regions are accumulating high levels of “forever chemicals.” These durable pollutants, used in firefighting foams and consumer products, are found everywhere from soil to human blood. Surprisingly, researchers ... Scientists Suggest the Brain May Work Best with 7 Senses, Not Just 5 Oct. 8, 2025 — Scientists at Skoltech developed a new mathematical model of memory that explores how information is encoded and stored. Their analysis suggests that memory works best in a seven-dimensional conceptual space — equivalent to having seven senses. ... Scientists Just Found a Molecule That Could Stop Parkinson’s in Its Tracks Oct. 8, 2025 — Researchers have designed a peptide that prevents the deadly misfolding of alpha-synuclein, the protein behind Parkinson’s and some dementias. In lab and animal tests, it stabilized the protein and ... New Pill Could Finally Control Stubborn High Blood Pressure Oct. 8, 2025 — A new pill called baxdrostat may offer hope for people whose blood pressure stays high even after taking standard medications. In a recent study, the drug lowered blood pressure and also seemed to protect the kidneys by reducing signs of damage. ... Scientists Reveal Green Tea’s Fat-burning Secret Oct. 8, 2025 — New research shows green tea may help the body burn fat and balance blood sugar. In a study with obese mice, it improved metabolism and muscle health without harming lean animals. Scientists say its powerful plant compounds work together to regulate ... Scientists Just Proved the Moai Could Walk, Solving a 500-year Mystery Oct. 8, 2025 — Researchers confirmed that Rapa Nui’s moai statues could “walk” upright using a rocking motion, aided by rope and just a few people. Experiments with replicas and 3D models revealed design features like a forward lean and curved bases that ... Scientists Discover Orchids Sprouting from Decaying Wood Oct. 8, 2025 — Kobe University researchers found that orchids rely on wood-decaying fungi to germinate, feeding on the carbon from rotting logs. Their seedlings only grow near deadwood, forming precise fungal partnerships that mirror those seen in adult orchids ... Record Amazon Fires Release More Carbon Than an Entire Country Oct. 8, 2025 — The Amazon has suffered its most destructive fire season in more than two decades, releasing a staggering 791 million tons of carbon dioxide—on par with Germany’s annual emissions. Scientists found that for the first time, fire-driven ... The Red Sea That Vanished and the Catastrophic Flood That Brought It Back Oct. 8, 2025 — Researchers at KAUST have confirmed that the Red Sea once vanished entirely, turning into a barren salt desert before being suddenly flooded by waters from the Indian Ocean. The flood carved deep channels and restored marine life in less than ...\n\n## Latest Top Headlines\n\nupdated 7:08am EDT\n\n[The Hidden Denisovan Gene That Helped Humans Conquer a New World](https://www.sciencedaily.com/releases/2025/08/250824031540.htm)\n\nOct. 7, 2025 — Ancient humans crossing the Bering Strait into the Americas carried more than tools and determination—they also carried a genetic legacy from Denisovans, an extinct human relative. A new study reveals that a mysterious gene called MUC19, inherited through interbreeding between Denisovans, Neanderthals, and humans, may have played a vital role in helping early Americans survive new diseases, ...\n\nRELATED TOPICS\n\n- [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Early Humans](https://www.sciencedaily.com/news/fossils_ruins/early_humans/) - [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/)\n\n[Bacteria Hidden Inside Tumors Could Help Beat Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm)\n\nOct. 7, 2025 — Scientists have discovered that bacteria living inside tumors can produce a molecule that fights cancer and enhances chemotherapy. The molecule, called 2-methylisocitrate (2-MiCit), was found to make colorectal cancer cells more vulnerable to chemotherapy by damaging their DNA and disrupting their metabolism. Experiments using worms, flies, and human cancer cells confirmed its potent anti-cancer ...\n\nRELATED TOPICS\n\n- [Personalized Medicine](https://www.sciencedaily.com/news/health_medicine/personalized_medicine/) - [Skin Care](https://www.sciencedaily.com/news/health_medicine/skin_care/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Scientists Finally Reveal What’s Behind Long COVID’s Mysterious Brain Fog](https://www.sciencedaily.com/releases/2025/10/251006051127.htm)\n\nOct. 7, 2025 — Researchers in Japan have pinpointed a biological cause of Long COVID brain fog using advanced PET brain imaging. They discovered widespread increases in AMPA receptor density linked to cognitive impairment and inflammation. The findings confirm brain fog as a measurable, biological condition and reveal new targets for treatment. This could open ...\n\nRELATED TOPICS\n\n- [Today's Healthcare](https://www.sciencedaily.com/news/health_medicine/today's_healthcare/) - [Mental Health](https://www.sciencedaily.com/news/mind_brain/mental_health/) - [Mental Health Research](https://www.sciencedaily.com/news/health_medicine/mental_health/)\n\n[Scientists Find Brain Circuit That Traps Alcohol Users in the Vicious Cycle of Addiction](https://www.sciencedaily.com/releases/2025/10/251006051124.htm)\n\nOct. 7, 2025 — Addiction often isn’t about chasing pleasure—it’s about escaping pain. Researchers at Scripps Research have discovered that a tiny brain region called the paraventricular nucleus of the thalamus (PVT) becomes hyperactive when animals learn that alcohol eases the agony of withdrawal. This circuit helps explain why people relapse: their brains ...\n\nRELATED TOPICS\n\n- [Nervous System](https://www.sciencedaily.com/news/health_medicine/nervous_system/) - [Neuroscience](https://www.sciencedaily.com/news/mind_brain/neuroscience/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/)\n\n[Physicists Just Built a Quantum Lie Detector. It Works](https://www.sciencedaily.com/releases/2025/10/251007081840.htm)\n\nOct. 7, 2025 — An international team has confirmed that large quantum systems really do obey quantum mechanics. Using Bell’s test across 73 qubits, they proved the presence of genuine quantum correlations that can’t be explained classically. Their results show quantum computers are not just bigger, but more authentically quantum. This opens the door to more secure communication and stronger quantum ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Computers and Internet](https://www.sciencedaily.com/news/computers_math/computers_and_internet/)\n\n[Scientists Finally Found the “dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm)\n\nOct. 4, 2025 — Scientists at OIST have, for the first time, directly tracked the elusive “dark excitons” inside atomically thin materials. These quantum particles could revolutionize information technology, as they are more stable and resistant to environmental interference than current ...\n\nRELATED TOPICS\n\n- [Physics](https://www.sciencedaily.com/news/matter_energy/physics/) - [Spintronics Research](https://www.sciencedaily.com/news/computers_math/spintronics/) - [Telecommunications](https://www.sciencedaily.com/news/matter_energy/telecommunications/)\n\n[A Tiny Detector Could Unveil Gravitational Waves We’ve Never Seen Before](https://www.sciencedaily.com/releases/2025/10/251003033920.htm)\n\nOct. 3, 2025 — Researchers have designed a new type of gravitational wave detector that operates in the milli-Hertz range, a region untouched by current observatories. Built with optical resonators and atomic clocks, the compact detectors can fit on a lab table yet probe signals from exotic binaries and ancient cosmic events. Unlike LIGO, they’re relatively immune to seismic noise and could start working long ...\n\nRELATED TOPICS\n\n- [Black Holes](https://www.sciencedaily.com/news/space_time/black_holes/) - [Detectors](https://www.sciencedaily.com/news/matter_energy/detectors/) - [Physics](https://www.sciencedaily.com/news/matter_energy/physics/)\n\n[This Ultra-Thin Solar Tech Could Power Everything from Phones to Skyscrapers](https://www.sciencedaily.com/releases/2025/10/251001092218.htm)\n\nOct. 2, 2025 — A team in Sweden has unraveled the hidden structure of a promising solar material using machine learning and advanced simulations. Their findings could unlock durable, ultra-efficient solar cells for a rapidly electrifying ...\n\nRELATED TOPICS\n\n- [Chemistry](https://www.sciencedaily.com/news/matter_energy/chemistry/) - [Nanotechnology](https://www.sciencedaily.com/news/matter_energy/nanotechnology/) - [Energy and Resources](https://www.sciencedaily.com/news/matter_energy/energy_and_resources/)\n\n[From Gentle Giants to Ghostly Hunters, Sharks Face an Unseen Peril](https://www.sciencedaily.com/releases/2025/10/251004092909.htm)\n\nOct. 5, 2025 — New research reveals that deep-sea mining could dramatically threaten 30 species of sharks, rays, and ghost sharks whose habitats overlap with proposed mining zones. Many of these species, already at risk of extinction, could face increased dangers from seafloor disruptions and sediment plumes caused by mining ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/)\n\n[Japan’s Hot Springs Hold Clues to the Origins of Life on Earth](https://www.sciencedaily.com/releases/2025/10/251002074009.htm)\n\nOct. 3, 2025 — Billions of years ago, Earth’s atmosphere was hostile, with barely any oxygen and toxic conditions for life. Researchers from the Earth-Life Science Institute studied Japan’s iron-rich hot springs, which mimic the ancient oceans, to uncover how early microbes survived. They discovered communities of bacteria that thrived on iron and tiny amounts of oxygen, forming ecosystems that recycled ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Environmental Science](https://www.sciencedaily.com/news/earth_climate/environmental_science/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/)\n\n[Scientists Just Recreated a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm)\n\nOct. 2, 2025 — In 2020, California’s Creek Fire became so intense that it generated its own thunderstorm, a phenomenon called a pyrocumulonimbus cloud. For years, scientists struggled to replicate these explosive fire-born storms in climate models, leaving major gaps in understanding their global effects. Now, a new study has finally simulated them successfully, reproducing the Creek Fire’s storm and others ...\n\nRELATED TOPICS\n\n- [Severe Weather](https://www.sciencedaily.com/news/earth_climate/severe_weather/) - [Air Quality](https://www.sciencedaily.com/news/earth_climate/air_quality/) - [Natural Disasters](https://www.sciencedaily.com/news/earth_climate/natural_disasters/)\n\n[The Billion-Year Reign of Fungi That Predated Plants and Made Earth Livable](https://www.sciencedaily.com/releases/2025/10/251001092208.htm)\n\nOct. 1, 2025 — Fungi may have shaped Earth’s landscapes long before plants appeared. By combining rare gene transfers with fossil evidence, researchers have traced fungal origins back nearly a billion years earlier than expected. These ancient fungi may have partnered with algae, recycling nutrients, breaking down rock, and creating primitive soils. Far from being silent background players, fungi were ...\n\nRELATED TOPICS\n\n- [Ecology](https://www.sciencedaily.com/news/earth_climate/ecology/) - [Ecology Research](https://www.sciencedaily.com/news/plants_animals/ecology/) - [Ecosystems](https://www.sciencedaily.com/news/earth_climate/ecosystems/)\n\n- Top Health - [Ancient DNA Secret That Shaped Human Survival](https://www.sciencedaily.com/releases/2025/08/250824031540.htm) - [Bacteria Hidden in Tumors Help Kill Cancer](https://www.sciencedaily.com/releases/2025/10/251007081835.htm) - [Long COVID Brain Fog May Finally Be Explained](https://www.sciencedaily.com/releases/2025/10/251006051127.htm) - [Brain Circuit Fuels Vicious Cycle of Addiction](https://www.sciencedaily.com/releases/2025/10/251006051124.htm) - Top Physical/Tech - [Physicists Built a Quantum Lie Detector](https://www.sciencedaily.com/releases/2025/10/251007081840.htm) - [The “Dark Matter” of Electronics](https://www.sciencedaily.com/releases/2025/10/251003033928.htm) - [Tiny Detector Unlocks Hidden Gravitational Waves](https://www.sciencedaily.com/releases/2025/10/251003033920.htm) - [Ultra-Thin Solar Tech Could Power Everything](https://www.sciencedaily.com/releases/2025/10/251001092218.htm) - Top Environment - [Ghost Sharks Face a Hidden Deep-Sea Threat](https://www.sciencedaily.com/releases/2025/10/251004092909.htm) - [Hot Springs Hold Clues to the Origins of Life](https://www.sciencedaily.com/releases/2025/10/251002074009.htm) - [Recreating a Wildfire That Made Its Own Weather](https://www.sciencedaily.com/releases/2025/10/251002074001.htm) - [The Billion-Year Reign of Fungi](https://www.sciencedaily.com/releases/2025/10/251001092208.htm)\n\nmore top science stories\n\n/Top Science News\n\nHealth News\n\n## Health News\n\nOctober 9, 2025\n\nNew Research Reveals What’s Really Hiding in Bottled Water Oct. 6, 2025 — A chance encounter with plastic waste on a tropical beach sparked a deep investigation into what those fragments mean for human health. The research reveals that bottled water isn’t as pure as it seems—each sip may contain invisible ... It’s Not Just Genes — Parents Can Pass Down Longevity Another Way Oct. 6, 2025 — Scientists studying tiny roundworms have uncovered how the secrets of a long life can be passed from parents to their offspring — without changing DNA. The discovery shows that when certain cellular structures called lysosomes change in ways that ... Nearly Half of Drivers Killed in Crashes Had THC in Their Blood Oct. 5, 2025 — Over 40% of fatal crash victims had THC levels far above legal limits, showing cannabis use before driving remains widespread. The rate didn’t drop after legalization, suggesting policy changes haven’t altered risky habits. Experts warn that the ... Why the Brain’s GPS Fails with Age, and How Some Minds Defy It Oct. 5, 2025 — Stanford scientists found that aging disrupts the brain’s internal navigation system in mice, mirroring spatial memory decline in humans. Older mice struggled to recall familiar locations, while a few “super-agers” retained youthful brain ... Why Ultra-processed Foods Aren’t the Real Villain Behind Overeating Oct. 5, 2025 — Researchers from Leeds found that overeating is driven more by what people believe about food than by its actual ingredients or level of processing. Foods perceived as fatty, sweet, or highly processed were more likely to trigger indulgence. ... Scientists Discover Hidden Protein That Switches Off Hunger Oct. 5, 2025 — Researchers have uncovered how a protein called MRAP2 acts as a key regulator of hunger. It helps move the appetite receptor MC4R to the cell’s surface, allowing it to send stronger “stop eating” signals. The discovery offers new hope for ... Think Light Drinking Protects Your Brain? Think Again Oct. 4, 2025 — A massive new study combining observational and genetic data overturns the long-held belief that light drinking protects the brain. Researchers found that dementia risk rises in direct proportion to alcohol consumption, with no safe level ... This New Semaglutide Dose Helped Nearly Half of Patients Lose 20% Body Weight Oct. 4, 2025 — The STEP UP trials revealed that a 7.2 mg dose of semaglutide led to greater weight loss than the currently approved 2.4 mg dose. Nearly half of participants lost 20% or more of their body weight, ... Hidden Cellular “Power Switch” Could Transform Parkinson’s Treatment Oct. 4, 2025 — Researchers uncovered a key cellular regulator, PP2A-B55alpha, that controls both the cleanup of damaged mitochondria and the creation of new ones. In Parkinson’s disease models, reducing this regulator improved symptoms and mitochondrial health. ... Doctors Stunned by a Cheap Drug’s Power Against Colon Cancer Oct. 4, 2025 — A Scandinavian clinical trial has revealed that low-dose aspirin can halve the risk of colon and rectal cancer recurrence in patients with specific genetic mutations. The research, involving over 3,500 patients, is the first randomized study to ... Fat May Secretly Fuel Alzheimer’s, New Research Finds Oct. 3, 2025 — New research from Houston Methodist reveals how obesity may directly drive Alzheimer’s disease. Scientists discovered that tiny messengers released by fat tissue, called extracellular vesicles, can carry harmful signals that accelerate the buildup ... Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails Oct. 3, 2025 — Ohio State researchers have discovered that exhausted T cells collapse under the weight of misfolded proteins, activating a destructive stress response called TexPSR. Unlike normal stress systems, TexPSR accelerates protein production, flooding the ...\n\n## Latest Health Headlines\n\nupdated 7:08am EDT\n\n[A Psychedelic Surprise: DMT Helps the Brain Heal After Stroke](https://www.sciencedaily.com/releases/2025/10/251006051129.htm)\n\nOct. 7, 2025 — Scientists have discovered that DMT, a natural compound found in plants and even the human brain, can dramatically reduce brain damage caused by stroke. The psychoactive molecule, long known for its hallucinogenic effects, restored the blood-brain barrier and reduced inflammation in animal and cell studies. These findings suggest that DMT could complement existing stroke treatments, potentially ...\n\nRELATED TOPICS\n\n- [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/) - [Immune System](https://www.sciencedaily.com/news/health_medicine/immune_system/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/)\n\n[Nanotech Transforms Vinegar Into a Lifesaving Superbug Killer](https://www.sciencedaily.com/releases/2025/10/251006051122.htm)\n\nOct. 6, 2025 — Researchers have enhanced vinegar’s antibacterial properties by infusing it with cobalt-based carbon nanoparticles. This nano-boosted solution kills harmful bacteria from both inside and outside their cells while remaining safe for humans. Tests on mice showed it healed infected wounds effectively. The discovery could be a breakthrough against antibiotic-resistant infections ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Pharmacology](https://www.sciencedaily.com/news/health_medicine/pharmacology/) - [Pharmaceuticals](https://www.sciencedaily.com/news/health_medicine/pharmaceuticals/)\n\n[You Don’t Have to Lose Weight to Lower Your Diabetes Risk, Scientists Say](https://www.sciencedaily.com/releases/2025/10/251006051117.htm)\n\nOct. 6, 2025 — A major study from Tübingen found that prediabetic individuals who normalized their blood sugar through healthy habits — even without shedding pounds — cut their risk of type 2 diabetes by 71%. Researchers discovered that improved fat distribution, particularly less abdominal fat, was key. The findings suggest that focusing solely on weight loss may overlook the true drivers of diabetes ...\n\nRELATED TOPICS\n\n- [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Skin Care](https://www.sciencedaily.com/news/health_medicine/skin_care/)\n\n[Scientists Find Hidden Brain Damage Behind Dementia](https://www.sciencedaily.com/releases/2025/10/251005085637.htm)\n\nOct. 6, 2025 — A University of New Mexico scientist is revealing what might be one of the most overlooked causes of dementia — damage in the brain’s tiny blood vessels. Dr. Elaine Bearer has created a new way to classify these changes, showing that many people diagnosed with Alzheimer’s also suffer from vascular damage that quietly destroys brain tissue. Even more surprising, she’s finding microplastics ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Hypertension](https://www.sciencedaily.com/news/health_medicine/hypertension/) - [Dementia](https://www.sciencedaily.com/news/mind_brain/dementia/)\n\n[Brain Cancer That Eats the Skull Stuns Scientists](https://www.sciencedaily.com/releases/2025/10/251005085618.htm)\n\nOct. 5, 2025 — A new study shows glioblastoma isn’t confined to the brain—it erodes the skull and hijacks the immune system within skull marrow. The cancer opens channels that let inflammatory cells enter the brain, fueling its deadly progression. Even drugs meant to protect bones can make things worse, highlighting the need for therapies that target both brain and bone. The discovery reframes glioblastoma ...\n\nRELATED TOPICS\n\n- [Medical Imaging](https://www.sciencedaily.com/news/health_medicine/medical_imaging/) - [Today's Healthcare](https://www.sciencedaily.com/news/health_medicine/today's_healthcare/) - [Medical Devices](https://www.sciencedaily.com/news/health_medicine/medical_devices/)\n\n[Strong Friendships May Literally Slow Aging at the Cellular Level](https://www.sciencedaily.com/releases/2025/10/251004092917.htm)\n\nOct. 5, 2025 — Scientists discovered that lifelong social support can slow biological aging. Using DNA-based “epigenetic clocks,” they found that people with richer, more sustained relationships showed younger biological profiles and lower inflammation. The effect wasn’t about single friendships but about consistent connections across ...\n\nRELATED TOPICS\n\n- [Diabetes](https://www.sciencedaily.com/news/health_medicine/diabetes/) - [Diet and Weight Loss](https://www.sciencedaily.com/news/health_medicine/diet_and_weight_loss/) - [Heart Disease](https://www.sciencedaily.com/news/health_medicine/heart_disease/)\n\n[The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk](https://www.sciencedaily.com/releases/2025/10/251003033913.htm)\n\nOct. 3, 2025 — A massive nationwide study has linked long-term exposure to the industrial chemical trichloroethylene (TCE) with a higher risk of Parkinson’s disease in older adults. Researchers examined over 1.1 million people, finding that those living in areas with the highest outdoor TCE levels faced a 10% greater risk of developing ...\n\nRELATED TOPICS\n\n- [Health Policy](https://www.sciencedaily.com/news/health_medicine/health_policy/) - [Diseases and Conditions](https://www.sciencedaily.com/news/health_medicine/diseases_and_conditions/) - [Healthy Aging](https://www.sciencedaily.com/news/health_medicine/healthy_aging/)\n\n[Poor Sleep Speeds Brain Aging and May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251002074014.htm)\n\nOct. 2, 2025 — New research shows that poor sleep could make the brain appear years older than it really is. Using MRI scans and machine learning, scientists found a clear link between unhealthy sleep patterns and accelerated brain ...\n\nRELATED TOPICS\n\n- [Sleep Disorder Research](https://www.sciencedaily.com/news/health_medicine/sleep_disorders/) - [Alzheimer's](https://www.sciencedaily.com/news/mind_brain/alzheimer's/) - [Alzheimer's Research](https://www.sciencedaily.com/news/health_medicine/alzheimer's/)\n\n[The Vitamin D Mistake Weakening Your Immunity](https://www.sciencedaily.com/releases/2025/10/251004092911.htm)\n\nOct.",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Health & Medicine News -- ScienceDaily",
      "url": "https://www.sciencedaily.com/news/health_medicine/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.sciencedaily.com/images/scidaily-icon.png"
      },
      "content": "Top Science News\n\n# Health & Medicine News\n\nOctober 8, 2025\n\n## Top Headlines\n\nThe Hidden Denisovan Gene That Helped Humans Conquer a New World Oct. 7, 2025 — Ancient humans crossing the Bering Strait into the Americas carried more than tools and determination—they also carried a genetic legacy from Denisovans, an extinct human relative. A new study reveals that a mysterious gene called MUC19, inherited ... Bacteria Hidden Inside Tumors Could Help Beat Cancer Oct. 7, 2025 — Scientists have discovered that bacteria living inside tumors can produce a molecule that fights cancer and enhances chemotherapy. The molecule, called 2-methylisocitrate (2-MiCit), was found to make colorectal cancer cells more vulnerable to ... A Psychedelic Surprise: DMT Helps the Brain Heal After Stroke Oct. 7, 2025 — Scientists have discovered that DMT, a natural compound found in plants and even the human brain, can dramatically reduce brain damage caused by stroke. The psychoactive molecule, long known for its hallucinogenic effects, restored the blood-brain ... Scientists Finally Reveal What’s Behind Long COVID’s Mysterious Brain Fog Oct. 7, 2025 — Researchers in Japan have pinpointed a biological cause of Long COVID brain fog using advanced PET brain imaging. They discovered widespread increases in AMPA receptor density linked to cognitive ... Scientists Find Brain Circuit That Traps Alcohol Users in the Vicious Cycle of Addiction Oct. 7, 2025 — Addiction often isn’t about chasing pleasure—it’s about escaping pain. Researchers at Scripps Research have discovered that a tiny brain region called the paraventricular nucleus of the ... Nanotech Transforms Vinegar Into a Lifesaving Superbug Killer Oct. 6, 2025 — Researchers have enhanced vinegar’s antibacterial properties by infusing it with cobalt-based carbon nanoparticles. This nano-boosted solution kills harmful bacteria from both inside and outside their cells while remaining safe for humans. Tests ... You Don’t Have to Lose Weight to Lower Your Diabetes Risk, Scientists Say Oct. 6, 2025 — A major study from Tübingen found that prediabetic individuals who normalized their blood sugar through healthy habits — even without shedding pounds — cut their risk of type 2 diabetes by 71%. Researchers discovered that improved fat ... New Research Reveals What’s Really Hiding in Bottled Water Oct. 6, 2025 — A chance encounter with plastic waste on a tropical beach sparked a deep investigation into what those fragments mean for human health. The research reveals that bottled water isn’t as pure as it seems—each sip may contain invisible ... Scientists Find Hidden Brain Damage Behind Dementia Oct. 6, 2025 — A University of New Mexico scientist is revealing what might be one of the most overlooked causes of dementia — damage in the brain’s tiny blood vessels. Dr. Elaine Bearer has created a new way to classify these changes, showing that many people ... It’s Not Just Genes — Parents Can Pass Down Longevity Another Way Oct. 6, 2025 — Scientists studying tiny roundworms have uncovered how the secrets of a long life can be passed from parents to their offspring — without changing DNA. The discovery shows that when certain cellular structures called lysosomes change in ways that ... Nearly Half of Drivers Killed in Crashes Had THC in Their Blood Oct. 5, 2025 — Over 40% of fatal crash victims had THC levels far above legal limits, showing cannabis use before driving remains widespread. The rate didn’t drop after legalization, suggesting policy changes haven’t altered risky habits. Experts warn that the ... Brain Cancer That Eats the Skull Stuns Scientists Oct. 5, 2025 — A new study shows glioblastoma isn’t confined to the brain—it erodes the skull and hijacks the immune system within skull marrow. The cancer opens channels that let inflammatory cells enter the brain, fueling its deadly progression. Even drugs ...\n\n## Latest Headlines\n\nupdated 9:46am EDT\n\nWould You Eat Yogurt Made With Ants? Scientists Did Oct. 6, 2025 — In a remarkable blend of science and tradition, researchers have revived an old Balkan and Turkish yogurt-making technique that uses ants as natural fermenters. The ants’ bacteria, acids, and ... Why the Brain’s GPS Fails With Age, and How Some Minds Defy It Oct. 5, 2025 — Stanford scientists found that aging disrupts the brain’s internal navigation system in mice, mirroring spatial memory decline in humans. Older mice struggled to recall familiar locations, while a ... Why Ultra-Processed Foods Aren’t the Real Villain Behind Overeating Oct. 5, 2025 — Researchers from Leeds found that overeating is driven more by what people believe about food than by its actual ingredients or level of processing. Foods perceived as fatty, sweet, or highly ... Strong Friendships May Literally Slow Aging at the Cellular Level Oct. 5, 2025 — Scientists discovered that lifelong social support can slow biological aging. Using DNA-based “epigenetic clocks,” they found that people with richer, more sustained relationships showed younger ... Scientists Just Found Cancer Cells’ Hidden Power Source Oct. 5, 2025 — When cancer cells are physically squeezed, they mount an instant, high-energy defense by rushing mitochondria to the cell nucleus, unleashing a surge of ATP that fuels DNA repair and survival. This ... Scientists Discover Hidden Protein That Switches Off Hunger Oct. 5, 2025 — Researchers have uncovered how a protein called MRAP2 acts as a key regulator of hunger. It helps move the appetite receptor MC4R to the cell’s surface, allowing it to send stronger “stop ... Think Light Drinking Protects Your Brain? Think Again Oct. 4, 2025 — A massive new study combining observational and genetic data overturns the long-held belief that light drinking protects the brain. Researchers found that dementia risk rises in direct proportion to ... This New Semaglutide Dose Helped Nearly Half of Patients Lose 20% Body Weight Oct. 4, 2025 — The STEP UP trials revealed that a 7.2 mg dose of semaglutide led to greater weight loss than the currently approved 2.4 mg dose. Nearly half of ... Hidden Cellular “power Switch” Could Transform Parkinson’s Treatment Oct. 4, 2025 — Researchers uncovered a key cellular regulator, PP2A-B55alpha, that controls both the cleanup of damaged mitochondria and the creation of new ones. In Parkinson’s disease models, reducing this ... The Vitamin D Mistake Weakening Your Immunity Oct. 4, 2025 — Scientists discovered that vitamin D2 supplements can lower levels of vitamin D3, the form the body uses most effectively. Unlike D2, vitamin D3 enhances the immune system’s first line of defense ...\n\n- [Making Yogurt With Ants](https://www.sciencedaily.com/releases/2025/10/251005085623.htm) - [Why the Brain’s GPS Fails With Age](https://www.sciencedaily.com/releases/2025/10/251005085616.htm) - [The Real Reason You Can’t Stop Eating](https://www.sciencedaily.com/releases/2025/10/251005085625.htm) - [Stronger Friendships, Slower Aging](https://www.sciencedaily.com/releases/2025/10/251004092917.htm) - [Cancer Cells Spark to Life Under Pressure](https://www.sciencedaily.com/releases/2025/10/251004092915.htm) - [Hidden Protein That Switches Off Hunger](https://www.sciencedaily.com/releases/2025/10/251004092905.htm) - [Even a Little Alcohol May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251004092919.htm) - [High-Dose Semaglutide Redefines Weight Loss](https://www.sciencedaily.com/releases/2025/10/251004092913.htm) - [Cellular Switch Found That May Halt ...](https://www.sciencedaily.com/releases/2025/10/251004092903.htm) - [The Vitamin D Mistake Weakening Your Immunity](https://www.sciencedaily.com/releases/2025/10/251004092911.htm)\n\n/Top Science News\n\n## Earlier Headlines\n\n- [Summaries](#summaries) - [Headlines](#headlines)\n\nThis “chaos Enzyme” May Hold the Key to Stopping Cancer Spread Oct. 4, 2025 — A Weill Cornell Medicine team has found that triple-negative breast cancer depends on the enzyme EZH2 to spread. By silencing key genes, EZH2 drives chaotic cell divisions and fuels metastasis. ... Fat May Secretly Fuel Alzheimer’s, New Research Finds Oct. 3, 2025 — New research from Houston Methodist reveals how obesity may directly drive Alzheimer’s disease. Scientists discovered that tiny messengers released by fat tissue, called extracellular vesicles, can ... A Single Dose of Psilocybin May Rewire the Brain for Lasting Relief Oct. 2, 2025 — Penn researchers found that psilocybin can calm brain circuits tied to pain and mood, easing both physical suffering and emotional distress in animal studies. The compound works in the anterior ... The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk Oct. 3, 2025 — A massive nationwide study has linked long-term exposure to the industrial chemical trichloroethylene (TCE) with a higher risk of Parkinson’s disease in older adults. Researchers examined over 1.1 ... Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails Oct. 3, 2025 — Ohio State researchers have discovered that exhausted T cells collapse under the weight of misfolded proteins, activating a destructive stress response called TexPSR. Unlike normal stress systems, ... A Flu Test You Can Chew Oct. 3, 2025 — Flu detection could soon be as simple as chewing gum. Scientists have created a molecular sensor that releases a thyme-like flavor when it encounters influenza, offering a low-tech, taste-based ... DOLPHIN AI Uncovers Hundreds of Invisible Cancer Markers Oct. 1, 2025 — A new AI tool called DOLPHIN exposes hidden genetic markers inside single cells, enabling earlier detection and more precise treatment choices. It also sets the stage for building virtual models of ... Poor Sleep Speeds Brain Aging and May Raise Dementia Risk Oct. 2, 2025 — New research shows that poor sleep could make the brain appear years older than it really is. Using MRI scans and machine learning, scientists found a clear link between unhealthy sleep patterns and ... Black Mamba Venom Has a Deadly Hidden Second Strike Sep. 30, 2025 — Scientists have uncovered a dangerous hidden feature in Black Mamba venom that explains why antivenoms sometimes fail. The study revealed that several mamba species launch a dual neurological attack, ... Long Commutes and Small Homes Are Wrecking Sleep Sep. 30, 2025 — Tokyo residents face a trade-off between home size and commute time when it comes to sleep health. A new study shows longer commutes increase both insomnia and daytime sleepiness, while smaller ... Why Gen X Women Can’t Stop Eating Ultra-Processed Foods Sep. 29, 2025 — Researchers found that middle-aged adults, especially women, are far more likely to be addicted to ultra-processed foods than older generations. Marketing of diet-focused processed foods in the 1980s ... Simple Blood Test Predicts Liver Disease Years Before Symptoms Sep. 29, 2025 — Researchers in Sweden and Finland have created the CORE model, a simple blood test that predicts liver disease risk with striking accuracy. Unlike current methods, it works for the general population ... Stunning Images Reveal How Antibiotics Shatter Bacterial Defenses Sep. 29, 2025 — Researchers have revealed how polymyxins, crucial last-resort antibiotics, break down bacterial armor by forcing cells to overproduce and shed it. Astonishingly, the drugs only kill bacteria when ... New Inhaler Halves Childhood Asthma Attacks Sep. 28, 2025 — A groundbreaking international study has shown that a 2-in-1 budesonide-formoterol inhaler is far more effective than the standard salbutamol inhaler in children with mild asthma, cutting attacks by ... Fruit Might Be the Surprising Key to Healthier Lungs Sep. 28, 2025 — Eating more fruit could help protect lungs from air pollution damage, particularly in women. Researchers point to antioxidants and anti-inflammatory compounds in fruit as possible defenses against ... Doctors Tested a Common Drug on COVID. The Results Are Stunning Sep. 28, 2025 — Inhaled heparin significantly lowers the risk of death and ventilation in COVID-19 patients while also showing potential against other respiratory infections. With its unique triple-action benefits, ... Millions Could Be Living With Hidden Smell Loss After COVID Without Knowing Oct. 3, 2025 — A massive NIH-backed study reveals that COVID-19’s toll on smell may be more widespread and lasting than most realize. Even patients without noticeable symptoms often performed poorly on scent ... Scientists Uncover How to Block Pain Without Side Effects Sep. 26, 2025 — Scientists have discovered a way to block pain while still allowing the body’s natural healing to take place. Current painkillers like ibuprofen and aspirin often come with harmful side effects ... Scientists Finally Explain the Real Reason Pregnant Women Get Morning Sickness Sep. 29, 2025 — Morning sickness isn’t just random misery—it’s a biological defense system shaped by evolution to protect the fetus. By linking immune responses to nausea and food aversions, UCLA researchers ... The Hidden Iron Switch That Makes Cancer Cells Self-Destruct Sep. 29, 2025 — Scientists discovered that inhibiting the enzyme STK17B forces multiple myeloma cells into iron-driven death and makes therapies more effective. Early mouse studies show strong potential for a new ...\n\nend summaries tab\n\n### Saturday, October 4, 2025\n\n- [This “chaos Enzyme” May Hold the Key to Stopping Cancer Spread](https://www.sciencedaily.com/releases/2025/10/251004092858.htm)\n\n### Friday, October 3, 2025\n\n- [Fat May Secretly Fuel Alzheimer’s, New Research Finds](https://www.sciencedaily.com/releases/2025/10/251003033915.htm)\n\n### Thursday, October 2, 2025\n\n- [A Single Dose of Psilocybin May Rewire the Brain for Lasting Relief](https://www.sciencedaily.com/releases/2025/10/251002073959.htm)\n\n### Friday, October 3, 2025\n\n- [The Invisible Chemical in the Air That Could Be Raising Parkinson’s Risk](https://www.sciencedaily.com/releases/2025/10/251003033913.htm) - [Scientists Just Cracked the Mystery of Why Cancer Immunotherapy Fails](https://www.sciencedaily.com/releases/2025/10/251003033909.htm) - [A Flu Test You Can Chew](https://www.sciencedaily.com/releases/2025/10/251002074011.htm)\n\n### Wednesday, October 1, 2025\n\n- [DOLPHIN AI Uncovers Hundreds of Invisible Cancer Markers](https://www.sciencedaily.com/releases/2025/10/251001092206.htm)\n\n### Thursday, October 2, 2025\n\n- [Poor Sleep Speeds Brain Aging and May Raise Dementia Risk](https://www.sciencedaily.com/releases/2025/10/251002074014.htm)\n\n### Tuesday, September 30, 2025\n\n- [Black Mamba Venom Has a Deadly Hidden Second Strike](https://www.sciencedaily.com/releases/2025/09/250930034202.htm) - [Long Commutes and Small Homes Are Wrecking Sleep](https://www.sciencedaily.com/releases/2025/09/250930034158.htm)\n\n### Monday, September 29, 2025\n\n- [Why Gen X Women Can’t Stop Eating Ultra-Processed Foods](https://www.sciencedaily.com/releases/2025/09/250929054915.htm) - [Simple Blood Test Predicts Liver Disease Years Before Symptoms](https://www.sciencedaily.com/releases/2025/09/250929054911.htm) - [Stunning Images Reveal How Antibiotics Shatter Bacterial Defenses](https://www.sciencedaily.com/releases/2025/09/250929054907.htm)\n\n### Sunday, September 28, 2025\n\n- [New Inhaler Halves Childhood Asthma Attacks](https://www.sciencedaily.com/releases/2025/09/250928095611.htm) - [Fruit Might Be the Surprising Key to Healthier Lungs](https://www.sciencedaily.com/releases/2025/09/250928095620.htm) - [Doctors Tested a Common Drug on COVID. The Results Are Stunning](https://www.sciencedaily.com/releases/2025/09/250928095616.htm)\n\n### Friday, October 3, 2025\n\n- [Millions Could Be Living With Hidden Smell Loss After COVID Without Knowing](https://www.sciencedaily.com/releases/2025/10/251002074007.htm)\n\n### Friday, September 26, 2025\n\n- [Scientists Uncover How to Block Pain Without Side Effects](https://www.sciencedaily.com/releases/2025/09/250926035030.htm)\n\n### Monday, September 29, 2025\n\n- [Scientists Finally Explain the Real Reason Pregnant Women Get Morning Sickness](https://www.sciencedaily.com/releases/2025/09/250929054923.htm) - [The Hidden Iron Switch That Makes Cancer Cells Self-Destruct](https://www.sciencedaily.com/releases/2025/09/250929054920.htm)\n\n### Sunday, September 28, 2025\n\n- [Miscarriages, Down Syndrome, and Infertility All Linked to This Hidden DNA Process](https://www.sciencedaily.com/releases/2025/09/250928095627.htm)\n\n### Thursday, September 25, 2025\n\n- [This High-Sugar Fruit May Actually Lower Diabetes Risk](https://www.sciencedaily.com/releases/2025/09/250925025359.htm) - [Hidden Bacterial Molecules in the Brain Reveal New Secrets of Sleep](https://www.sciencedaily.com/releases/2025/09/250925025336.htm)\n\n### Wednesday, September 24, 2025\n\n- [Mushrooms Evolved Psychedelics Twice, Baffling Scientists](https://www.sciencedaily.com/releases/2025/09/250924012226.htm)\n\n### Wednesday, October 1, 2025\n\n- [Viral Apple Cider Vinegar Weight Loss Study Retracted for Flawed Science](https://www.sciencedaily.com/releases/2025/10/251001092216.htm)\n\n### Wednesday, September 24, 2025\n\n- [AI-Powered Smart Bandage Heals Wounds 25% Faster](https://www.sciencedaily.com/releases/2025/09/250924012232.htm) - [A Tiny Mineral May Hold the Secret to Feeding Billions Sustainably](https://www.sciencedaily.com/releases/2025/09/250924012230.htm)\n\n### Tuesday, September 23, 2025\n\n- [AI Breakthrough Finds Life-Saving Insights in Everyday Bloodwork](https://www.sciencedaily.com/releases/2025/09/250923021156.htm)\n\n### Monday, September 22, 2025\n\n- [Sneezing from Cats or Dust? Safe UV Light May Neutralize Allergens in Minutes](https://www.sciencedaily.com/releases/2025/09/250922074945.htm) - [Childhood Plastic Exposure Could Be Fueling Obesity, Infertility, and Asthma](https://www.sciencedaily.com/releases/2025/09/250922074947.htm)\n\n### Sunday, September 21, 2025\n\n- [Your Pancreas May Be Making Its Own Version of Ozempic](https://www.sciencedaily.com/releases/2025/09/250920214455.htm)\n\n### Saturday, September 20, 2025\n\n- [This Stunning X-Ray Advance Could Help Detect Cancer Earlier](https://www.sciencedaily.com/releases/2025/09/250920214314.htm)\n\n### Saturday, October 4, 2025\n\n- [Surprising Study Reveals What Really Kills Fatty Liver Disease Patients](https://www.sciencedaily.com/releases/2025/10/251003033924.htm)\n\n### Sunday, September 28, 2025\n\n- [Four Strange Secrets Scientists Just Found in Beer and Wine](https://www.sciencedaily.com/releases/2025/09/250927031219.htm)\n\n### Friday, September 19, 2025\n\n- [Wildfire Smoke Could Kill 70,000 Americans a Year by 2050](https://www.sciencedaily.com/releases/2025/09/250918225016.htm) - [Scientists Discover Microplastics Deep Inside Human Bones](https://www.sciencedaily.com/releases/2025/09/250918225014.htm)\n\n### Thursday, September 18, 2025\n\n- [Scientists Build Micromotors Smaller Than a Human Hair](https://www.sciencedaily.com/releases/2025/09/250918025025.htm)\n\n### Saturday, October 4, 2025\n\n- [Doctors Stunned by a Cheap Drug’s Power Against Colon Cancer](https://www.sciencedaily.com/releases/2025/10/251003033921.htm)\n\n### Tuesday, September 30, 2025\n\n- [A Plant Compound Might Be the Secret Weapon Against Gum Disease](https://www.sciencedaily.com/releases/2025/09/250930034211.htm)\n\n### Saturday, September 27, 2025\n\n- [Cocoa Supplements Show Surprising Anti-Aging Potential](https://www.sciencedaily.com/releases/2025/09/250927031221.htm)\n\n### Thursday, September 18, 2025\n\n- [The Hidden Group That Loses COVID Protection Fast](https://www.sciencedaily.com/releases/2025/09/250917221001.htm)\n\n### Sunday, September 28, 2025\n\n- [Hidden Alzheimer’s Warning Signs Found in Parkinson’s Patients Without Dementia](https://www.sciencedaily.com/releases/2025/09/250927031217.htm)\n\n### Wednesday, September 24, 2025\n\n- [Brain Fat, Not Just Plaques, May Be the Hidden Driver of Alzheimer’s](https://www.sciencedaily.com/releases/2025/09/250924012257.htm) - [Scientists Reveal Pill That Helps Shed 20% of Body Weight](https://www.sciencedaily.com/releases/2025/09/250924012248.htm)\n\n### Sunday, September 21, 2025\n\n- [Breakthrough Method Could Dramatically Cut Prescription Drug Prices](https://www.sciencedaily.com/releases/2025/09/250921090838.htm) - [Scientists Reveal the Everyday Habits That May Shield You from Dementia](https://www.sciencedaily.com/releases/2025/09/250920214459.htm)\n\n### Saturday, September 20, 2025\n\n- [Scientists Uncover Exercise’s Secret Hunger-Busting Molecule](https://www.sciencedaily.com/releases/2025/09/250919085244.htm)\n\n### Thursday, September 18, 2025\n\n- [Doctors Warn of a Stealth Opioid 20x More Potent Than Fentanyl](https://www.sciencedaily.com/releases/2025/09/250917221004.htm)\n\n### Tuesday, September 16, 2025\n\n- [Scientists Reverse Stroke Damage With Stem Cells](https://www.sciencedaily.com/releases/2025/09/250916221821.htm) - [Stanford Scientists Reveal Simple Shift That Could Prevent Strokes and Obesity Nationwide](https://www.sciencedaily.com/releases/2025/09/250915202850.htm) - [Ozempic, Wegovy and Mounjaro Makes Food Taste Sweeter and Saltier, and That May Quiet Cravings](https://www.sciencedaily.com/releases/2025/09/250915202848.htm) - [Semaglutide May Silence the Food Noise in Your Head](https://www.sciencedaily.com/releases/2025/09/250915202846.htm)\n\n### Monday, September 15, 2025\n\n- [Eating Mediterranean Could Be the Secret to Healthy Gums](https://www.sciencedaily.com/releases/2025/09/250915202841.htm)\n\n### Tuesday, September 16, 2025\n\n- [Stress Measured in Hair Could Predict Depression and Anxiety in Children](https://www.sciencedaily.com/releases/2025/09/250915202834.htm)\n\n### Monday, September 15, 2025\n\n- [Daily Eye Drops Could Make Reading Glasses Obsolete](https://www.sciencedaily.com/releases/2025/09/250914205832.htm) - [Half of Adults Suffer from Dry Eyes, but Most Never Get Help](https://www.sciencedaily.com/releases/2025/09/250914205829.htm)\n\n### Sunday, September 14, 2025\n\n- [Cannabis Use May Quadruple Diabetes Risk](https://www.sciencedaily.com/releases/2025/09/250914205803.htm) - [Being Too Thin Can Be Deadlier Than Being Overweight, Danish Study Reveals](https://www.sciencedaily.com/releases/2025/09/250914205759.htm) - [AI Can Now Predict Who Will Go Blind, Years Before Doctors Can](https://www.sciencedaily.com/releases/2025/09/250913232921.htm) - [Most Quit Breakthrough Weight-Loss Drug Within a Year](https://www.sciencedaily.com/releases/2025/09/250913232157.htm)\n\n### Friday, September 12, 2025\n\n- [Fatty Liver Breakthrough: A Safe, Cheap Vitamin Shows Promise](https://www.sciencedaily.com/releases/2025/09/250912195101.htm)\n\n### Monday, September 29, 2025\n\n- [Junk Food Can Scramble Memory in Just 4 Days](https://www.sciencedaily.com/releases/2025/09/250927031249.htm)\n\n### Monday, September 22, 2025\n\n- [Hidden Brain Signal Reveals Alzheimer’s Years Before Symptoms](https://www.sciencedaily.com/releases/2025/09/250922074952.htm) - [A Hormone That Silences the Immune System May Unlock New Cancer Treatments](https://www.sciencedaily.com/releases/2025/09/250921091002.htm) - [Want a Younger Brain? Harvard Researchers Say Eat Like This](https://www.sciencedaily.com/releases/2025/09/250921090902.htm)\n\n### Tuesday, September 30, 2025\n\n- [First Living Cochlea Outside the Body Shows How Hearing Really Works](https://www.sciencedaily.com/releases/2025/09/250929055003.htm)\n\n### Monday, September 22, 2025\n\n- [Why Alcohol Blocks the Liver from Healing, Even After You Quit](https://www.sciencedaily.com/releases/2025/09/250921090859.htm)\n\n### Thursday, September 18, 2025\n\n- [Could Plastic in Your Food Be Fueling Azheimer’s?](https://www.sciencedaily.com/releases/2025/09/250917221010.htm)\n\n### Sunday, September 14, 2025\n\n- [Sleepless Nights May Raise Dementia Risk by 40%, Mayo Clinic Reveals](https://www.sciencedaily.com/releases/2025/09/250913232924.htm)\n\n### Sunday, September 28, 2025\n\n- [Autism May Be the Price of Human Intelligence](https://www.sciencedaily.com/releases/2025/09/250927031224.htm)\n\n### Saturday, September 27, 2025\n\n- [What Happens to Your Body When You Eat Too Many Ultra-Processed Foods](https://www.sciencedaily.com/releases/2025/09/250927031211.htm)\n\n### Saturday, September 13, 2025\n\n- [Surprising Giant DNA Discovery May Be Linked to Gum Disease and Cancer](https://www.sciencedaily.com/releases/2025/09/250912195128.htm)\n\n### Wednesday, September 10, 2025\n\n- [Mapping the Secret Escape Routes of Deadly Brain Tumors](https://www.sciencedaily.com/releases/2025/09/250910000307.htm)\n\n### Tuesday, September 30, 2025\n\n- [Yoga Isn’t as Heart-Healthy as You Think, New Study Reveals](https://www.sciencedaily.com/releases/2025/09/250930034240.htm)\n\n### Thursday, September 25, 2025\n\n- [Cambridge Scientists Created a Gel That Could End Arthritis Pain](https://www.sciencedaily.com/releases/2025/09/250925025401.htm)\n\n### Wednesday, September 17, 2025\n\n- [Rogue DNA Rings May Be the Secret Spark Driving Deadly Brain Cancer](https://www.sciencedaily.",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Vanderbilt leaders in filling the biomedical research pipeline shine at national meeting - VUMC News",
      "url": "https://news.vumc.org/2025/10/08/vanderbilt-leaders-in-filling-the-biomedical-research-pipeline-shine-at-national-meeting/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://vumc-reporter.s3.amazonaws.com/uploads/BioVU-research-stock-2022-V-SU008_edited-1.jpg",
        "1": "https://news.vumc.org/wp-content/themes/vumc-news/images/social/facebook_blue.png",
        "2": "https://news.vumc.org/wp-content/themes/vumc-news/images/social/bluesky_blue.png",
        "3": "https://news.vumc.org/wp-content/themes/vumc-news/images/social/x_blue.png",
        "4": "https://news.vumc.org/wp-content/themes/vumc-news/images/social/linkedin_blue.png"
      },
      "content": "Share:\n\nShare on Facebook\n\nShare on Bsky\n\nShare on X\n\nShare on LinkedIn\n\nShare via Email\n\n##### Print:\n\nPrint this article\n\nBy: Bill Snyder\n\nVanderbilt University School of Medicine played a major role last month in a national conference that showcased the critical need to train biomedical researchers to advance medical care and public health.\n\nSix Vanderbilt leaders in the training of MD- and PhD-level scientists spoke and participated in workshops at the 2025 [Biomedical Research Training Conference](https://web.cvent.com/event/d8f54c2d-2ffc-490d-a94a-eb107a542ef8/summary), hosted by the Association of American Medical Colleges’ Group on Research, Education and Training (GREAT).\n\nThe conference was held in Arlington, Virginia, in conjunction with the meeting of the [National Association of Clinician Scientist Training](https://mdphdassociation.org/).\n\nChris Williams, MD, PhD\n\n“Together, we are helping strengthen MD-PhD education and ensuring that our trainees are well prepared to lead in science and medicine,” [said](https://medschool.vanderbilt.edu/2025/09/30/vanderbilt-school-of-medicine-demonstrates-national-leadership-in-training-the-next-generation-of-scientists-and-physician-scientists/) one of the speakers, [Chris Williams](https://medicine.vumc.org/department-directory/Christopher-Williams), MD, PhD, director of the School of Medicine’s Medical Scientist Training Program ([MSTP](https://medschool.vanderbilt.edu/md/mstp/)).\n\n“We (also) bring back fresh insights and strategies that directly support our trainees in achieving excellence in their research and advancing their professional development,” added [Ashley Brady](https://medschool.vanderbilt.edu/career-development/person/ashley-brady-phd/), PhD, assistant dean of Biomedical Career Engagement and Strategic Partnerships in the Office of Biomedical Research Education and Training ([BRET](https://medschool.vanderbilt.edu/bret)).\n\nVanderbilt has been training physician-scientists for more than 60 years. Many of the program’s graduates have gone on to leadership positions in academia, government, industry and clinical practice.\n\nAshley Brady, PhD\n\nThe Vanderbilt BRET office has trained more than 2,000 PhD students from around the world through its umbrella biomedical graduate programs, the [Vanderbilt Interdisciplinary Graduate Program](https://medschool.vanderbilt.edu/igp/) (IGP) in Biological and Biomedical Sciences and the [Quantitative and Chemical Biology Program](https://medschool.vanderbilt.edu/qcb/).\n\nPanel discussions during the conference highlighted Vanderbilt’s cutting-edge approach to training that emphasizes fundamental principles of biology along with core competencies in problem-solving, communication and other skills.\n\nIGP Director [Madhvi Venkatesh](https://medschool.vanderbilt.edu/biochemistry/person/madhvi-venkatesh/), DPhil, and [James Dewar](https://medschool.vanderbilt.edu/biochemistry/person/james-m-dewar/), PhD, assistant professor of Biochemistry and director of Artificial Intelligence (AI) Initiatives for the IGP, discussed new coursework for graduate students that addresses the effective and responsible use of generative AI tools in biomedical research.\n\nMadhvi Venkatesh, PhD\n\n“It is imperative,” Venkatesh said, “that we equip our trainees with strong critical thinking skills and an understanding of new technologies to prepare them to improve our world through their research, leadership and innovation.”\n\nTo that end, the BRET Office of Career Development offers a program of career and professional development support called [ASPIRE](https://medschool.vanderbilt.edu/career-development/overview-of-the-bret-office-of-career-development/) (Augmenting Scholar Preparation and Integration with Research-Related Endeavors). Each year the program serves Vanderbilt’s approximately 1,000 graduate students and postdoctoral fellows in the biomedical sciences.\n\nOthers from Vanderbilt who spoke at the AAMC “GREAT” conference were [Lourdes Estrada](https://medschool.vanderbilt.edu/biochemistry/person/lourdes-estrada/), PhD, professor of Biochemistry and associate MSTP director for Academic Programs and Operations, and Megan Williams, PhD, assistant professor of Pharmacology and assistant MSTP director.\n\nChris Williams, an MSTP alumnus who has directed the program since 2016, is professor of Medicine, associate dean for Physician-Scientist Education in the School of Medicine, and holder of the MSTP Directorship. He also is president of the National Association of Clinician Scientist Training and chairs the AAMC MD-PhD Training Opportunities for Physician-Scientists Committee.\n\nBrady, associate professor of Medical Education and Administration, is a co-leader of the ASPIRE program. She helped develop the ASPIRE internship program, the [ASPIRE on the Road](https://medschool.vanderbilt.edu/career-development/aspire-on-the-road/) biopharma industry site-visit program, and the [ASPIRE to Innovate](https://medschool.vanderbilt.edu/career-development/aspire-to-innovate-postdoctoral-fellows-program/) Postdoctoral Fellowship Program, which provides entrepreneurial training in the commercialization of Vanderbilt inventions.\n\nVenkatesh, assistant professor of Biochemistry, led implementation of a new competency-based IGP curriculum in 2021. A member of the AAMC GREAT Academic Publishing Working Group, she oversees the first year of training in the IGP program as well as ongoing curriculum innovation and assessment.\n\n### Related\n\n##### Share:\n\nShare on Facebook\n\nShare on Bsky\n\nShare on X\n\nShare on LinkedIn\n\nShare via Email\n\n#post-378802\n\n### Related Articles\n\n##### September 27, 2012\n\n### AAMC meet highlights need for research funds\n\nDuring a meeting in Nashville last week, the director of the National Institutes of Health (NIH) called on academic medical centers to make the case for continued, strong federal investment in biomedical research.\n\n##### By Bill Snyder\n\n##### July 6, 2023\n\n### Yasminye Pettway selected as the 2023 Vanderbilt Prize Student Scholar\n\nYasminye Pettway has been selected as the 2023 Vanderbilt Prize Student Scholar.\n\n##### By Bill Snyder\n\n##### May 23, 2013\n\n### School of Medicine’s achievements outlined at Spring Faculty Meeting\n\nIn the midst of tight government budgets and uncertain times, Vanderbilt University Medical Center continues to move ever forward in training the next generation of physician researchers and biomedical scientists.\n\n##### By Bill Snyder",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Mouse resources at the RIKEN BioResource Research Center and the National BioResource Project core facility in Japan",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC8445257?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Dissemination of information\nDissemination of information associated with mouse strains has a vital role in facilitating active use of large-scale mouse resources by the biomedical community. We have recently renewed the RIKEN BRC home page and developed a revised version of the searchable online catalog of mouse strains that functions as a part of the BRC-integrated database (Masuya et al. [16]).\nMonthly email newsletters are sent to announce newly deposited mouse strains, users’ publications, relevant news, and coming events in both Japanese and English. To complement the functions of the integrated database and email news, we have launched proactive outreach corners focusing on specific strains, such as “*Today’s Tool for Functional Analysis,” “Today’s Model for Human Disease” and* ([https://mus.brc.riken.jp/en/todays_tool_and_model]()), and *“Mouse of the Month”* ([https://mus.brc.riken.jp/en/mouse_of_month]()) to provide researchers with information about advanced strains and facilitate the use of such strains for cutting-edge research. For the Mouse of the Month, strains are selected based on the potential impact of relevant publications as well as access log data for strains from the web catalog. The articles are designed in a mini-review format that includes representative images or figures and a summary of the strain including gene details, use applications, the latest research results, and references. The strain name with its repository unique identifier (RBRC number) is linked to each strain data sheet page of the online catalog supported by the BRC-integrated database. The Today's Tool and Model series are presented in a list format to disseminate more genetic tools and disease models; the list provides the title of the strain, its strain ID with a link to its strain data sheet, brief descriptions, and references with PubMed links.\n\n## Cryopreservation and secure back-up storage\nMice with high demand are maintained as live stocks for faster distribution, while mice with lower demand are preserved as frozen sperm or embryos in liquid nitrogen tanks for cost-effective management. Two-cell stage embryos of various strains have been successfully cryopreserved by using ethylene glycol-based vitrification (Mochida et al. [20]). Sperm samples were cryopreserved by the method reported by Nakagata and Takeshima ([22]). Recent advances in assisted reproductive technologies have facilitated efficient preservation and recovery of various inbred strains and dozens of unique wild-derived strains belonging to different species and subspecies of *Mus* (Hasegawa et al. [8], [9], [10]; Mochida et al. [21]). Cryopreservation also plays a key role in protecting the deposited mouse strains by minimizing genetic drift, which may occur during continuous breeding periods (Wiles & Taft [37]). We cryopreserve embryos or sperm at the earliest stages after deposition and whenever possible with genomic DNA samples and breeding records in order to recover a live colony from earlier generations after extensive breeding periods or whenever undesired mutations are detected.\nWe have preserved approximately 95% of collected strains as frozen embryos and sperm. A rapidly increasing number of genetically modified strains developed by genome editing have efficiently been cryopreserved by sperm freezing. To protect the archived strains from disasters, the RIKEN BRC has built a back-up facility in the RIKEN Harima branch 700 km away, and every frozen strain has regularly been transferred there since 2007. Moreover, after the Great Eastern Japan Earthquake of 2011, we have installed an in-house water supply system, liquid nitrogen suppliers, and large fuel tanks for an emergency power supply to sufficiently handle a one-week outage to strengthen the security of the main collection in Tsukuba.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Research ethics consultation",
      "url": "https://en.wikipedia.org/wiki/Research%20ethics%20consultation?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Analogous to clinical ethics consultation, Research Ethics Consultation (REC) describes a formal way for researchers to solicit and receive expert ethical guidance related to biomedical research. The first REC service was established at the National Institutes of Health (NIH) Clinical Center in 1997. Today, most REC services are found at academic institutions, and the majority of current services were originally launched in response to the 2006 NIH Clinical and Translational Science Award program, as applicants to that program were required to have procedures in place to address ethical concerns raised by their research.\n\nWhile still a young discipline with no explicit standards, individuals serving as research ethics consultants are expected to be familiar with research ethics and ethical analysis; knowledgeable about the applicable regulations, laws, and policies; and ideally also have some biomedical research experience and scientific expertise.\n\nREC is distinct from related services, such as those of Institutional Review Boards, in that it is typically available at any point during a study (planning, conducting, interpreting, or disseminating results), and can relate to any ethical question. While little is known about the range and distribution of topics put forth for REC, such services may be particularly important and useful for studies of known regulatory and ethical uncertainty (e.g. assessment of minimal risk in pediatric studies) and frontier research for which there is little if any regulation or expert consensus. The recommendations that result from the consultation are non-binding, meaning that the researcher may choose to follow the recommendation, or to pursue a different approach.\n\nSee also \n Institutional Review Board\n Ethics Committee (European Union)\n Human experimentation in the United States\n IRB: Ethics & Human Research\n Informed consent\n Data Monitoring Committees\n Office for human research protections\n Ethical problems using children in clinical trials\n National Commission for the Protection of Human Subjects of Biomedical and Behavioral Research\n\nReferences\n\nEthics\nConsulting",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Current Health News & Updates For the Mind & Body | Fox News",
      "url": "https://www.foxnews.com/health?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://static.foxnews.com/static/orion/styles/img/fox-news/og/og-fox-news.png",
        "1": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/920/518/woman-water-bottle-plastic.jpg?ve=1&tl=1",
        "2": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/454/256/mmr-vaccine-in-arm.jpg?ve=1&tl=1",
        "3": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/454/256/senior-woman-helping-husband.jpg?ve=1&tl=1",
        "4": "https://a57.foxnews.com/static.foxnews.com/foxnews.com/content/uploads/2025/10/348/196/kimchi-korean-food-blood-pressure-superfood-health-benefits-3.jpg?ve=1&tl=1"
      },
      "content": "TINY TOXINS\n\nTHROWING JABS\n\nTARGETED HEALING\n\n0:02:260:05:16\n\nNew research reveals that bottled water drinkers consume significantly more microplastics than tap water users, with particles linked to cancer risks and chronic health complications.Salon hair washing can trigger rare beauty parlor stroke syndrome when neck positioning compresses arteries, though proper support reduces risk significantly.New JAMA study finds inhalers for asthma and COPD generate over 2 million metric tons of carbon emissions annually, equivalent to pollution from 530,000 cars.Medical experts and vaccine maker Merck reject HHS Deputy Secretary Jim O'Neill's suggestion to split the MMR vaccine into individual measles, mumps and rubella shots.Researchers announce breakthrough results for AMT-130, the first disease-modifying treatment for Huntington's disease, with FDA approval application planned for early next year.Scientists in Germany have created a novel flu detection method using an edible sensor that produces taste when the influenza virus is present in the mouth.Air pollution exposure could make Alzheimer's disease worse by speeding up brain changes that cause memory loss and impaired judgment, a Penn Medicine study finds.High costs and shortages are driving demand for unregulated GLP-1 drugs, prompting FDA alerts about counterfeit Ozempic and calls for stricter enforcement by legal experts.Researchers analyzed data from over 222,000 Parkinson's patients and found TCE exposure from metal degreasing and industrial cleaning may increase disease risk.A new Wright State University study finds that over 40% of fatal car accident victims had elevated THC levels in their blood, with average concentrations far exceeding legal limits.Professor Elliot Long explains why sepsis in children is difficult to diagnose, with nearly 10% of cases missed in emergency rooms despite being treatable.Nutritionist Kendall Mackintosh recommends fruits packed with natural hormones and antioxidants to help regulate sleep cycles and aid rest.A NIH-funded study shows acupuncture treatments significantly reduce chronic low back pain and disability in adults 65 and older compared to usual medical care alone.Testosterone therapy can help men with low hormone levels, but experts warn of serious risks including stroke, prostate issues and heart disease complications.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.A clinical trial of NVG-291 peptide drug demonstrates promising results for spinal cord injury patients, with participant Larry Williams regaining balance abilities.New research reveals synthetic cannabinoid users experience more severe psychotic symptoms than natural cannabis users, with gaming disorders creating additional risks.A UCLA study shows that a new treatment combining a radioactive drug with radiation therapy could help delay hormone therapy for men with recurring prostate cancer.Weight-loss experts explain why combining GLP-1 medications with bariatric surgery may be the most effective approach to treating obesity in 2025.Scientists link poor oral health to dramatically higher pancreatic cancer risk, emphasizing the importance of regular brushing and dental care for prevention.Researchers developed an experimental method to convert skin cells into eggs, potentially allowing older women and same-sex couples to have genetically related children.Amid growing outbreaks, Americans traveling abroad should use insect repellent and protective clothing to prevent chikungunya virus, experts recommend.The FDA-approved Inluriyo, an oral estrogen receptor antagonist from Eli Lilly, has shown to achieve significant improvement in progression-free survival for breast cancer.Research on María Branyas, the world's oldest woman at 117, reveals how healthy diet, beneficial gut bacteria and protective genes contributed to her record-breaking longevity.A new study from the University of Leicester finds that high fruit intake reduces air pollution's harmful effects on the lungs, particularly in women who eat four portions daily.Registered dietitians weigh in on Starbucks' new protein drinks, noting benefits for breakfast skippers while cautioning against using them as meal substitutes.Medical experts recognize type 5 diabetes as separate from other types, requiring specialized treatment focusing on nutritional rehabilitation and careful insulin management.The honey and salt pre-workout trend gains expert approval from nutritionist Robin DeCicco, who says the combination mimics supplements' effects for gym sessions.A new study finds that GLP-1 medications are linked to lower overall cancer risk, particularly for endometrial and ovarian cancers, in obese adults. Oncologist Dr. Slomovitz discusses the findings.A simple wellness trend of jumping 50 times each morning gains popularity on TikTok as an accessible alternative to traditional morning workouts.Experts question the popular social media trend of using magnesium products on the feet for better sleep due to a lack of research backing the claims.Personal trainers explain how older adults can exercise safely by avoiding common mistakes like ego lifting, skipping strength training and having inadequate recovery time.A new study finds that vitamin B3 (nicotinamide) at 500 mg twice daily reduces basal cell carcinoma and squamous cell carcinoma risk in veterans over a 25-year period.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Flu vaccination timing varies by group, with pregnant women and those over 65 advised to wait until September, while some children may need two doses.Jeffrey Mittman transforms his experience as a blind Army veteran into advocacy for disabled employment through his leadership role on the U.S. AbilityOne Commission.A study of 766 patients suggested that specially formulated eye drops improved near vision for over 80% of presbyopia sufferers after one year of daily use.The XFG variant, also known as Stratus, is now the predominant COVID-19 strain in the U.S. after spreading to 38 countries, according to WHO and CDC data.New York City doctors reveals how weight-loss drugs reduce inflammatory cytokines by decreasing fat cells, potentially preventing cancer and autoimmune diseases.A dangerous drug-resistant bacteria called NDM-CRE is spreading rapidly across the U.S., resisting most antibiotics and proving difficult for doctors to treat.The family of Sophia Forchas shares an update on the 12-year-old's recovery after she was critically injured in a mass shooting at Annunciation Catholic Church in Minneapolis.Autism diagnoses rose from 1 in 150 children in 2000 to 1 in 31 in 2022, sparking debate about whether this reflects better detection or a true increase in the disorder.A new oral weight loss medication, orforglipron, demonstrated meaningful weight loss results in phase 3 trials, potentially providing an easier alternative to Ozempic injections.Mayo Clinic study reveals nontraditional factors cause over half of heart attacks in women under 65, compared to atherosclerosis being responsible for 75% of men's cases.Experts share symptoms of autism in adults, including social communication challenges, repetitive behaviors, difficulty making eye contact and intense specific interests.The cancer medication leucovorin shows potential benefits for autism spectrum disorder, improving communication skills in some children, say administration health officials.New research from Edith Cowan University shows that a single bout of weight training or HIIT can boost anti-cancer myokines and reduce breast cancer cell growth in survivors.Four American families aim to raise $1.15 million by October to fund a phase 3 gene therapy trial for their children with SPG50, a rare genetic disease.Kristen Bell eats leafy gerens before carbs to prevent glucose spikes, a biohacking approach that experts say can improve mood and reduce diabetes risk.Metabolic dysfunction-associated steatohepatitis (MASH) is a silent liver disease that is caused by fat buildup, inflammation and cell damage in the liver. Here's what to know.New research challenges BMI assumptions, showing overweight individuals may not face higher death rates while underweight people show increased mortality risk.Singer Selena Gomez's lupus-related arthritis diagnosis sheds light on how up to 90% of lupus patients experience joint pain, according to medical experts and recent research.Strength training for seniors should emphasize posterior muscles like the glutes and upper back rather than mirror muscles to prevent pain and maintain independence.Two healthcare workers were fired by Acadian Ambulance Service and Children's Healthcare of Atlanta for controversial social media comments about Charlie Kirk's assassination.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Trump administration announces organ procurement reforms with $25 million investment for living donors and new oversight measures for patient safety.The \"7 As\" of super-aging offer practical strategies for living longer and healthier lives, covering attitude, activity, awareness and four other key principles.Medical experts say vaccination is the best prevention method for hepatitis B, a liver infection that can be acute or chronic. The disease has no cure and can cause a variety of complications.Researchers found that 160 milligrams of daily aspirin significantly lowered cancer recurrence risk for colorectal patients with PIK3 pathway alterations.Mayo Clinic researchers report that chronic insomnia in older adults leads to a 40% higher dementia risk and accelerated brain aging over 5-1/2 years.New research reveals that GLP-1 drugs may significantly lower mortality rates in Americans by 2045, as obesity contributes to 70% of leading death causes in high-income countries.Heart health requires balance across lifestyle factors, as poor sleep, lack of exercise or bad diet can drive inflammation and cardiovascular disease, expert says.Cannabis users showed a 2.2% diabetes rate compared to 0.6% for non-users over five years, with researchers linking marijuana to appetite and metabolism changes.A Detroit nurse at Henry Ford Health was placed on leave following a social media comment supporting violence against Charlie Kirk after his assassination.Psychotherapist Jonathan Alpert explains how witnessing traumatic events, like recent deaths, can cause shock, fear and sleep difficulties, and shares coping mechanisms.West Nile virus outbreak has intensified across the U.S., with the 770 reported human cases far exceeding normal seasonal patterns for severe infections.Health experts warn pregnant women that marijuana poses safety risks even where legal, with no known safe amount of cannabis during pregnancy.Celebrity trainer Kollins Ezekh explains Zone Zero workout trend to Fox News Digital, describing light movement that supports recovery without strain or intensity.The cortisol cocktail, a trending social media drink made with coconut water and orange juice, claims to reduce stress hormones and boost energy levels.Global childhood obesity rates tripled from 2000-2022 according to UNICEF, with ultra-processed foods and junk food marketing fueling the epidemic in 190 countries.Riverside Walter Reed Hospital terminated an anesthesiologist's contract after she posted inappropriate comments supporting violence against Charlie Kirk.Health experts recommend strength training as the main priority for older adults to prevent muscle decline and maintain functional fitness for daily activities.Scientists developed a non-invasive MRI technique to measure brain iron levels, which may help identify patients at higher risk of developing Alzheimer's disease early.The Fox News Health Newsletter brings you trending and important stories about healthcare, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Psychiatrist Dr. Daniel Amen explains how beta blockers work for anxiety by blocking adrenaline effects, as the medication is growing rapidly in popularity.Fox News correspondent Eric Shawn reveals he was diagnosed with cancer this year from 9/11 toxic dust exposure while reporting on the 24th anniversary ceremony.Certain prescription medications, including beta-blockers and gabapentinoids, could increase fall risk in older adults, as some experts claim that reducing unnecessary drugs could prevent injuries.Researchers are warning of a diabetes crisis, as nearly half of 1.3 billion affected adults go undiagnosed, with young people and low-income regions most at risk.GLP-1 medications like Ozempic show promise for multiple health conditions, as experts explore microdosing benefits for blood sugar control and longevity.Cardiothoracic surgeon Dr. Jeremy London discusses the 80/20 diet approach for heart health, emphasizing whole foods 80% of the time while limiting alcohol and processed foods.A new study reveals that sucralose may reduce cancer treatment effectiveness, but supplementation could counteract the artificial sweetener's negative effects.A new study shows that LSD reduced anxiety symptoms in adults with generalized anxiety disorder, with 100-microgram doses proving most effective in a clinical trial.Scientists have created a pre-clinical weight loss drug combining GLP-1, GIP, glucagon and peptide YY hormones to match bariatric surgery effectiveness.Researchers discovered Human Pegivirus in brain tissue from five of ten Parkinson's patients, suggesting the virus may play a role in the neurodegenerative disease.Researchers suggest intense marathon training may cause gut stress leading to colon adenomas, with 41% of studied runners having at least one polyp.Research identifies five food additive categories including flavors, sweeteners and coloring agents that may significantly increase all-cause mortality risk.Orthopedist Dr. Ran Schwarzkopf of NYU explains how knee pain affects more young people in their 30s and 40s due to obesity and high-intensity sports.Helen Mirren's simple XBX workout routine from the Royal Canadian Air Force demonstrates how a vintage 12-minute plan remains effective decades later.A new study from Beth Israel Deaconess Medical Center in Boston finds that using smartphones in the bathroom increases hemorrhoid risk by nearly 50%.A new study reveals that eating dinner within two hours of bedtime and frequently missing breakfast correlates with increased osteoporotic fracture risk in adults.Health officials investigate three tuberculosis cases in Maine's Greater Portland area, working to test contacts of infected patients for the bacterial disease.A study of 12,772 adults reveals artificial sweeteners like aspartame and saccharin are linked to accelerated cognitive decline and memory problems.Cannabis users with childhood trauma experience worse paranoia effects, according to new studies, as researchers warn against self-medicating with marijuana.The Fox News Health Newsletter brings you trending and important stories about health care, drug developments, mental health issues, real people's triumphs over medical struggles, and more.Rabies outbreaks among wild animals are rising across the U.S., with different species presenting regional risks, from the eastern states to Alaska and the Southwest.Researchers found that AI-enabled stethoscopes can help doctors identify heart failure, atrial fibrillation and valve disease early, potentially improving patient treatment outcomes.A phase 2 study shows that azelastine nasal spray lowered coronavirus infection rates to 2.2% compared to 6.7%, researchers at Germany's Saarland University revealed.\"Kissing bugs\" transmit Chagas disease through infected feces, causing symptoms like fever and potentially fatal heart problems in 20%-30% of chronic cases.Surgeon General Joseph Ladapo and Gov. Ron DeSantis announced that Florida will move to eliminate vaccine mandates in schools, citing informed consent and individual choice over mandates.Erin Andrews credits her routine gynecologist's visits with saving her life from cervical cancer and now advocates for early detection through a national campaign.",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Award rate inequities in biomedical research",
      "url": "https://arxiv.org/abs/2207.01488?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "_page_18_Figure_2.jpeg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-arxiv/05f897bd-981a-5e6d-bbd1-cba0a68d52d9/_page_18_Figure_2.jpeg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22_page_18_Figure_2.jpeg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPVQ7TYDH4%2F20251009%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251009T115135Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEDwaCXVzLWVhc3QtMSJIMEYCIQD58hJvNbu2hpsOYAqI%2FKkVLwHYLs8gb9XkamBk7X%2BJ7gIhAJhfYUY6mWM4Jj3fG82NAV1RtrKF4AJu9%2BVdAzwmt29pKpIECNT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMNjI3NjY1ODU1NTE5IgyP73ly2bwz%2FXvzL0gq5gOnUS4JNQlOg8y%2BlrY7WJCt8TAWPxfX1PK6XKQbEUj1TBD2ovxVMR5NizKMNMGurFuzzm6ihdPce75w1kOvPWBhueQaD7bt1IjSvw6orU%2Fa%2BncGitubxTJOXNQvdoxoVZptTxMUfpHGRP0Xp6PylXvhhQLBYpr9XystiG1EwingkmFyflK0zzm2f94rIxUK6hqze8A%2BZc673gMzRnJeefqtykPXlYJ%2FlnI9GSUeEnnJ8e8qz%2B0ZYRTnNmAfq%2BV166B4zaG78yeJNPifwnHlD%2F81ZdsNspiITkKAcVTaPsGaphblSzNNpPJ1PwO9XeWFH3ihRIP5B2cJsGOFs5pHM0ru79GMTc5LVLtMqs2Odr8nBDBFRq9oHD8ib%2B%2BUhfozOE110sH3zj0eO06hMHc5tvyMsR68oSGoegiwcJIAnZtoMmBC7F52sx0sCRcMQCihEZ%2B4ukZ5pvBslsq0fDYseW1dDcN0UrqGTnvq%2BX3p4gBli4lRTSXll5lxz5CJiSVNe9Uh%2BVeeT7mnroteh4GmVbjjjA9EiuwVPJYnqim7BSECSp%2FfRBYmIogcBWVhQjIvR5XfPw4cNVqBsqQBqi9uVgGmR2sCWKAsjORj7HVgfn7A%2Bdt0jxqAMq9X9wLAoPDUzlroRPHP9oYwv66exwY6pAEtYvMBxALrzMGPmm8HexzHgihN%2BKQ%2BTCiBL42v6tmZ%2BomnjgstGiDc0Wy1rnE6VuOyMZ7GQgCBgo3l667Ri1U4NMnABcm35Z9LOo8BdRUa6TeZaBwvnJ4tdfVn7xosfE%2FccFtUkTBg8g%2FC6kWz%2F%2B93tjfwXk6GY9cQsn44VGIo4Mlu0AJlsMmE4bg6b%2FpCYejxIrLAR0hqWhNnOGAnyrZHUuBvVg%3D%3D&X-Amz-Signature=9328d367e22076f9372449cfd3e2bceceede9cc4af3cc85a8fd30e57504482b4"
      },
      "content": "## **Introduction**\n\nThe scope and scale of academic research pursued within the United States today is not possible without federal funding. The National Science Foundation's annual Higher Education Research and Development Survey reported total higher education R&D expenditures of $86.4 billion for federal fiscal year 2020 with more than 46 of those expended billions originating with the federal government [1]. Focusing more specifically on academic biomedical research, the National Institutes of Health (NIH) alone awarded research grants in excess of $29 billion during the same fiscal year [2]. It is not surprising then that when the first major study documenting racial disparity in research funding was published in 2011, the authors focused on the NIH [3]. Since this original study, others have added to the national discussion using NIH proposal data [4-8].\n\nThe NIH is the largest and most influential funder of academic biomedical research within the United States. NIH research awards, particularly R01 and equivalent funding mechanisms, play an important role in promotion and tenure decisions as well as in the stability of research programs. The size and duration of these awards allow researchers to spend more of their effort on research and less on grant-writing. Academic institutions particularly value NIH award funding as it generally comes with higher indirect cost rates than non-federal funding and is used in external rankings of Medical School research programs. For instance, when evaluating Medical Schools for their \"Best Medical Schools for Research\" rankings, US News & World Reports assigns a weight of 0.4 out of 1.0 to \"Research Activity\". This metric is based solely on federal funding [9], the large majority of which comprises NIH grants. While US News & World Reports began publishing a campus ethnic diversity index in 2020 [10] it is not incorporated into the \"Best Medical Schools for Research\" calculation and does not currently influence these rankings. As Ginther has shown [3,4] and researchers within the NIH have recently acknowledged and expanded upon [5,6], there remains a significant gap between NIH funding rates of white principal investigators (PIs) and Black/African American (B/AA) PIs. As such, there is an inherent tension between medical school rankings and faculty diversity.\n\nThe need for increased diversity in academic medicine and the biomedical workforce has been well substantiated. While many academic institutions advocate for increased equity among faculty sub-demographics, there remains a dearth of quantitative information supporting specific interventions. Understandably, academic administrators and faculty leaders are hesitant to implement reforms that could unintentionally compound existing inequities or even create new systemic problems. The issues are considered too important to get wrong. This sense of policy paralysis, in turn, can lead institutions into a cycle of calls for action followed by a series of educational events that, while important, are insufficient on their own to effect policy change.\n\nOne practical step forward is for academic administrators to utilize the proposal databases that have already been created at their institutions to understand and evaluate diversity in academic research. Given the importance of extramural grant funding to academic research and the\n\nsubsequent emphasis placed upon grant funding in everything from individual faculty promotion and tenure review to departmental evaluation, it is reasonable to begin any study of potential research inequity with an analysis of research grant proposal submissions and awards. This will not only increase the collective knowledge about how our research funding system works in all its complexity, but it will also, perhaps most importantly, represent a starting point for changing faculty development and research support procedures, performance metrics and their interpretation, as well as promotion and tenure review systems.\n\nDr. James Hildreth noted that at historically black colleges, there is an \"intimidation factor\" about submitting to the NIH and a presumption that proposals will not be evaluated fairly [11]. This anecdote, along with the reported racial/ethnic differences in award rates by the NIH, led us to investigate the relationship between race/ethnicity and submission behaviors for principal investigators at the University of Michigan Medical School (UMMS). We hypothesized that principal investigators adjust their proposal submission strategies to compensate for Award Rate Inequality (ARI), established or perceived from lived experience, across funding sources.\n\n## **Supporting information**\n\n**S1 Table. Proposal Award Rates for Proposals from Asian vs. White Researchers.**\n\n**S2 Table. Proposal Award Rates for Proposals from B/AA vs White Researchers.**\n\n**S3 Table. Proposal Award Rates for Proposals from Hispanic/Latino vs. White Researchers.**\n\n**S4 Table. Proposal Submission Percentages by Asian vs. White Researchers.** \n\n**S5 Table. Proposal Submission Percentages by B/AA vs. White Researchers.**\n\n**S6 Table. Proposal Submission Percentages by Hispanic/Latino vs. White Researchers.**\n\n**S7 Table. Comparison of Submission and Award Rates.** The award and submission ratios for each racial/ethnic group-submission category pair.\n\n**S8 File. Proposal Submission and Award Data by Submission Category and PI Race/Ethnicity.**\n\n### Figure 1\n\n[_page_17_Figure_1.jpeg]: </F>\n['<FG id=\"_page_17_Figure_1.jpeg\">\\n**Figure 1**: Figure 1\\n<F href=\"_page_18_Figure_2.jpeg\">\\n<FG id=\"_page_16_Figure_1.jpeg\">\\n**Figure 1**: Figure 1\\n<F href=\"_page_18_Figure_2.jpeg\">\\nFigure 1\\n</F>\\n</FG>']",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Biomedical Convergence Facilitated by the Emergence of Technological and Informatic Capabilities.",
      "url": "https://arxiv.org/abs/2103.10641?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "_page_6_Figure_3.jpeg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-arxiv/629d4469-d1dd-50e0-ad30-6204719f806f/_page_6_Figure_3.jpeg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22_page_6_Figure_3.jpeg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPVQ7TYDH4%2F20251009%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251009T115135Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEDwaCXVzLWVhc3QtMSJIMEYCIQD58hJvNbu2hpsOYAqI%2FKkVLwHYLs8gb9XkamBk7X%2BJ7gIhAJhfYUY6mWM4Jj3fG82NAV1RtrKF4AJu9%2BVdAzwmt29pKpIECNT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMNjI3NjY1ODU1NTE5IgyP73ly2bwz%2FXvzL0gq5gOnUS4JNQlOg8y%2BlrY7WJCt8TAWPxfX1PK6XKQbEUj1TBD2ovxVMR5NizKMNMGurFuzzm6ihdPce75w1kOvPWBhueQaD7bt1IjSvw6orU%2Fa%2BncGitubxTJOXNQvdoxoVZptTxMUfpHGRP0Xp6PylXvhhQLBYpr9XystiG1EwingkmFyflK0zzm2f94rIxUK6hqze8A%2BZc673gMzRnJeefqtykPXlYJ%2FlnI9GSUeEnnJ8e8qz%2B0ZYRTnNmAfq%2BV166B4zaG78yeJNPifwnHlD%2F81ZdsNspiITkKAcVTaPsGaphblSzNNpPJ1PwO9XeWFH3ihRIP5B2cJsGOFs5pHM0ru79GMTc5LVLtMqs2Odr8nBDBFRq9oHD8ib%2B%2BUhfozOE110sH3zj0eO06hMHc5tvyMsR68oSGoegiwcJIAnZtoMmBC7F52sx0sCRcMQCihEZ%2B4ukZ5pvBslsq0fDYseW1dDcN0UrqGTnvq%2BX3p4gBli4lRTSXll5lxz5CJiSVNe9Uh%2BVeeT7mnroteh4GmVbjjjA9EiuwVPJYnqim7BSECSp%2FfRBYmIogcBWVhQjIvR5XfPw4cNVqBsqQBqi9uVgGmR2sCWKAsjORj7HVgfn7A%2Bdt0jxqAMq9X9wLAoPDUzlroRPHP9oYwv66exwY6pAEtYvMBxALrzMGPmm8HexzHgihN%2BKQ%2BTCiBL42v6tmZ%2BomnjgstGiDc0Wy1rnE6VuOyMZ7GQgCBgo3l667Ri1U4NMnABcm35Z9LOo8BdRUa6TeZaBwvnJ4tdfVn7xosfE%2FccFtUkTBg8g%2FC6kWz%2F%2B93tjfwXk6GY9cQsn44VGIo4Mlu0AJlsMmE4bg6b%2FpCYejxIrLAR0hqWhNnOGAnyrZHUuBvVg%3D%3D&X-Amz-Signature=08bb32e7838fc883f06987003b2ca77e8d160c4f5868e753e8e4acef83cf2b12"
      },
      "content": "The second cluster is comprised of diagnostic methods associated with particular diseases and the systems they affect, as represented by MeSH primarily from branches A (\"Anatomy\"), C (\"Chemicals and Drugs\") and E (\"Analytical, Diagnostic and Therapeutic Techniques, and Equipment\"). The third cluster is comprised of biological entities and the phenomena that relate them, from cells to chemicals and the multi-scale processes that connect inputs, outputs and characteristics of their reaction environments.\n\nHistorical co-occurrence trends. The last half-century of biomedical research has witnessed incredible transition from a descriptive field – focused around identifying molecules, higher-order structures, reaction pathways and mediators – into a field seeking to identify holistic mechanisms underlying systemic abnormalities in an effort to develop pointed therapies. This transition is illustrated through the Nobel Prizes awarded for Chemistry and Physiology or Medicine, which up until the 1970s and 1980s predominantly awarded research documenting key structural entities and reactions. Based upon this early work, subsequent Nobel research has transitioned to addressing challenges at the nexus of the medical innovation triple helix – where societal demand and industrial supply for acute solutions are facilitated by technological capabilities [18].\n\nTo illustrate this point, Fig. 2(A) shows the top ten stemmed keywords from Nobel Prize \"rationale\" statements, identifying prominent contextual themes across the last half century. Indeed the 1980s brought forth novel imaging, laboratory control and synthesis technologies, fundamental in the 1990s to map the genetic blueprints encoding biological structure [28]. Polymerase chain reaction (PCR), among other high-throughput techniques, accelerated science to the realm of highly controllable, scalable and permutable processes that hitherto have been primarily restricted to traditional computational domains. Since then, the last twenty years has been marked by the rapid development of bioengineering capabilities, such as CRISPR gene editing tools [48] and powerful demonstration of stem cell pluripotency [49], which allow scientists to more precisely understand emergent structure-function relations, opening the door for synthetic biology applications [50] that (re)design biological systems [51] or even develop altogether new building blocks [52].\n\nTo visualize this history unfold, we disaggregated the MeSH co-occurrence data into four non-overlapping periods: 1970- 1989, 1990-1999, 2000-2009 and 2010-2018. For each period we tabulate the co-occurrence matrix, denoted by M(1) y (M(2) y ), where y denotes a given period. Figure 2(B) illustrates the structural dynamics at the L1 level, identifying branch E and J as vacillating domains switching between the two dominant clusters. The first L1 cluster is characterized by D, A, G and B – largely descriptive SA, with the exception of \"Phenomena and Processes\" (G). The second cluster is comprised of N, F and L – peripheral SA which are increasingly convergent with the traditional SA, as indicated by extreme off-diagonal elements representing cross-domain integration.\n\nAt higher resolution, Fig. 2(C) shows the structural evolution of M(2) y , which is characterized by two relatively stable clusters and a more diverse and vacillating intermediate cluster. Note that MeSH are sorted within each cluster in decreasing order of prevalence, calculated as the sum of co-occurrence values across a given row of M(2) y . Notably, \"Information Science\" (L01) and \"Technology, Industry, and Agriculture\" (J01) are located in this intermediate cluster during the 1970-1989 period, where they play less dominant roles as indicated by their ranks within the cluster. However, over time their prominence within this\n\n[_page_5_Figure_0.jpeg]: Prominent convergence bridges. (A) For each MeSH, we analyzed the time series of bridge rank, Ri,t, a normalized ranking based upon the knowledge bridge score (βi) defined in Eq. (1). Smaller rank values (Ri,t) correspond to larger βi values, representing MeSH that are highly co-occurrent with MeSH belonging to other knowledge clusters. Plotted are smoothed time series to facilitate visual inspection. Notably, J01 and L01 are rapidly emerging convergence bridges arising from the highly generalizable, scalable and codifiable nature of techno-informatic tools and algorithms facilitating novel non-invasive imaging, high-throughput analysis, measurement, and data integration. Other MeSH shown here identify the emerging convergence nexus of Health Care (N04, N05) and Behavior (F01). (B) MeSH neighborhood subnetworks for J01 and L01 each show the ten most frequently co-occurring MeSH for the indicated period – sorted clockwise, starting from the top, with nodes sized proportional to M(2) ij ; each MeSH's SA is indicated by its node/label color. Links are plotted with thickness and shade proportional to M(2) jj0 , thereby indicating the crossdomain linkages among prominent neighbors that are facilitated by i. Each node includes its MeSH identifier and a knowledge cluster identifier, the latter indicated by a gray scale gradient. For example, MeSH J01 \"Technology, Industry, and Agriculture\" (which is a member of C3 for the first three periods and subsequently transitioning to C1 in the most recent period) is highly connected to MeSH from all other clusters (C1-C3), in particular to L01 until its disassociation in the most recent period 2010-2018; interestingly, L01 \"Information Science\" diverged from J01 as early as the first period 1970-1989, subsequently becoming more strongly coupled with members of branch E and G. See Figs. S3-S4 for extended analysis of bridge ranks and neighborhood subnetworks for the re-\n['<FG id=\"_page_5_Figure_0.jpeg\">\\n**Figure 3**: Figure 3\\n<F href=\"_page_6_Figure_3.jpeg\">\\nFIG. 3: Prominent convergence bridges. (A) For each MeSH, we analyzed the time series of bridge rank, Ri,t, a normalized ranking based upon the knowledge bridge score (βi) defined in Eq. (1). Smaller rank values (Ri,t) correspond to larger βi values, representing MeSH that are highly co-occurrent with MeSH belonging to other knowledge clusters. Plotted are smoothed time series to facilitate visual inspection. Notably, J01 and L01 are rapidly emerging convergence bridges arising from the highly generalizable, scalable and codifiable nature of techno-informatic tools and algorithms facilitating novel non-invasive imaging, high-throughput analysis, measurement, and data integration. Other MeSH shown here identify the emerging convergence nexus of Health Care (N04, N05) and Behavior (F01). (B) MeSH neighborhood subnetworks for J01 and L01 each show the ten most frequently co-occurring MeSH for the indicated period – sorted clockwise, starting from the top, with nodes sized proportional to M(2) ij ; each MeSH\\'s SA is indicated by its node/label color. Links are plotted with thickness and shade proportional to M(2) jj0 , thereby indicating the crossdomain linkages among prominent neighbors that are facilitated by i. Each node includes its MeSH identifier and a knowledge cluster identifier, the latter indicated by a gray scale gradient. For example, MeSH J01 \"Technology, Industry, and Agriculture\" (which is a member of C3 for the first three periods and subsequently transitioning to C1 in the most recent period) is highly connected to MeSH from all other clusters (C1-C3), in particular to L01 until its disassociation in the most recent period 2010-2018; interestingly, L01 \"Information Science\" diverged from J01 as early as the first period 1970-1989, subsequently becoming more strongly coupled with members of branch E and G. See Figs. S3-S4 for extended analysis of bridge ranks and neighborhood subnetworks for the re-\\n</F>\\n</FG>']",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "ICMR NAFRBR Consultant Recruitment 2025 - Apply Offline",
      "url": "https://www.freejobalert.com/articles/icmr-nafrbr-consultant-recruitment-2025-apply-offline-for-01-posts-3025695?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://img2.freejobalert.com/freejobalert/2025/10/icmr-nafrbr-consultant-recruitment-2025-apply-offline-68e5ff0f8f12965461673-1200.webp"
      },
      "content": "Download Mobile APP Play FreeJobAlert Games JOIN WHATSAPP CHANNEL\n\n**Updated**October 8, 2025 11:59 AM08 October 2025 11:59 AM\n\nby Shoba Jenifer\n\n<span class=\"post-date\"></span>\n\nNational Animal Resource Facility for Biomedical Research (ICMR NAFRBR) has released an official notification for the recruitment of 01 Consultant Posts. Interested and eligible candidates can apply Offline through the official ICMR NAFRBR website. The last date to submit the application form is 14-10-2025. In this article, you’ll find the ICMR NAFRBR Consultant Posts recruitment details, including eligibility criteria, age limit, salary structure, selection process, application steps, and direct links to the official notification and Offline application form.\n\n## ICMR NAFRBR Consultant Recruitment 2025 Overview\n\n| Company Name | National Animal Resource Facility for Biomedical Research (ICMR NAFRBR) |\n| --- | --- |\n| Post Name | Consultant (Scientific/Technical- Non- Medical) |\n| No of Posts | 01 |\n| Pay Matrix | Rs.1,00,000/- to 1,80,000/- |\n| Qualification | M.Pharma, M.Sc, M.E/M.Tech, MVSC, M.Phil/Ph.D |\n| Age Limit | 40 to 70 years |\n| Start Date for Apply | 27-09-2025 |\n| Last Date for Apply | 14-10-2025 |\n| Official Website | icmr.gov.in |\n\n## Eligibility Criteria\n\n- Professionals having proven competency and success in conducting Quality Assurance and/or managing studies under GLP (Good Laboratory Practice) environment, with at least 10 years of postqualification experience, and should possess M.Sc./ M.V.Sc. /M. Pharm/ M. Tech qualification. - PhD will be considered as 4 years of experience (irrespective of the duration taken to complete the degree). - Master’s degree in any discipline will not be considered as any experience.\n\n## Age Limit\n\n- Minimum Age Limit:**40 Years** - Maximum Age limit:**70 Years**\n\n## Important Dates\n\n- Starting Date for Apply:**27-09-2025** - Last Date for Apply**: 14-10-2025**\n\n## Selection Process\n\n- The shortlisted candidates as per eligibility criteria will be called for interview and original documents will be verified during the course of interview. - If necessary, a written test may be conducted before calling for the interview. - In case of selecting retired government servant as consultant, only an interview will be conducted; no written test will take place. - The dates for the interview will be uploaded to the ICMRNARFBR website.\n\n## How to Apply\n\n- The last date for receipt of completed application on the prescribed proforma (Annexure I) along with requisite documents is 14.10.2025. - In case the last date falls on weekend or a holiday, then the last date of submission of the application will be shifted to the next working day (up to 5.00 PM). - The candidates must send the application in the prescribed proforma (Annexure I) duly signed on each page along with self-attested copies of all certificates/documents in support of fulfilling the essential criteria of age, educational qualifications, experiences etc. besides others in support of their candidature to the following address through Speed Post/Courier. - Sr. Administrative Officer ICMR-National Animal Resource Facility for Biomedical Research, Genome Valley, Shamirpet, Hyderabad, Telangana 500 101.\n\n## ICMR NAFRBR Consultant Important Links\n\n- **Official Notification PDF**: [Click here](https://www.icmr.gov.in/icmrobject/uploads/Recruitment/1759837359_websiteadvertisementforengagementofconsultantaticmr-narfbrhyderabad.pdf) - **Official Website:** [Click here](https://icmr.gov.in) - **Join Telegram Channel:** [Click Here](https://t.me/FreeJobAlertOfficially) - **Join WhatsApp Channel**: **Click Here** - **Download Mobile App:**[Click Here](https://play.google.com/store/apps/details?id=com.freejobalert)\n\n| Jobs In Telangana |\n| --- |\n| Adilabad | Bhadradri Kothagudem | Hyderabad |\n| Jagtial | Jangaon | Jayashankar Bhoopalpally |\n| Jogulamba Gadwal | Kamareddy | Karimnagar |\n| Khammam | Komaram Bheem Asifabad | Mahabubabad |\n| Mahabubnagar | Mahbubnagar | Mancherial |\n| Medak | Medchal | Nagarkurnool |\n| Nalgonda | Nirmal | Nizamabad |\n| Peddapalli | Rajanna Sircilla | Ranga Reddy |\n| Sangareddy | Siddipet | Suryapet |\n| Vikarabad | Wanaparthy | Warangal |\n| Yadadri Bhuvanagiri | |\n\n## Also Read\n\nSSC Delhi Police Recruitment 2025 - 700+ Constable Driver Vacancies Across India - 12TH Pass - Rs. 21700- 69100 Salary - Apply Now\n\nCanara Bank Recruitment 2025 - 3000+ Apprentices Across India - Graduate Pass Apply Now\n\nBEL Recruitment 2025 - 600+ Trainee Engineer Vacancies Across India - Rs. 30,000-40,000 Salary - Apply Now\n\n### Jobs By Education\n\n- [10TH Jobs](https://www.freejobalert.com/search-jobs/10th-pass-government-jobs/)› - [8TH Jobs](https://www.freejobalert.com/search-jobs/8th-pass-government-jobs/)› - [12TH Jobs](https://www.freejobalert.com/search-jobs/12th-pass-government-jobs/)› - [Diploma Jobs](https://www.freejobalert.com/search-jobs/diploma-government-jobs/)› - [ITI Jobs](https://www.freejobalert.com/search-jobs/iti-government-jobs/)› - [B.Tech/B.E Jobs](https://www.freejobalert.com/search-jobs/btech-be-government-jobs/)› - [B.com Jobs](https://www.freejobalert.com/search-jobs/bcom-government-jobs/)› - [Any Graduate Jobs](https://www.freejobalert.com/search-jobs/any-graduate-government-jobs/)› - [Any Post Graduate Jobs](https://www.freejobalert.com/search-jobs/any-post-graduate-government-jobs/)›\n\nNew Updates\n\n- [RRB NTPC CBT 2 Admit Card 2025](https://www.freejobalert.com/articles/rrb-ntpc-graduate-level-cbt-2-admit-card-2025-out-3025876) - [RRB NTPC 8850 Online Form 2025-26](https://www.freejobalert.com/articles/rrb-ntpc-recruitment-2025-apply-online-for-8850-station-master-clerk-and-more-posts-3024797) - [India Post IPPB GDS Online Form 2025](https://www.freejobalert.com/articles/india-post-ippb-gds-as-executive-recruitment-2025-apply-online-for-348-posts-3025843)\n\n- [SEBI Assistant Manager](https://www.freejobalert.com/articles/sebi-officer-grade-a-assistant-manager-recruitment-2025-apply-online-for-110-posts-3025779) - [Delhi DDA Recruitment 2025 Online Form Out For 1732 Post](https://www.freejobalert.com/articles/dda-group-a-b-and-c-recruitment-2025-apply-online-for-1732-mts-mali-and-more-apply-now-3023022) - [SSC Delhi Police Head Constable Online Form 2025](https://www.freejobalert.com/articles/ssc-delhi-police-head-constable-ministerial-recruitment-2025-apply-online-for-509-posts-3024854)\n\n- [Indian Army Group C Recruitment 2025](https://www.freejobalert.com/articles/indian-army-dg-eme-group-c-recruitment-2025-apply-offline-for-194-ldc-fireman-and-more-posts-3024881) - [RRB 2570 JE (Junior Engineer) Online Form 2025](https://www.freejobalert.com/articles/rrb-je-junior-engineer-recruitment-2025-apply-online-for-2570-posts-3024825) - [EMRS 7267 Teaching and Non Teaching Online Form 2025](https://www.freejobalert.com/articles/emrs-teaching-and-non-teaching-recruitment-2025-apply-offline-for-7267-tgt-accountant-and-other-posts-apply-now-3023707)\n\nView All\n\n| RRB NTPC CBT 2 Admit Card 2025 | RRB NTPC 8850 Online Form 202526 | Delhi DDA Recruitment 2025 Online Form Out For 1732 Post |\n| --- | --- | --- |\n| RRB 2570 JE (Junior Engineer) Online Form 2025 | SSC CPO 2861 SubInspector Online Form 2025 | RRB 368 Section Controller Online Form 2025 |\n| SSC Delhi Police 7565 Constable Online Form 2025 | UPSC ESE 2026 Online Form | Canara Bank 3500 Apprentice Online Form 2025 |\n\n## ICMR NAFRBR Consultant Recruitment 2025 - FAQs\n\n**1. What is the starting date to apply for ICMR NAFRBR Consultant 2025?**\n\n**Ans:** Starting Date to apply is 27-09-2025.\n\n**2. What is the last apply date for ICMR NAFRBR Consultant 2025?**\n\n**Ans:** Last apply date is 14-10-2025.\n\n**3. What is the Eligibility to apply for ICMR NAFRBR Consultant 2025?**\n\n**Ans:**M.Pharma, M.Sc, M.E/M.Tech, MVSC, M.Phil/Ph.D\n\n**4. What is the Maximum Age Limit to apply for ICMR NAFRBR Consultant 2025?**\n\n**Ans:**70 Years\n\n**5. How many vacancies are being recruited by ICMR NAFRBR Consultant 2025?**\n\n**Ans:**Total 01 Vacancies.\n\n/.entry-content\n\n### Other posts you might be interested in:\n\n1. [NIT Raipur Senior Research Fellow Recruitment 2025 – Walk in](https://www.freejobalert.com/nit-raipur-senior-research-fellow-recruitment-2025-walk-in-for-02-posts-3025982) 2. [Prasar Bharati Recruitment 2025 - Apply Offline for 26 Content Producer, Copy Writer and More Posts](https://www.freejobalert.com/prasar-bharati-recruitment-2025-apply-offline-for-26-content-producer-copy-writer-and-more-posts-3025981) 3. [ICAR NBSSLUP Laboratory Assistant Recruitment 2025 – Walk in](https://www.freejobalert.com/icar-nbsslup-laboratory-assistant-recruitment-2025-walk-in-for-01-posts-3025980) 4. [IIT Kanpur Manager Recruitment 2025 - Apply Online](https://www.freejobalert.com/iit-kanpur-manager-recruitment-2025-apply-online-for-01-posts-3025979) 5. [SCTIMST Project Associate I Recruitment 2025 – Walk in](https://www.freejobalert.com/sctimst-project-associate-i-recruitment-2025-walk-in-for-01-posts-3025978)\n\n### News Current affairs:\n\n- [10 Viral Gemini AI Titanic Photo Editing Prompts Copy Paste: Create Stunning Visuals and Epic Creations](https://www.freejobalert.com/article/10-viral-gemini-ai-titanic-photo-editing-prompts-copy-paste-20318) - [Kolkata FF Fatafat Live Result Today 09-10-2025 Live Tips: Check all Winning Numbers for Today Here](https://www.freejobalert.com/article/kolkata-ff-fatafat-live-result-today-07-10-2025-out-live-tips-check-all-winning-numbers-for-today-here-20006) - [Optical Illusion IQ Test: Are You A Genius? Within 5 Seconds Spot The Inverted 4 among 4s](https://www.freejobalert.com/article/optical-illusion-iq-test-are-you-a-genius-within-5-seconds-spot-the-inverted-4-among-4s-20317) - [Fortnite Servers Not Responding: When Will Fortnite Servers be Back Up? How Long is Fortnite Downtime Today?](https://www.freejobalert.com/article/fortnite-servers-not-responding-when-will-fortnite-servers-be-back-up-how-long-is-fortnite-downtime-today-20315) - [Are Minecraft Authentication Servers Down? Latest Outage Updates](https://www.freejobalert.com/article/are-minecraft-authentication-servers-down-20316)\n\n/.inside-article",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "<i> Regenerative Medicine Research </i> : an open access translational medicine journal",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC4376332?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "I am, as an Editor-in-Chief joining BioMed Central, so excited to announce the launch of a new biomedical journal, *Regenerative Medicine Research*. In this open access, online journal, we aim to publish research relating to both the fundamental and practical aspects of regenerative medicine, with a particular emphasis on translational research.\n\nRegenerative medicine is an emerging field with the potential to empower medical research and practice. The process of tissue regeneration is essential to many organisms for a healthy life, from the highly studied axolotl, to us as human beings. In many ways regenerative medicine has become the leading edge of biomedical research and clinical practice, due to its key implications for the treatment of increasingly prevalent diseases, such as heart disease.\n\nThe field is in the infant stage of its development but it is growing at an impressively fast pace. For instance, based on a PubMed search, there were less than 200 articles relating to regenerative medicine published in 2002, but more than 3,000 articles published in 2012. However, comprehensive information or research data on regenerative medicine cannot presently be efficiently gathered, but can only be scrutinized through a diversity of different journals in various fields. Regenerative medicine is, by current definition, the process of creating living, functional tissues to repair or replace tissue or organ function lost due to age, disease, damage, or congenital defects [1]. Obviously, this requires a multidisciplinary approach, and one that looks beyond tissue engineering and stem cells. This need calls for a comprehensive journal and therefore, the launch of *Regenerative Medicine Research* takes place.\n\nWe hope to publish articles that shed light on the signalling pathways involved in cell/tissue regeneration, as well as those that address how biomaterials and stem cells can be adapted or integrated into the failing organ system. Two of the first articles published in the journal today focus on the effects of chronic alcohol consumption on tissue repair and regeneration; Dekeyser *et al.*[2] study the effect on skeletal muscle and Borrisser-Pairó *et al.*[3] look at levels of IGF-1 myocardial expression. In addition, Coletti *et al*. [4] provide a comprehensive review comparing the cellular mechanisms of skin, nerve and muscle regeneration.\n\nAs an open access journal, articles accepted for publication in *Regenerative Medicine Research* are made rapidly available online following acceptance**.** This ensures efficient dissemination of information and experimental data to scientific communities and the medical practice field. Furthermore, a highly respected Editorial Board composed of internationally well-recognized experts in the field facilitates a fair, timely and rigorous peer review process.\n\nThe Editorial Board, Publisher, and myself assure the authors and readers that we are committed to making *Regenerative Medicine Research* a preeminent platform for exchanging research protocols and experimental data in this exciting, emerging field. We look forward to receiving your high quality contributions to the journal.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "HCPLive - Clinical news for connected physicians",
      "url": "https://www.hcplive.com?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/hcplive/d178be215faf12308f78c63a16b889e5f2fb2374-1200x630.png?w=600&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/hcplive/89bca0cdfed2636e141e7f9a63839e2449ece8f9-1200x630.png?w=200&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/hcplive/c19f9b84461ae7978f62fb84d1c8791e249bcfc7-400x400.jpg?w=200&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/hcplive/6c12ba6dc0f49868fcf8805c7726fd4e41d87f1e-1200x630.png?w=200&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/hcplive/c7e9e707c5b9d3526d2f7c3a68af087e7a654886-1200x630.png?w=240&fit=crop&auto=format"
      },
      "content": "## Conference Coverage\n\nabout 11 hours ago\n\nhfsa\n\nabout 17 hours ago\n\ners\n\n2 days ago\n\n3 days ago\n\n6 days ago\n\neadv\n\n8 days ago\n\n9 days ago\n\n10 days ago\n\n## Trending on HCPLive\n\n### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\n### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\n### Nerandomilast Nets First New FDA Approval for Idiopathic Pulmonary Fibrosis in Over 10 Years\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\n### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\n# Latest News\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\n#### Q3 2025 Recap: Endocrinology News and Updates\n\n#### Nerandomilast Nets First New FDA Approval for Idiopathic Pulmonary Fibrosis in Over 10 Years\n\n#### Subcutaneous Methotrexate Enhances Efficacy for Psoriasis, Raises Adverse Effect Risk\n\n#### LUCENT-3: Mirikizumab (Omvoh) Shows Sustained Benefit in Ulcerative Colitis Through 4 Years\n\n##### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\n##### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\n##### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\n##### Navigating Access Barriers and Treatment Gaps in HFpEF Care\n\n##### Challenges With Combining Nonsteroidal MRAs and Treatment Adherence in HFpEF\n\n##### Strategies for Prevention of HFpEF\n\n##### MRA Combination Therapies and Monitoring in HFpEF\n\n##### Sequencing Therapies in HFpEF Care\n\n## Shorts\n\n## Podcasts\n\n### Diabetes Dialogue: What's New at Medtronic Diabetes, With Bob Vigersky, MD\n\nThis episode highlights the recent technological advancements made by Medtronic Diabetes in treating type 1 and 2 diabetes.\n\n### Exploring the Role of IL-13 Inhibition in AD: Clinical Perspectives & Practical Applications\n\nA pair of leading subject matter experts discuss the current landscape of atopic dermatitis, including unmet needs, and the role of IL-13 inhibition in the management.\n\n### Kidney Compass: The Future of Cardiovascular-Kidney-Metabolic Trial Design\n\nNeuen is joined by Richard Pratley, MD, and Muthiah Vaduganathan, MD, MPH, to discuss the evolving landscape of CKM trial design.\n\n### Don't Miss a Beat: Debating Oral Diuretic Intensification as an Endpoint in Heart Failure Trials\n\nExplore the evolving landscape of heart failure endpoints, focusing on the significance of oral diuretic intensification in outpatient care.\n\n### Diabetes Dialogue: Results of ATTAIN-1 and STEP UP Phase 3 Trials\n\nThis episode highlights the results of the ATTAIN-1 and STEP UP clinical trials, examining the potential of their respective GLP-1 RA subjects.\n\n### Liver Lineup: Innovations in Cholestatic Disease Management, With Kris Kowdley, MD\n\nKowdley joins Liver Lineup to discuss evolving approaches in cholestatic liver disease and recent progress in PBC.\n\n### Diabetes Dialogue: Milestones for MiniMed 780G and Signos CGM for Weight Loss\n\nExplore the latest advancements in diabetes technology, including FDA-approved insulin pumps and innovative CGMs for weight management.\n\n### Diabetes Dialogue: Semaglutide & Tirzepatide Updates at ESC Congress 2025\n\nHosts explore the latest findings on GLP-1 medications, semaglutide and tirzepatide, from ESC Congress 2025.\n\n### Don't Miss a Beat: Vericiguat in Heart Failure and the VICTOR Trial, With Javed Butler, MD\n\nCohosts Stephen Greene, MD, and Muthiah Vaduganathan, MD, MPH, sit down with Javed Butler, MD, to discuss the results of this major trial.\n\n### Burst CME: Managing Fluid Overload in Patients With Chronic Kidney Disease\n\n## Videos\n\n##### Selecting MRAs in HFpEF in Patients With Comorbidities\n\n##### Finerenone Benefits and Anticipated Guideline Updates for HFpEF\n\n##### FINEARTS-HF Trial and Finerenone Approval in HFpEF\n\n##### Aldosterone Antagonist for Treatment of HFpEF\n\n##### Nonsteroidal vs Steroidal MRAs in HFpEF\n\n##### Evolving Guideline-Directed Medical Therapy Standards in HFpEF\n\n##### Quality of Life and Hospitalization Burden in HFpEF\n\n##### Early Identification Strategies in HFpEF\n\n## Continuing Medical Education\n\n## Patient, Provider & Caregiver Connection™: Understanding the Patient Journey to Provide Personalized Care for Generalized Pustular Psoriasis\n\nTina Bhutani, MD, MAS, FAAD; Jason E. Hawkes MD, MS\n\n## SimulatED™: Understanding the Role of Genetic Testing in Patient Selection for Anti-Amyloid Therapy\n\nNicholas Doher, DO; Babak Tousi, MD\n\n## Cases and Conversations™: Applying Best Practices to Prevent Shingles in Your Practice\n\nPaul G. Auwaerter, MD, MBA; Paul P. Doghramji, MD, FAAFP; Aruna Subramanian, MD\n\n## Clinical Consultations™: Addressing Elevated Phosphate Levels in Patients with END-STAGE Kidney Disease (ESKD)\n\nAnil K. Agarwal, MD, FACP, FASN, FNKF, FASDIN; Jay B. Wish, MD\n\n## Advances In: Managing Hyperphosphatemia in Chronic Kidney Disease – Bridging Treatment Gaps With Novel Therapies\n\nGlenn M. Chertow, MD, MPH; Anjay Rastogi, MD, PhD\n\n## Burst CME™: Addressing Inadequate Response to Anti-TNF Therapy in Patients With Rheumatoid Arthritis\n\nJeffrey A. Sparks, MD, MMSc\n\n## Community Practice Connections™: Cases and Conversations – Keeping Up with Novel Approaches to Managing ANCA-Associated Vasculitis\n\nFrank B. Cortazar, MD; Lindsay S. Lally, MD\n\n## Burst CME: Targeted Therapy for Optimal Psoriasis Management\n\nTina Bhutani, MD\n\n## Cases and Conversations™: A Horizon View of Continuous Monitoring Systems for Diabetes Management\n\nDiana Isaacs, PharmD, BCPS, BC-ADM, BCACP, CDCES, FADCES, FCCP; Anders Carlson, MD; Jennifer B. Green, MD\n\n## Progress in Hyperlipidemia Management to Reduce ASCVD Risk: An Illustrated Update\n\nNihar R. Desai, MD, MPH; Martha Gulati, MD, MS, FACC, FAHA, MASPC, FESC, FSCCT (hon), FRCP Edin\n\n## All News\n\n### Q3 2025 Recap: Cardiology News and Updates\n\nThe Q3 recap for cardiology spotlights major FDA decisions, new heart failure and hypertension guidelines, and top trial results and research.\n\n### Sugar-, Artificially-Sweetened Beverages Both Linked to Increased MASLD Risk\n\nHigh intake of both sugar-sweetened beverages and low- or non-sugar-sweetened beverages was linked to greater MASLD risk.\n\n### ERS 2025 Insights: Dupilumab’s Impact on Severe COPD Exacerbations, with Surya Bhatt, MD\n\nBhatt discussed the latest data from a post-hoc analysis of the BOREAS and NOTUS trials.\n\n### Bax24: Baxdrostat Achieves Primary Endpoint in Treatment-Resistant Hypertension\n\nThe investigative therapy for treatment-resistant hypertension resulted in a substantial reduction in ambulatory 24-hour average systolic blood pressure versus placebo.\n\n### Secukinumab Shows Superior Psychological Outcomes to Ixekizumab in Psoriasis\n\nThese data highlight secukinumab’s potential as a treatment to provide enhanced psychological outcomes among those with psoriasis.\n\n### 7 Endocrinology Headlines You Missed in September 2025\n\nCatch up on FDA decisions, critical trial results, and expert perspectives on endocrinology.\n\n### INO-3107 Immunotherapy Shows Benefit in Recurrent Respiratory Papillomatosis\n\nINO-3107 immunotherapy significantly reduces surgeries for recurrent respiratory papillomatosis.\n\n### Topical Bimiralisib Shows 92% Clearance Rate for Patients with Actinic Keratosis\n\nThese new, phase 2 findings on the use of topical bimiralisib suggest positive results among patients with actinic keratosis.\n\n### Q3 2025 Recap: Gastroenterology News and Updates\n\nThe Q3 recap for gastroenterology spotlights key FDA decisions, new AGA gastroparesis guidelines, and other top GI news and research.\n\n### 7 Cardiology Headlines You Missed in September 2025\n\nRead about groundbreaking FDA decisions, exciting new heart failure research, and more.\n\n### Real-World Findings on Incidence of Adverse Events Highlighted for JAK Inhibitors\n\nThis review explores the safety of oral JAK inhibitors in inflammatory skin conditions, with 43 real-world studies being highlighted.\n\n### FDA Approves Roflumilast (Zoryve) Cream 0.05% for Atopic Dermatitis in Children Aged 2-5 Years",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Optimizing Myelofibrosis Therapy: A Comprehensive Comparison of JAK Inhibitor Clinical Trials From Design to Outcomes | Targeted Oncology - Immunotherapy, Biomarkers, and Cancer Pathways",
      "url": "https://www.targetedonc.com/view/optimizing-myelofibrosis-therapy-a-comprehensive-comparison-of-jak-inhibitor-clinical-trials-from-design-to-outcomes?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/c9e7dcb5efcbd1e7d0b26389f293e959b5e3a390-1920x1080.png",
        "1": "https://www.targetedonc.com/scout_light.png",
        "2": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/c9e7dcb5efcbd1e7d0b26389f293e959b5e3a390-1920x1080.png?w=240&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/9674ba40029ed300b868fe0d1554b93d1c883dc6-1920x1080.png?w=240&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/targetedonc/59ae3f8fba6259d65bdc36621f9a96e8e6b09e85-1280x720.png?w=350&fit=crop&auto=format"
      },
      "content": "Your AI-Trained Oncology Knowledge Connection!\n\n# Optimizing Myelofibrosis Therapy: A Comprehensive Comparison of JAK Inhibitor Clinical Trials From Design to Outcomes\n\nPanelists discuss how Janus kinase (JAK) inhibitor dosing strategies must be carefully tailored for anemic myelofibrosis patients, with clinical experience suggesting starting at lower doses (10 mg twice daily ) and gradually escalating based on the REALIZE trial approach, while balancing efficacy goals against cytopenia risks and monitoring unique toxicity profiles of different JAK inhibitors including Wernicke encephalopathy with fedratinib and gastrointestinal issues with pacritinib.\n\n## Episodes in this series\n\n##### EP. 1 Advancing Treatment Paradigms in Myeloproliferative Neoplasms: From Molecular Pathogenesis to Patient-Tailored Therapy\n\n##### EP. 2 Personalized JAK Inhibitor Selection in Myelofibrosis: Clinical Characteristics, Molecular Profiles, and Treatment Sequencing\n\n##### EP. 3 Myelofibrosis Management: Clinical Approaches and Treatment Algorithms With Case-Based Application\n\n##### EP. 4 COMFORT Trials: Applying Evidence to Intermediate-Risk Myelofibrosis\n\n##### EP. 5 Optimizing Myelofibrosis Therapy: A Comprehensive Comparison of JAK Inhibitor Clinical Trials From Design to Outcomes\n\n##### EP. 6 Clinical Decision-Making With PERSIST-2: Optimizing Therapy for Anemic Myelofibrosis Patients With Splenomegaly\n\n##### EP. 7 Strategic JAK Inhibitor Sequencing: Translating SIMPLIFY I/II Outcomes to Optimize Myelofibrosis Management\n\n##### EP. 8 MOMENTUM Trial Outcomes: Guiding Therapy for Myelofibrosis With Anemia and Splenomegaly\n\n##### EP. 9 Current Evidence and Clinical Algorithms for Targeted Management of Polycythemia Vera: Applying Trial Insights to Patient Care\n\n##### EP. 10 Case-Based Discussion: Management Strategies for Hydroxyurea-Resistant Polycythemia Vera\n\n##### EP. 11 Comparative Analysis of Major Polycythemia Vera Clinical Trials: PROUD-PV, MAJIC-PV, RESPONSE, and CYTO-PV\n\n##### EP. 12 CYTO-PV Trial Insights: Optimizing Hematocrit Targets and Thrombosis Prevention in Polycythemia Vera\n\n##### EP. 13 RESPONSE Trial Findings: Managing Polycythemia Vera in Hydroxyurea-Inadequate Responders\n\n##### EP. 14 MAJIC-PV Trial Outcomes: Guiding Treatment Decisions for Hydroxyurea-Resistant Polycythemia Vera\n\n##### EP. 15 Clinical Impact of PROUD-PV/CONTINUATION-PV Trials on Polycythemia Vera Treatment Decision-Making\n\n##### EP. 16 Evolving Management Strategies for Phlebotomy-Dependent Polycythemia Vera: The Path Forward\n\n##### EP. 17 JAK Inhibitor Selection Strategy: Risk-Guided Approach and Treatment Goals for Splenomegaly and Anemia\n\n##### EP. 18 Applying COMFORT Trial Data: Spleen Response and Survival Benefit Interpretation in Intermediate-1 Risk Patients\n\n##### EP. 19 Patient-Tailored JAK Inhibitor Selection: Evaluating Ruxolitinib, Fedratinib, Pacritinib, and Momelotinib in Intermediate-Risk Disease\n\n##### EP. 20 Response Assessment: Monitoring Parameters and Molecular Testing Integration\n\n##### EP. 21 Management Strategies for Hydroxyurea-Resistant PV: Treatment Optimization and Evidence-Based Second-Line Selection\n\n##### EP. 22 Interferon Therapy Evolution: Clinical Applications and Paradigm Shifts in Polycythemia Vera Management\n\n##### EP. 23 Emerging Treatment Paradigms: Rusfertide’s VERIFY Trial and Molecular Response-Guided Therapy in Advanced PV\n\n##### EP. 24 The Evolving MPN Landscape: Future Therapeutic Directions and Addressing Unmet Needs in Myelofibrosis and Polycythemia Vera\n\nSummary of JAK Inhibitor Clinical Trials and Dosing Strategies in Myelofibrosis\n\nKey Clinical Trials\n\n- REALIZE: Phase 2 study of ruxolitinib in myelofibrosis patients with anemia (hemoglobin [Hb] <10 g/dL)Evaluated lower starting dose (10 mg twice daily) with delayed dose escalation after 12-plus weeksDemonstrated spleen length reduction without increasing transfusion requirements\n\n- Evaluated lower starting dose (10 mg twice daily) with delayed dose escalation after 12-plus weeks\n\n- Demonstrated spleen length reduction without increasing transfusion requirements\n\n- JAKARTA: Phase 3 study of fedratinib vs placebo in higher-risk myelofibrosisSimilar design to COMFORT trialsInvestigated 2 different fedratinib doses\n\n- Similar design to COMFORT trials\n\n- Investigated 2 different fedratinib doses\n\n- FREEDOM-2: Study of fedratinib vs best available therapy in previously treated high-risk myelofibrosis\n\n- PERSIST-2: Three-arm study of pacritinib (400 mg daily vs 200 mg twice daily) vs best available therapyUnique inclusion of patients with platelets <100,000/μLApproximately 50% had prior JAK inhibitor exposureDemonstrated improvement in transfusion burden\n\n- Unique inclusion of patients with platelets <100,000/μL\n\n- Approximately 50% had prior JAK inhibitor exposure\n\n- Demonstrated improvement in transfusion burden\n\n- SIMPLIFY-1: Frontline study of momelotinib vs ruxolitinib\n\n- SIMPLIFY-2: Momelotinib vs best available therapy (89% ruxolitinib) in previously treated patients\n\n- MOMENTUM: Study in myelofibrosis patients with spleen symptoms and anemia (Hb <10 g/dL)Primary end point was symptom-drivenLed to momelotinib approvalShowed improved transfusion burden\n\n- Primary end point was symptom-driven\n\n- Led to momelotinib approval\n\n- Showed improved transfusion burden\n\nSafety Considerations\n\n- Cytopenias: Potential issue with all JAK inhibitors\n\n- Fedratinib: Wernicke’s encephalopathy risk; thiamine supplementation used in FREEDOM-2\n\n- Pacritinib/fedratinib: Gastrointestinal toxicities (likely related to FLT3 inhibition)\n\n- Momelotinib: Some Gastrointestinal toxicity (nausea, diarrhea), dizziness; peripheral neuropathy less prominent in later trials\n\nRuxolitinib Dosing Strategies for Anemic Patients\n\nExpert Approaches:\n\n- Starting at reduced dose (10 mg twice daily) for patients with Hb <10 g/dL\n\n- Similar approach for patients with platelets 50,000-100,000/μL\n\n- Varying philosophies on dose escalation:Some practitioners rarely escalate beyond 10 mg twice dailyOthers aim to escalate to 20 mg twice daily for optimal outcomes when tolerated\n\n- Some practitioners rarely escalate beyond 10 mg twice daily\n\n- Others aim to escalate to 20 mg twice daily for optimal outcomes when tolerated\n\n- Dose escalation typically considered after 12 to 16 weeks\n\n- REALIZE approach demonstrates that lower starting doses with delayed escalation can maintain efficacy without worsening transfusion requirements\n\nThe panel emphasized that individualized dosing strategies based on baseline cytopenias are essential for optimizing outcomes while minimizing toxicity in myelofibrosis patients.\n\n### Newsletter\n\nStay up to date on practice-changing data in community practice.\n\n## Related Content\n\n### Explaining Rationale to Patients and Addressing Real-World Barriers\n\n### Safety Considerations and Selecting Patients for Maintenance\n\n### Treatment of Early Stage Squamous Cell Carcinoma of the Esophagus\n\n### Design and Clinical Outcomes From the IMFORTE Trial\n\n### Case Presentation and Overview of IMpower133 in ES-SCLC\n\n## Latest CME\n\n## Examining the Role of ctDNA in the Management of Breast Cancer: Latest Evidence and Future Directions\n\nOctober 15, 2025\n\n## Antibody–Drug Conjugates in Oncology: The Essentials of AE Management for Better Patient Outcomes\n\nOctober 26, 2025\n\n## 23rd Annual School of Breast Oncology\n\nNovember 6-8, 2025\n\n## Community Practice Connections™: Navigating Early-Stage HR+/HER2‒- Breast Cancer – Clinical Developments and Innovative Treatments\n\nNeil M. Iyengar, MD; Komal Jhaveri, MD, FACP\n\n## Breast Cancer Symposia in San Antonio\n\nDecember 8-11, 2025\n\n## Community Practice Connections™: Community Oncologists’ Role in Selecting Optimal Oral SERD Treatment for HR+/HER2- Breast Cancer\n\nVirginia Kaklamani, MD, DSc; William J Gradishar, MD, FASCO, FACP\n\n## Community Practice Connections™: Case Discussions in TNBC… Navigating the Latest Advances and Impact of Disparities in Care\n\nTiffany A. Traina, MD, FASCO; Demetria Smith-Graziani, MD, MPH\n\n## Medical Crossfire®: Improving Survival in HR-Positive HER2-Negative Metastatic Breast Cancer – Advances in Selective Estrogen Receptor Targeting Therapies\n\nAditya Bardia, MD, MPH; Heather McArthur, MD, MPH; Sonya Reid, MD, MPH\n\n## Inaugural Brain & Spine Metastases Conference: Evolving Practice and Emerging Therapies\n\nJanuary 22, 2026\n\n## 2nd Annual Hawaii Cancer Conference\n\nJanuary 24-25, 2026\n\n## 42nd Annual CFS: Chemotherapy Foundation Symposium®: Innovative Cancer Therapy for Tomorrow\n\nBenjamin P. Levy, MD; John O. Mascarenhas, MD; Tiffany A. Traina, MD, FASCO; Cathy Eng, MD, FACP, FASCO; John P. Leonard, MD\n\n## The Inaugural Hawaii Breast Cancer: A Multidisciplinary Case-Based Conference\n\nHope S. Rugo, MD, FASCO; Naoto T. Ueno, MD, PhD\n\n## 43rd Annual Miami Breast Cancer Conference®\n\nMarch 5-8, 2026\n\n## Medical Crossfire®: Translating Evidence to Clinical Practice in Early-Stage HR+, HER2– Breast Cancer\n\nJoyce O’Shaughnessy, MD; William J. Gradishar, MD, FASCO, FACP; Heather McArthur, MD, MPH\n\n## Updates and Innovations in Nonopioid Pain Management Strategies for Breast Cancer Patients Postsurgical Intervention\n\nPatrick I. Borgen, MD; Joshua Feinberg, MD; Gary Schwartz, MD, FASA\n\n## Shaping Surgical Pathways: Revolutionizing Breast Cancer Care With Genetic Testing and Targeted Treatment\n\nPatrick I. Borgen, MD; E. Shelley Hwang, MD, MPH; Mark E. Robson, MD\n\n## Community Practice Connections™: Navigating the Impact of HER2, HER3 and TROP2 from Early Stage to Advanced Breast Cancer Care\n\nHope S. Rugo, MD, FASCO; Sara Hurvitz, MD, FACP; Jennifer Litton, MD, MHCM; Heather McArthur, MD, MPH\n\n## Community Practice Connections™: Exploring Emerging Next-Generation Endocrine Therapies in ER+/HER2- Breast Cancer – Evaluating the Potential of Future of Treatment\n\nHeather McArthur, MD, MPH; Komal Jhaveri, MD, FACP; Sara Tolaney, MD, MPH; Seth A. Wander, MD, PhD\n\n## Innovations in HR+/HER2– Metastatic Breast Cancer: Advancing Care Through PROTAC ER Degradation\n\nRita Nanda, MD; William Gradishar, MD, FASCO, FACP; Komal Jhaveri, MD, FACP; Kevin Kalinsky, MD, MS\n\n## Community Practice Connections™: Optimizing Treatment Outcomes and Preserving Fertility in Premenopausal HR+ Breast Cancer\n\nRebecca Shatsky, MD; Kelly McCann, MD, PhD; Michelle L. Taylor, ANP-BC\n\n## Community Practice Connections™: Translating Evidence to Clinical Practice in Early-Stage HR+, HER2- Breast Cancer\n\nJoyce O’Shaughnessy, MD; William Gradishar, MD, FASCO, FACP; Heather McArthur, MD, MPH; Eleni Anastasia Tousimis, MD, MBA, FACS\n\n## Clinical Case Vignette Series™: 42nd Annual Miami Breast Cancer Conference®\n\nReshma Jagsi, MD, DPhil; Kevin Kalinsky, MD, MS; Hope S. Rugo, MD, FASCO; Alastair Thompson, MD, MBChB, BSc (Hons), FRCS (Ed), FACS\n\n## Medical Crossfire®: Integrating Next-Generation Endocrine Targeting Therapies to Improve Outcomes for Patients With HR+/HER2- Breast Cancer\n\nWilliam J. Gradishar, MD, FASCO, FACP; Laura Huppert, MD; Yuan Yuan, MD, PhD\n\n## Breast Cancer Tumor Board®: Advancing Care in Metastatic Breast Cancer - The Evolving Role of Antibody-Drug Conjugates\n\nAditya Bardia, MD, MPH, FASCO; Joyce O’Shaughnessy, MD; Hope S. Rugo, MD; Paolo Tarantino, MD\n\n## 25th Annual International Congress on the Future of Breast Cancer® East\n\nJuly 10-11, 2026\n\n## 25th Annual International Congress on the Future of Breast Cancer® West\n\nJuly 17-18, 2026\n\n## Breast Cancer Tumor Board: Targeting TROP2 – Innovations in Triple-Negative Breast Cancer Treatment\n\nJoyce O’Shaughnessy, MD; Matthew P. Goetz, MD; Hope S. Rugo, MD, FASCO\n\n## Expert Guidance on Frequently Asked Questions Regarding the Use of ADCs in TNBC\n\nAditya Bardia, MD, MPH, FASCO; Erika P. Hamilton, MD; Virginia Kaklamani, MD, DSc\n\n## Breaking Down the Rationale for Targeting TROP2 in TNBC\n\nFilipa Lynce, MD; Rita Nanda, MD\n\n## Evaluating the Latest Data and Ongoing Trials for Novel ADC Approaches in TNBC\n\nAditya Bardia, MD, MPH, FASCO; Erika P. Hamilton, MD\n\n## Dissecting Clinical Trial and Real-World Data for ADCs in TNBC\n\n## Establishing the Rationale for ADC and ICI Combinations in TNBC\n\nVirginia Kaklamani, MD, DSc; Tiffany A. Traina, MD, FASCO\n\n## 24th Annual International Congress on the Future of Breast Cancer® East\n\nJoyce O’Shaughnessy, MD\n\n## PER Resource Center: Integrating Novel Approaches in TNBC – New Avenues for TROP2-Targeting ADCs and Beyond – Nursing\n\nAditya Bardia, MD, MPH, FASCO; Erika P. Hamilton, MD; Virginia Kaklamani, MD, DSc; Filipa Lynce, MD; Rita Nanda, MD; Tiffany A. Traina, MD, FASCO\n\n## Expert Roundtable and Panel Discussions: Current and Future Landscape of TNBC\n\nAditya Bardia, MD, MPH, FASCO; Erika P. Hamilton, MD; Tiffany A. Traina, MD, FASCO\n\n## Show Me the Data®: New and Emerging Roles for Oral SERD Therapy in the Treatment of ER+/HER2– Breast Cancer\n\nAna C. Garrido-Castro, MD; Pedram Razavi, MD, PhD\n\n## School of Breast Oncology® (SOBO) Slide & Lecture Library\n\n## Trending on Targeted Oncology - Immunotherapy, Biomarkers, and Cancer Pathways\n\n### Low-Dose Nivolumab Offers Novel Strategy for Hodgkin Lymphoma Treatment\n\n### FDA Approves Cemiplimab for Adjuvant Cutaneous Squamous Cell Carcinoma\n\n### Oncologists Discuss Optimizing the Use of Elacestrant in Breast Cancer\n\n### FDA Issues CRL to NDA for Dasynoc in CML and ALL\n\n### NBXTR3 Plus Radio/ICI Shows Promising Results in Melanoma Trial\n\n- About Us\n\n- Advertise\n\n- Contact Us\n\n- CureToday.com\n\n- CancerNetwork.com\n\n- OncLive.com\n\n- OncNursingNews.com\n\n- Do Not Sell My Information\n\n- Privacy\n\n- Terms & Conditions\n\n- Editorial Board\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "News | HCPLive",
      "url": "https://www.hcplive.com/news?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/hcplive/c7e9e707c5b9d3526d2f7c3a68af087e7a654886-1200x630.png?w=350&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/hcplive/d178be215faf12308f78c63a16b889e5f2fb2374-1200x630.png?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/hcplive/faf8b964496800cc0a06cefb32000032e405c015-1200x628.png?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/hcplive/82686d2b2c4a8b38dea6206efd2ee52e4166908f-1200x630.png?w=350&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/hcplive/89bca0cdfed2636e141e7f9a63839e2449ece8f9-1200x630.png?w=350&fit=crop&auto=format"
      },
      "content": "# News\n\n### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\nA prespecified secondary analysis revealed no difference in male and female patients’ responses to tirzepatide in obesity-related HFpEF.\n\n### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\nPeters emphasized how the new findings reinforce treatment strategies for chronic rhinosinusitis with nasal polyps.\n\n### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\nRadhakrishnan breaks down the recent KDIGO IgAN guidelines and describes the evolving therapeutic landscape of IgA nephropathy.\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\nThe Q3 recap for ophthalmology spotlights major FDA decisions and major clinical trial updates in a variety of diseases.\n\n### Significance of Roflumilast Approval for Atopic Dermatitis in Children, With Lawrence Eichenfield, MD\n\nThis interview follows the FDA’s recent approval of Arcutis's roflumilast (Zoryve) cream 0.05% for patients aged 2-5 years with atopic dermatitis.\n\n### Switching to Donidalorsen for HAE, With William Lumry, MD\n\nDonidalorsen demonstrates strong efficacy in patients switching from other HAE prophylactic treatments. Lumry discusses pivotal data after FDA approval.\n\n### Q3 2025 Recap: Endocrinology News and Updates\n\nThe Q3 recap for endocrinology spotlights major FDA decisions, new guidelines for managing diabetes during pregnancy, and major clinical trial updates.\n\n### Nerandomilast Nets First New FDA Approval for Idiopathic Pulmonary Fibrosis in Over 10 Years\n\nThe new therapy, marketed as Jascayd, previously demonstrated safety and efficacy in the phase 3 FIBRONEER-IPF trial.\n\n### Subcutaneous Methotrexate Enhances Efficacy for Psoriasis, Raises Adverse Effect Risk\n\nIn this analysis, investigators highlight the impact of the route of MTX administration on drug survival among patients with psoriasis.\n\n### FDA’s Approval of Donidalorsen for HAE, With William Lumry, MD\n\nLumry discuses donidalorsen, the first FDA-approved, RNA-targeted therapy for hereditary angioedema.\n\n### LUCENT-3: Mirikizumab (Omvoh) Shows Sustained Benefit in Ulcerative Colitis Through 4 Years\n\nLUCENT-3 open-label extension study data establish mirikizumab-mrkz (Omvoh) as the first and only IL-23p19 to show sustained long-term outcomes in UC through 4 years.\n\n### Q3 2025 Recap: Cardiology News and Updates\n\nThe Q3 recap for cardiology spotlights major FDA decisions, new heart failure and hypertension guidelines, and top trial results and research.\n\n### Sugar-, Artificially-Sweetened Beverages Both Linked to Increased MASLD Risk\n\nHigh intake of both sugar-sweetened beverages and low- or non-sugar-sweetened beverages was linked to greater MASLD risk.\n\n### ERS 2025 Insights: Dupilumab’s Impact on Severe COPD Exacerbations, with Surya Bhatt, MD\n\nBhatt discussed the latest data from a post-hoc analysis of the BOREAS and NOTUS trials.\n\n### Bax24: Baxdrostat Achieves Primary Endpoint in Treatment-Resistant Hypertension\n\nThe investigative therapy for treatment-resistant hypertension resulted in a substantial reduction in ambulatory 24-hour average systolic blood pressure versus placebo.\n\n### Secukinumab Shows Superior Psychological Outcomes to Ixekizumab in Psoriasis\n\nThese data highlight secukinumab’s potential as a treatment to provide enhanced psychological outcomes among those with psoriasis.\n\n### 7 Endocrinology Headlines You Missed in September 2025\n\nCatch up on FDA decisions, critical trial results, and expert perspectives on endocrinology.\n\n### INO-3107 Immunotherapy Shows Benefit in Recurrent Respiratory Papillomatosis\n\nINO-3107 immunotherapy significantly reduces surgeries for recurrent respiratory papillomatosis.\n\n### Topical Bimiralisib Shows 92% Clearance Rate for Patients with Actinic Keratosis\n\nThese new, phase 2 findings on the use of topical bimiralisib suggest positive results among patients with actinic keratosis.\n\n### Q3 2025 Recap: Gastroenterology News and Updates\n\nThe Q3 recap for gastroenterology spotlights key FDA decisions, new AGA gastroparesis guidelines, and other top GI news and research.\n\n### 7 Cardiology Headlines You Missed in September 2025\n\nRead about groundbreaking FDA decisions, exciting new heart failure research, and more.\n\n### Real-World Findings on Incidence of Adverse Events Highlighted for JAK Inhibitors\n\nThis review explores the safety of oral JAK inhibitors in inflammatory skin conditions, with 43 real-world studies being highlighted.\n\n### FDA Approves Roflumilast (Zoryve) Cream 0.05% for Atopic Dermatitis in Children Aged 2-5 Years\n\nThe approval is supported by data from the INTEGUMENT-PED phase 3 trial, the INTEGUMENT-OLE long-term extension study, and a phase 1 pharmacokinetic study.\n\n### Q3 2025 Recap: Hepatology News and Updates\n\nThe Q3 recap for hepatology spotlights key FDA news, the withdrawal of OCA for PBC, and notable hepatic research from the past few months.\n\n### HCPLive 5 Stories in Under 5: Week of 09/28\n\nAn audio recap of the top 5 stories in healthcare news from the week of 9/28-10/04.\n\n### Adolescent Patients with Type 1 Diabetes Experience Extreme Stress\n\nLifelong reliance on insulin, constant glucose monitoring, and management of hypo- and hyperglycemia require substantial lifestyle changes.\n\n### Tildrakizumab Effective in Real-World Settings for Psoriasis Over 76 Weeks\n\nThis study highlighted tildrakizumab’s use in daily practice within a heterogeneous cohort of patients with psoriasis commonly affected by comorbid conditions.\n\n### I Tried to End My Life 3 Times: Today, I Help Others Fight for Theirs\n\nTherapist Diana Guzman, LMHC, writes about attempting suicide despite counseling patients battling with suicidal ideation.\n\n### The HCPFive: Top News for Healthcare Providers from the Week of 09/28\n\nStay updated with the latest healthcare breakthroughs, including FDA news, regulatory submissions, and evolocumab data for ASCVD, in this week's essential news roundup.\n\n### 99% of Heart Attacks, Strokes, Heart Failures Have Cardiovascular Risk Factors Beforehand\n\nRecent research refutes the conception that most, if not all, coronary heart disease occurs without typical CVD risk factors.\n\n## Trending on HCPLive\n\n### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\n### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\n### Nerandomilast Nets First New FDA Approval for Idiopathic Pulmonary Fibrosis in Over 10 Years\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\n### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\n- About Us\n\n- Advertise\n\n- Editorial\n\n- Contact Us\n\n- Do Not Sell My Information\n\n- Privacy\n\n- Terms & Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "FDA Quietly Removes Draft Guidance on Diversity in Clinical Trials Following Executive Order on DEI | AJMC",
      "url": "https://www.ajmc.com/view/fda-quietly-removes-draft-guidance-on-diversity-in-clinical-trials-following-executive-order-on-dei?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/ajmc/29f50a50749d5b42870bfbf652a620b3fce97dcb-1200x738.jpg",
        "1": "https://cdn.sanity.io/images/0vv8moc6/ajmc/ad91e4f6d145d265319ff3e11ec27d172b80ff2b-2299x1425.png?w=350&fit=crop&auto=format",
        "2": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/4pmsxtz04gdm-PTCE_AMCP-Nexus-2024_Satellite-Symposium_Food-Allergy_093024v3_800x385.png",
        "3": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/6mf8nlc4o83o-PTCE_AMCP-Nexus-2024_Satellite-Symposium_AMD-DME_093024v3_800x385.png",
        "4": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/9m82cqkg98mf-PTCE_Schizophrenia_Webinar_092724v1_800x385.png"
      },
      "content": "# FDA Quietly Removes Draft Guidance on Diversity in Clinical Trials Following Executive Order on DEI\n\n### Key Takeaways\n\n- The FDA's removal of draft guidance on clinical trial diversity raises concerns about its commitment to diversity and compliance with statutory obligations.\n\n- The draft guidance aimed to improve the inclusion of underrepresented populations in clinical trials, requiring sponsors to submit Diversity Action Plans.\n\n- The sudden removal leaves sponsors uncertain about compliance and the FDA's ability to meet its statutory deadline for final guidance by June 2025.\n\n- Historical underrepresentation in clinical trials, such as in cardiovascular research, highlights the importance of diversity for generalizable and effective medical findings.\n\nThe FDA removed previously issued draft guidance on diversity in clinical trials from its website without public notice or explanation.\n\nDays after President Donald J. Trump issued an executive order (EO) curtailing diversity, equity, and inclusion (DEI) programs and prohibiting federal recognition of gender identity apart from biological sex, the FDA removed previously issued draft guidance on diversity in clinical trials from its website.1 The move, made without public notice or explanation, was noted by the public on January 23, 2025, raising concerns about the agency’s stance on clinical trial diversity requirements and the statutory obligations of sponsors as the news spreads.\n\nWhile the deleted guidance was still in draft form, it is highly unusual for the FDA to revoke or alter draft guidance without issuing a formal announcement, according to a statement from Crowell & Moring LLP. Typically, draft guidance provides sponsors with insights into the agency’s current thinking on best practices for clinical trial design, statistical analysis, and regulatory expectations. Without this document, sponsors are left with uncertainty about how the agency will evaluate Diversity Action Plans required under the Food and Drug Omnibus Reform Act (FDORA), particularly as the statutory deadline for final guidance approaches on June 26, 2025.\n\n### Recommendations From the Now-Removed Guidance\n\nThe guidance released in June 2024 aimed at improving the enrollment of participants from historically underrepresented populations in clinical studies involving drugs, biological products, and medical devices.2 The agency draft mandated that sponsors submit Diversity Action Plans (DAPs) as part of their investigational new drug (IND) applications or premarket submissions, aligning with the regulatory framework established under sections 505(z) and 520(g)(9) of the Federal Food, Drug, and Cosmetic Act.\n\nAccording to the FDA, diversity in clinical trials is not just a regulatory requirement; it is essential for producing reliable data that reflects the varied demographics of the population that will ultimately use these products. Clinical studies that include diverse participants are more likely to yield results that are applicable to the entire patient population.\n\n#### Key Elements of Diversity Action Plans for IND\n\nUnder sections 505(z) and 520(g)(9) of the Federal Food, Drug, and Cosmetic Act, the DAPs would be required to detail:\n\n- enrollment goals specific to their clinical studies, disaggregated by race, ethnicity, sex, and age group of the clinically relevant population to ensure that different demographic factors are appropriately represented in the study cohort\n\n- rationale for goals explaining the significance of these targets in terms of the study's objectives and outcomes\n\n- strategies for meeting goals where sponsors would outline the methods to be employed to achieve these enrollment and retention goals, including community engagement, cultural competency training for researchers, and targeted outreach to underrepresented populations\n\n#### Addressing Race, Ethnicity, Sex, and Age Group Diversity\n\nThe FDA's guidance was specific in its call for sponsors to consider and implement strategies that focus on:\n\n- sex, as recognized in prior guidance documents, to acknowledge the imperative of including both male and female participants and ensuring that the findings are valid across different genders, including diverse gender identities\n\n- representation of diverse age groups, particularly in pediatric studies, where the health needs and responses to treatments can differ significantly across age\n\n#### Implementation of Strategies\n\nThe FDA recommended that sponsors proactively identify barriers that may hinder participation and address these within their DAPs. Effective strategies may include:\n\n- community engagement and collaboration with health advocates and local providers to raise awareness and build trust among potential participants\n\n- cultural competency training to ensure that clinical trial staff are equipped to communicate effectively with a diverse population, which can improve participant interactions and reduce biases\n\n### Health and Industry Implications\n\nThe final guidance was stated to be legally due by June 2025, but with the draft guidance now missing from the FDA website, uncertainty looms over whether the agency will meet this deadline and how sponsors should proceed in the interim.1\n\nGiven the historical underrepresentation of women, intersex individuals, and those with differences in sex development in medical device trials, the guidance aimed to improve research inclusivity and the generalizability of clinical findings by ensuring diverse participant representation.\n\nOne example revealing the detriment of revoking such guidelines can be seen in cardiovascular disease, the leading cause of death in the US, which historically focused research on men’s health.3 Vast research has shown that women were systematically underrepresented in cardiovascular clinical trials, resulting in treatments and guidelines being developed without fully understanding how heart disease affects women differently.\n\nIn 1977, the FDA issued guidelines that exacerbated this disparity by discouraging the participation of women of childbearing age in clinical trials due to concerns about potential harm to fetuses. As a result, sex-specific differences in cardiovascular disease went largely unstudied; the impact is still felt today.\n\n### What Now?\n\nThe sudden removal of the draft guidance leaves sponsors with significant uncertainty regarding clinical trial diversity expectations.1 Although FDORA mandates that sponsors submit Diversity Action Plans only after FDA finalizes its guidance, many sponsors have already begun voluntarily incorporating these plans into their submissions, Crowell stated. A recent FDA report to Congress indicated that hundreds of drug and device sponsors have proactively submitted diversity plans, recognizing their importance in evaluating product safety and effectiveness.\n\nThe move also raises concerns about whether the FDA will meet its statutory deadline for final guidance. Given the executive order’s broader restrictions on DEI efforts, stakeholders are left questioning whether the agency will uphold its prior commitments to diversity in clinical research or whether further policy shifts may be forthcoming.\n\nAs industry leaders and policymakers await clarification, the firm noted that the removal of this guidance signals a shift in how regulatory agencies interpret and enforce diversity-related requirements in clinical trials under the current administration.\n\nReferences\n\n1. After Trump executive orders, FDA removes diversity guidance from website. Crowell & Moring LLP. News release. January 27, 2025. https://www.crowell.com/en/insights/client-alerts/after-trump-executive-orders-fda-removes-diversity-guidance-from-website\n\n2. FDA. Diversity Action Plans to improve enrollment of participants from underrepresented populations in clinical studies. Guidance document. https://web.archive.org/web/20241225134729/https://www.fda.gov/regulatory-information/search-fda-guidance-documents/diversity-action-plans-improve-enrollment-participants-underrepresented-populations-clinical-studies\n\n3. Klein H. Why are we still seeing gaps in women’s heart care? AJMC. October 15, 2025. Accessed January 31, 2025. https://www.ajmc.com/view/why-are-we-still-seeing-gaps-in-women-s-heart-care-\n\n### Newsletter\n\n## Related Content\n\n### TrumpRx Signals Limited Impact, but a Symbolic Shift in Drug Pricing Policy: Robert Andrews\n\n### Flow Cytometry Tool Could Improve Treatment Monitoring in MS\n\n### Novel Predictive Model May Help Identify Patients at Risk for Difficult-to-Treat RA\n\n### Nanopore Sequencing Accurate in IGH Monitoring for CLL\n\n### HRQOL Not Consistently Assessed in Studies on NSCLC Treatment Efficacy\n\n## Latest CME\n\n## From Strict Avoidance to Tailored Therapies: Transforming Food Allergy Care\n\n1.5 Credits / Allergy, Immunology\n\n## The Evolving Strategies for Managing nAMD and DME: Empowering Managed Care Decisions for Improved Patient Outcomes\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Ophthalmology/Optometry\n\n## Managing Schizophrenia: Evidence-Based Care and Optimizing Value of New and Emerging Therapies\n\n1.0 Credit / Psychiatry\n\n## Closing Gaps in CLL Care: Managed Care Insights and Strategies\n\n1.5 Credit / Hematologic Cancer, Oncology\n\n## Revolutionizing Acute Pain Relief: Emerging Non-Opioid Therapies and the Essential Role of Pharmacists\n\n1.5 Credit / Pain Management/Opioids\n\n## Overview and Burden of Migraine\n\n0.5 Credit / Neurology\n\n## The Role of the Pharmacist Migraine Management\n\n## The Evolving Treatment Landscape of Migraine\n\n## Evidence-Based Guidelines Point to Leap in Care for Hypertrophic Cardiomyopathy\n\n1.0 Credit / Cardiology\n\n## ASH Annual Meeting Coverage: Highlighting the Recent Updates in TKI Use in the Treatment of CML – Insights and Application for Managed Care\n\n1.0 Credit / Oncology, Hematology, Hematologic Cancer\n\n## New and Approved: FDA’s 2024 Drug Lineup\n\n1.5 Credits / General Pharmacy\n\n## Innovations in Medicine: 2024 Lineup of New and Approved Specialty Drugs\n\n2.0 Credits / General Pharmacy\n\n## Revolutionizing Acute Pain Relief: Emerging Nonopioid Therapies and the Essential Role of Managed Care\n\n2.0 Credits / Pain Management\n\n## Leveraging Managed Care to Optimize Patient Outcomes: Integrating Novel Treatments in Schizophrenia\n\n1.5 Credits / Neurology, Psychiatry\n\n## Advancing Immunotherapy in Endometrial Cancer: A Managed Care Perspective on Personalized Care\n\n1.5 Credits / Gynecologic Cancer, Health Equity, Diversity & Inclusion, Oncology, Women's Health\n\n## Overcoming Operational and Clinical Barriers in Multiple Myeloma: Managed Care Strategies for Antibody-Based Regimens\n\n1.5 Credits / Hematologic Cancer, Hematology, Oncology\n\n## Exploring Therapeutic Advances in Myelofibrosis and Key Considerations for Effective Management\n\n1.5 Credits / Oncology, Hematology\n\n## Driving Better Outcomes in Hypertrophic Cardiomyopathy: A Managed Care Imperative\n\n1.5 Credits / Cardiology\n\n## Optimizing the Uptake of Long-Acting Injectables in HIV Treatment and Prevention: Considerations for Managed Care\n\n1.5 Credits / HIV/AIDS, Infectious Disease\n\n## Harnessing Data-Driven Insights and Innovations to Enhance AMD and DME Management: Strategic Approaches for Managed Care\n\n1.5 Credits / Ophthalmology/Optometry\n\n## Navigating the Advancements in Oral Therapy Options in HR+ Metastatic Breast Cancer\n\n1.5 Credits / Breast Cancer, Oncology, Women's Health\n\n## Navigating the Changing Treatment Paradigm of Metabolic Dysfunction-Associated Steatohepatitis: A Guide for Managed Care Pharmacists\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Gastroenterology\n\n## Managed Care Approaches and Models for Equitable Access to Innovations in Major Depressive Disorder Treatment\n\n1.5 Credits / Psychiatry\n\n## Evaluating the Effectiveness and Value of Novel Nonhormonal Treatments in the Management of Menopause-Related Vasomotor Symptoms\n\n1.5 Credits / Women's Health\n\n## Updated Guidance and Managed Care Strategies to Optimize Respiratory Syncytial Virus Vaccination Coverage\n\n1.5 Credits / Immunization, Infectious Disease, Pulmonology\n\n## Leveraging Biologics and Immunotherapies in the Management of Food Allergies\n\n1.5 Credits / Immunology, Allergy\n\n## Advancing Care in Neovascular Age-Related Macular Degeneration and Diabetic Macular Edema: Optimizing Outcomes With Emerging Therapies\n\n## The Evolving Landscape of Transthyretin Amyloidosis Cardiomyopathy: New Therapies and Treatment Strategies\n\n1.5 Credits / Cardiology, Rare Diseases\n\n## Reflecting on the Real-World Use of Biologic Therapy in Asthma Management\n\n1.5 Credits / Immunology, Pulmonology\n\n## Advancing Cystic Fibrosis Management: The Evolving Role of Specialty and Managed Care Pharmacists\n\n1.5 Credits / Pulmonology\n\n## Pulmonary Arterial Hypertension: Real-World Applications of New Therapies and Management Strategies\n\n1.5 Credits / Pulmonology, Cardiology, Rare Diseases\n\n## Targeting Chronic Rhinosinusitis With Nasal Polyps With Biologics: Optimizing Outcomes and Reducing Health Care Burden\n\n1.5 Credits / Immunology\n\n## Emerging Treatment Options for Inflammatory Bowel Disease: A Focus on IL-23 Pathway Inhibition\n\n1.5 Credits / Gastroenterology, Immunology\n\n## Transforming Metabolic Dysfunction-Associated Steatohepatitis Management: Pharmacist Considerations for the Evolving Treatment Landscape\n\n1.5 Credits / Gastroenterology\n\n## Innovations in Inflammatory Bowel Disease Therapy: How IL-23 Inhibitors Are Shaping Treatment and Managed Care Approaches\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Applying Evidence-Based Strategies and Guideline Updates for Managed Care\n\n1.0 Credit / Immunology, Nephrology\n\n## Leveraging Novel Therapies to Transform Demodex Blepharitis Care (Pharmacy Technician Credit)\n\n1.5 Credit / Ophthalmology/Optometry\n\n## Leveraging Novel Therapies to Transform Demodex Blepharitis Care\n\n## The Changing Paradigm in Pain Management and Supporting Access to Novel Therapies\n\n1.0 Credit / Pain Management/Opioids\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: A Case-Based Exploration of Optimized Patient Outcomes\n\n## Opioids, Pain Management, and Substance Use Disorder: A Practical Overview\n\n2.0 Credits / Pain Management/Opioids\n\n## Trending on AJMC\n\n### FDA Approves Nerandomilast for Idiopathic Pulmonary Fibrosis\n\n### Survey Reveals Clinician Confidence Around Using AI in PA Process\n\n### How Medicaid Reforms Could Deepen State Coverage Gaps\n\n### Flow Cytometry Tool Could Improve Treatment Monitoring in MS\n\n### FDA Approves Cemiplimab as First, Only Adjuvant Immunotherapy for High-Risk CSCC\n\n- About\n\n- Contact\n\n- Editorial Boards\n\n- Advertise\n\n- Do Not Sell My Information\n\n- Terms & Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Q3 2025 Recap: Hepatology News and Updates | HCPLive",
      "url": "https://www.hcplive.com/view/q3-2025-recap-hepatology-news-and-updates?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/hcplive/4977be671d00267559cb21c414a393aadfdadded-1200x630.png",
        "1": "https://cdn.sanity.io/images/0vv8moc6/hcplive/c7e9e707c5b9d3526d2f7c3a68af087e7a654886-1200x630.png?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/hcplive/d178be215faf12308f78c63a16b889e5f2fb2374-1200x630.png?w=350&fit=crop&auto=format",
        "3": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/07c0d4e1-23aa-4e1a-8c5f-f2569da581c0/9ybisyhjkwg9-TICatalog750x3612x1212.png",
        "4": "https://d36ai2hkxl16us.cloudfront.net/thoughtindustries/image/upload/v1/course-uploads/07c0d4e1-23aa-4e1a-8c5f-f2569da581c0/j87pzk6sfxr8-TICatalog750x3612x44.png"
      },
      "content": "# Q3 2025 Recap: Hepatology News and Updates\n\n### Key Takeaways\n\n- Semaglutide (Wegovy) was approved for noncirrhotic MASH, based on the phase 3 ESSENCE trial results, emphasizing its role in liver histology improvement.\n\n- FibroScan's LSM by VCTE was accepted as a surrogate endpoint in MASH trials, supported by major pharmaceutical companies, predicting mortality and liver-related events.\n\n- Obeticholic acid (Ocaliva) was voluntarily withdrawn from the US market for PBC, following an FDA request and clinical trial hold.\n\n- Research revealed significant sex disparities in cirrhosis complications, with men facing higher risks of hepatocellular carcinoma and liver transplantation.\n\n- A healthy diet and physical activity were shown to reduce alcohol-related liver mortality risks, with women achieving greater survival benefits.\n\nThe Q3 recap for hepatology spotlights key FDA news, the withdrawal of OCA for PBC, and notable hepatic research from the past few months.\n\nThe third quarter of 2025 brought a flurry of US Food and Drug Administration (FDA) news, notable changes in the primary biliary cholangitis (PBC) treatment landscape, and novel research on liver health, underscoring the rapidly evolving landscape in hepatology.\n\nMetabolic dysfunction-associated steatotic liver disease (MASH) took center stage in the realm of regulatory updates with the approval of Novo Nordisk’s semaglutide (Wegovy) injection 2.4 mg and the acceptance of Echosens’ Letter of Intent for the qualification of LSM by VCTE (FibroScan) as a reasonably likely surrogate endpoint in clinical trials. Meanwhile, in PBC, the field lost an important second-line treatment option with the voluntary withdrawal of obeticholic acid (Ocaliva) from the US market.\n\nIn terms of hepatic research, new studies are providing additional insight into sex disparities in liver complication risk among patients with cirrhosis, the potential benefits of nontargeted hepatitis C virus (HCV) screening, the impact of pruritus on health-related quality of life (HRQoL) in PBC, and the benefits of adhering to a healthy diet and being physically active in the context of alcohol-attributable liver-related mortality risk.\n\nCheck out this recap of what made headlines in Q3 of 2025:\n\n### FDA Approves Semaglutide (Wegovy) Injection 2.4 mg for Noncirrhotic MASH\n\nOn August 15, 2025, the FDA approved Novo Nordisk’s semaglutide (Wegovy) injection 2.4 mg for the treatment of adults with MASH with moderate to advanced fibrosis, but not with cirrhosis, in conjunction with a reduced calorie diet and increased physical activity. The decision was based on results from the phase 3 ESSENCE trial investigating the effects of once-weekly semaglutide 2.4 mg injection on liver histology in adults with MASH and moderate to advanced liver fibrosis at week 72.\n\n#### Related: Diabetes Dialogue: FDA Approves Semaglutide (Wegovy) for MASH\n\n### FDA Accepts FibroScan Letter of Intent for Surrogate Endpoint in MASH Trials\n\nOn September 8, 2025, the FDA’s Center for Drug Evaluation and Research, Office of New Drugs accepted Echosens’ Letter of Intent for the qualification of LSM by VCTE (FibroScan) as a reasonably likely surrogate endpoint in clinical trials for MASH. As stated in the Letter of Intent, which included official letters of support from Eli Lilly, Boehringer Ingelheim, and Novo Nordisk, LSM by VCTE can predict the risk of all-cause mortality or liver-related events in patients with MASH.\n\n### Intercept Voluntarily Withdraws Obeticholic Acid (Ocaliva) for PBC From US Market\n\nOn September 11, 2025, Intercept Pharmaceuticals announced its decision to voluntarily withdraw obeticholic acid (Ocaliva) from the US market for the treatment of PBC following a request from the FDA, The Agency additionally placed a clinical hold on all Intercept clinical trials conducted under a US IND involving obeticholic acid.\n\n### Male Cirrhosis Patients Face Greater Risk of Liver Complications Than Females\n\nLeveraging data for > 400,000 adult patients from the Merative MarketScan Research Databases, this study highlights significant sex disparities in liver complication risk among patients with cirrhosis, including increased risks of hepatocellular carcinoma, liver transplantation, and decompensated cirrhosis among men compared with women.\n\n### Nontargeted Emergency Department HCV Screening Could Aid Infection Identification\n\nFindings from the DETECT Hep C Trial suggest a nontargeted HCV screening approach may be preferable to targeted screening for identifying new HCV infections in emergency departments (EDs). Coined as the largest pragmatic clinical trial of HCV screening in EDs to date, the trial was conducted in 3 high-volume EDs at Denver Health Medical Center, Johns Hopkins Hospital, and the University of Mississippi Medical Center and found nontargeted HCV screening identified significantly more new diagnoses of HCV infection than targeted screening.\n\n### Pruritus Increases HRQoL Burden in PBC, Underscoring Need for Effective Treatments\n\nRecent research suggests people with PBC and moderate-to-severe pruritus experience a greater HRQoL burden and reduced activity compared to those with mild-to-no pruritus. Specifically, those who reported experiencing pruritus experienced a significantly greater negative impact on HRQoL across a range of domains, including those related to itch, fatigue, and social and cognitive function. Of note, those with pruritus reported infrequent use of treatments targeting itch, with minimal or no relief.\n\n### Healthy Diet, Physical Activity Improve Alcohol-Related Liver Health\n\nFindings from this study shed light on the benefits of adhering to a healthy diet and being physically active in the context of alcohol-attributable liver-related mortality risk, highlighting notable attenuations in this risk across all drinking patterns, including heavy and binge drinking.\n\nDaily alcohol intake and binge drinking were independently associated with greater risks of liver-related mortality, but this risk was found to be reduced with healthy dietary patterns and increased physical activity. Of note, women achieved greater liver survival benefits than men.\n\n### Newsletter\n\n## Related Content\n\n### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\n### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\n### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\n### Navigating Access Barriers and Treatment Gaps in HFpEF Care\n\n## Latest CME\n\n## Patient, Provider & Caregiver Connection™: Understanding the Patient Journey to Provide Personalized Care for Generalized Pustular Psoriasis\n\nTina Bhutani, MD, MAS, FAAD; Jason E. Hawkes MD, MS\n\n## SimulatED™: Understanding the Role of Genetic Testing in Patient Selection for Anti-Amyloid Therapy\n\nNicholas Doher, DO; Babak Tousi, MD\n\n## Cases and Conversations™: Applying Best Practices to Prevent Shingles in Your Practice\n\nPaul G. Auwaerter, MD, MBA; Paul P. Doghramji, MD, FAAFP; Aruna Subramanian, MD\n\n## Clinical Consultations™: Addressing Elevated Phosphate Levels in Patients with END-STAGE Kidney Disease (ESKD)\n\nAnil K. Agarwal, MD, FACP, FASN, FNKF, FASDIN; Jay B. Wish, MD\n\n## Advances In: Managing Hyperphosphatemia in Chronic Kidney Disease – Bridging Treatment Gaps With Novel Therapies\n\nGlenn M. Chertow, MD, MPH; Anjay Rastogi, MD, PhD\n\n## Burst CME™: Addressing Inadequate Response to Anti-TNF Therapy in Patients With Rheumatoid Arthritis\n\nJeffrey A. Sparks, MD, MMSc\n\n## Community Practice Connections™: Cases and Conversations – Keeping Up with Novel Approaches to Managing ANCA-Associated Vasculitis\n\nFrank B. Cortazar, MD; Lindsay S. Lally, MD\n\n## Burst CME: Targeted Therapy for Optimal Psoriasis Management\n\nTina Bhutani, MD\n\n## Cases and Conversations™: A Horizon View of Continuous Monitoring Systems for Diabetes Management\n\nDiana Isaacs, PharmD, BCPS, BC-ADM, BCACP, CDCES, FADCES, FCCP; Anders Carlson, MD; Jennifer B. Green, MD\n\n## Progress in Hyperlipidemia Management to Reduce ASCVD Risk: An Illustrated Update\n\nNihar R. Desai, MD, MPH; Martha Gulati, MD, MS, FACC, FAHA, MASPC, FESC, FSCCT (hon), FRCP Edin\n\n## Trending on HCPLive\n\n### EVEREST: Dupilumab Outperforms Omalizumab in Head-to-Head CRSwNP Trial, with Anju Peters, MD\n\n### Tirzepatide Effects Men and Women with HFpEF Equally, With Barry Borlaug, MD\n\n### Nerandomilast Nets First New FDA Approval for Idiopathic Pulmonary Fibrosis in Over 10 Years\n\n### Q3 2025 Recap: Ophthalmology News and Updates\n\n### New Guidelines and Novel Therapies in IgA Nephropathy, With Jai Radhakrishnan, MD\n\n- About Us\n\n- Advertise\n\n- Editorial\n\n- Contact Us\n\n- Do Not Sell My Information\n\n- Privacy\n\n- Terms & Conditions\n\n- Cookie settings\n\n259 Prospect Plains Rd, Bldg H Monroe, NJ 08831\n\n609-716-7777\n\n© 2025 MJH Life Sciences®",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Precision medicine: affording the successes of science",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC9812011?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Clinical trials: a new standard of care?\nThese concepts have clear application in oncology, where advances in genomics have radically accelerated drug development. It is estimated that, of more than 840 oncology drugs in development in 2018, >90% are biomarker-dependent17. A biomarker, as defined by FDA and the National Institutes of Health, is a “characteristic that is measured as an indicator of normal biological processes, pathogenic processes, or responses to an exposure or intervention, including therapeutic interventions”18. As noted above, clinical trials are not a core part of standard oncology practice. In the 1990s, a phase 1 study of a new chemotherapy offered a low response rate (e.g., 5%) with unquantifiable risk of toxicities. The situation is changing rapidly. Participation in a phase 1 study of a rationally-designed drug directed at a matched biomarker now offers a response rate in excess of 30%19. Consider doxorubicin, a standard of care for a patient with newly diagnosed metastatic sarcoma, with response rates of between 10% and 30%20-22. For patients carrying the relevant biomarker, a phase 1 study today appears to offer a better chance of response than the standard of care.\nIt is important to note that trials-based therapies carry inherently greater uncertainty than standard-of-care treatment, which should be considered in the following proposed model. For this reason, we have focused on the terminal stages of a cancer patient journey, where most patients run out of standard-of-care options. In these circumstances of unmet medical needs, clinical trials of biomarker-dependent therapies offer additional important options for patients who remain fit enough for treatment. Further, we anticipate that trial drugs may have roles even at earlier stages of the cancer journey, where standard-of-care treatments exist. Participation ethically approved clinical trials randomizing new against standard-of-care cancer treatments could offer access to promising new therapies. Given the uncertainty attached to the clinical benefits of participation in clinical trials, it will be important to monitor clinical outcomes prospectively as part of the proposed model.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "HIV/AIDS research",
      "url": "https://en.wikipedia.org/wiki/HIV/AIDS%20research?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "In March 2016, researchers at Temple University, Philadelphia, reported that they have used genome editing to delete HIV from T cells. According to the researchers, this approach could lead to a dramatic reduction of the viral load in patient cells.\n\nIn March 2019, a patient with Hodgkin's lymphoma was also reported to possibly have been cured using similar treatment to Brown.\n\nSee also \nDiscovery and development of CCR5 receptor antagonists\nDiscovery and development of HIV-protease inhibitors\nDiscovery and development of non-nucleoside reverse-transcriptase inhibitors\nBroadly neutralizing HIV-1 antibodies\nInnate resistance to HIV\nHealth interventions\nHIV superinfection\nHistory of HIV/AIDS\nSex education\n\nReferences\n\nExternal links \nHIV and AIDS News (ScienceDaily)\nHIV and AIDS News (Medical News Today)\nTreatment Action Group – Clinical Trials",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Brain transplant",
      "url": "https://en.wikipedia.org/wiki/Brain%20transplant?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "See also \n Cyborgs in fiction (for stories of brains transplanted into wholly artificial bodies)\n Donovan's Brain\n Isolated brain\n Robotics\n Robert J. White\n\nReferences\n\nExternal links \nDr Robert White, profile by David Bennun in The Sunday Telegraph Magazine, 2000\nToday / Brain Transplants (BBC Radio4)\n \nDr. Robert J. White to Discuss \"Rise and Fall of the Human Brain\" (Lakeland Community College)\n\nThe BBC Radio drama by Matthew Broughton ‘’Tracks - Origins’’\n\nSpinal cord regeneration\n Researchers Stretch Nerve Fibers to New Limits (Fox News)\n Spinal Cord Bridge Bypasses Injury To Restore Mobility (EmaxHealth)\n Cancer-Causing Protein May Heal Damaged Spinal Cord & Brain Cells (Newswise.com)\n Swiss make breakthrough in spinal research: Novartis has started clinical trials into spinal cord regeneration (swissinfo.ch)\n\nOrgan transplantation\nEmerging technologies\nNeurosurgery",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Getting It Right: Being Smarter about Clinical Trials Policy Forum",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC1435786?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Conclusion: Prospects for the Future\nIn spite of the shortcomings in observational studies that have led to mistakes in the interpretation or application of evidence, there was an overall air of optimism at the meeting that taming the new technologies and applying strategies for rigorous statistical and study design may help resolve some of the uncertainties that bedevil clinical trials today. Greater knowledge of pharmacogenetics and metabolomics, and a better understanding of how genes interact with each other and with environmental variables, may lead to new designs for clinical trials. Medicine may see an acceleration of the movement toward prevention of disease and maintenance of health and well-being. All this will be welcome news to the public, advocacy groups, the media, policy makers-and scientists themselves, who are among the first to admit, as Aristotle said, that “the investigation of truth is in one way hard, in another, easy.”\n<TB>\n\n## Box 1. Recommendations Arising from the Meeting\n1.\n   Be aware of and eliminate bias and confounders to the extent possible.\n2.\n   Establish formal means of setting priorities for conducting large clinical trials.\n3.\n   Employ meta-analyses and systematic reviews to enhance means of weighing evidence, but beware of potential systematic biases.\n4.\n   Give equal weight to determining safety and efficacy in clinical trials.\n5.\n   Validate biomarkers and surrogate end points before basing policy guidelines for public health on them.\n6.\n   Employ the technologies of the “-omics” revolution and systems biology approaches, but with caution.\n7.\n   Communicate results of clinical trials in an accurate and timely manner.\n8.\n   Establish two-way communications with communities, consumers, and patient advocacy groups during development, implementation, and reporting of clinical trials.\n9.\n   Establish criteria to inform public policy and decision making.\n\n</TB><TB>\n\n## Box 2. Factors Affecting the Decision to Conduct a Clinical Trial\n1.\n   Strength of existing evidence: promising, but not conclusive data from pre-clinical and observational studies/small trials\n2.\n   Potential impact on public health and/or medical science\n3.\n   Therapeutic equipoise: difficulty deciding which of two therapies is better without a head-to-head test\n4.\n   Portfolio balance: a research organization may adjust its priorities to give more (or less) attention to specific areas to achieve optimal use of its resources\n5.\n   A potential for runaway practice, e.g., a new diagnostic test that is being widely marketed, but has not been adequately evaluated\n6.\n   Social/political context/pressures-from legislators, community leaders, patient advocacy groups\n\n</TB><TB>\n\n## Presenting Relative Risks Alone Can Be Misleading\n“… a 68% reduction!”\nThis ad for an antiosteoporosis drug claimed that individuals taking the drug in a year's trial experienced a 68% reduction in clinical vertebral fractures over a comparable group on placebo.\nWhat were the actual figures? The rate of fractures among placebo users was 0.738%. The rate of fractures among the drug users was 0.238%. Thus, the absolute risk reduction was 0.738% - 0.238% = 0.5%, which translates to five fewer fractures per 1,000 women-hardly headline news. But by presenting the data in terms of relative risk reduction-relative risk reduction = 1 - 0.238%/0.738% = 0.678 (approximately 68%)-the impressive 68% figure was advertised. Computations of relative risk reduction will always appear impressively large when actual event rates are low.\n\n</TB>\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Clinical Trial Notifications Triggered by Artificial Intelligence–Detected Cancer Progression A Randomized Trial Clinical Trial Notifications Triggered by AI-Detected Cancer Progression Clinical Trial Notifications Triggered by AI-Detected Cancer Progression",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC12013351?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "jamanetwopen-e252013-g001.jpg": "https://prod-s3-vyplatform-processeddata.s3.amazonaws.com/valyu-v5/valyu-pubmed/99219630-2917-5fbe-8398-4444792ad21c/jamanetwopen-e252013-g001.jpg?response-content-type=image%2Fjpeg&response-content-disposition=inline%3B%20filename%3D%22jamanetwopen-e252013-g001.jpg%22&X-Amz-Algorithm=AWS4-HMAC-SHA256&X-Amz-Credential=ASIAZEI6M4QPVQ7TYDH4%2F20251009%2Feu-west-2%2Fs3%2Faws4_request&X-Amz-Date=20251009T115139Z&X-Amz-Expires=3600&X-Amz-SignedHeaders=host&X-Amz-Security-Token=IQoJb3JpZ2luX2VjEDwaCXVzLWVhc3QtMSJIMEYCIQD58hJvNbu2hpsOYAqI%2FKkVLwHYLs8gb9XkamBk7X%2BJ7gIhAJhfYUY6mWM4Jj3fG82NAV1RtrKF4AJu9%2BVdAzwmt29pKpIECNT%2F%2F%2F%2F%2F%2F%2F%2F%2F%2FwEQABoMNjI3NjY1ODU1NTE5IgyP73ly2bwz%2FXvzL0gq5gOnUS4JNQlOg8y%2BlrY7WJCt8TAWPxfX1PK6XKQbEUj1TBD2ovxVMR5NizKMNMGurFuzzm6ihdPce75w1kOvPWBhueQaD7bt1IjSvw6orU%2Fa%2BncGitubxTJOXNQvdoxoVZptTxMUfpHGRP0Xp6PylXvhhQLBYpr9XystiG1EwingkmFyflK0zzm2f94rIxUK6hqze8A%2BZc673gMzRnJeefqtykPXlYJ%2FlnI9GSUeEnnJ8e8qz%2B0ZYRTnNmAfq%2BV166B4zaG78yeJNPifwnHlD%2F81ZdsNspiITkKAcVTaPsGaphblSzNNpPJ1PwO9XeWFH3ihRIP5B2cJsGOFs5pHM0ru79GMTc5LVLtMqs2Odr8nBDBFRq9oHD8ib%2B%2BUhfozOE110sH3zj0eO06hMHc5tvyMsR68oSGoegiwcJIAnZtoMmBC7F52sx0sCRcMQCihEZ%2B4ukZ5pvBslsq0fDYseW1dDcN0UrqGTnvq%2BX3p4gBli4lRTSXll5lxz5CJiSVNe9Uh%2BVeeT7mnroteh4GmVbjjjA9EiuwVPJYnqim7BSECSp%2FfRBYmIogcBWVhQjIvR5XfPw4cNVqBsqQBqi9uVgGmR2sCWKAsjORj7HVgfn7A%2Bdt0jxqAMq9X9wLAoPDUzlroRPHP9oYwv66exwY6pAEtYvMBxALrzMGPmm8HexzHgihN%2BKQ%2BTCiBL42v6tmZ%2BomnjgstGiDc0Wy1rnE6VuOyMZ7GQgCBgo3l667Ri1U4NMnABcm35Z9LOo8BdRUa6TeZaBwvnJ4tdfVn7xosfE%2FccFtUkTBg8g%2FC6kWz%2F%2B93tjfwXk6GY9cQsn44VGIo4Mlu0AJlsMmE4bg6b%2FpCYejxIrLAR0hqWhNnOGAnyrZHUuBvVg%3D%3D&X-Amz-Signature=22a7f53682172e76c5dc2d2bbc2ea88e9b73abd324f9e4caab6ce51df437b3f7"
      },
      "content": "## Introduction\nClinical trials are critical to the development of new cancer treatments. However, fewer than 10% of adults with cancer participate in treatment trials, and there are well-documented race-, sex-, and age-based disparities in trial enrollment.1,2 At the same time, approximately 20% of trials close prematurely, often due to low patient accrual.3,4 Matching patients to trials remains a complex, time consuming process that contributes to slow accrual rates and inefficiencies in the clinical research enterprise.\nSeveral services are in development by government, academia, and industry5 to improve patient-trial matching.6 At Dana-Farber Cancer Institute (DFCI), the open-source MatchMiner tool7 was developed to link patients to trials using structured tumor genomic panel DNA sequencing data.8 MatchMiner enables oncologists to search for genomically matched trials for their patients, and it allows trial investigators to search for patients with tumors with genomic alterations targeted by their trials. Among trial enrollees, the time from genomic sequencing to consent was lower when MatchMiner was used.7 However, a challenge to implementation is that information about clinical trials is usually relevant only at moments when a patient needs a new treatment, usually due to disease progression. In routine practice, information about disease response and progression is recorded only in the unstructured text of a radiologist’s imaging reports or an oncologist’s clinical note. Historically, identifying patients with progressive disease has therefore required manual medical records review, which is prohibitive at scale.\nRapid advances in artificial intelligence (AI) could make clinical trial matching tools more useful in real time by extracting data on variables, such as cancer progression,9,10,11 from the electronic health record (EHR). Our group previously developed a model that ascertains progressive disease9,10 and a model that predicts whether patients will start a new systemic therapy within 30 days of an imaging report using the text of that report and prior reports for each patient.12 These models were piloted in MatchMiner with the goal of identifying patients potentially eligible for specific genomically targeted clinical trials at moments when they had progressive disease and were likely to change treatment.13 In the current study, we evaluated the impact on clinical trial participation of notifying treating oncologists about genomically matched clinical trial options when their patients had AI-ascertained progressive disease and an elevated probability of treatment change.\n\n## Methods\n\n### Study Design\nThis was a single-center, prospective randomized trial performed at DFCI among adults with solid tumors that had undergone panel DNA next-generation sequencing (NGS).8 The intervention consisted of emailing lists of genomically matched trials to physicians treating patients who became trial ready, defined as having AI-detected progressive disease and an elevated probability of treatment change based on imaging reports. The primary outcome was enrollment in any treatment clinical trial. This trial was registered retrospectively at the request of the journal ([NCT06888089]()). The study protocol is given in [note-ZOI250122-1-s]. The study was approved by the Dana-Farber/Harvard Cancer Center institutional review board, with a waiver of informed consent given the minimal risk of the intervention to patients and the large cohort size. Results are reported according to the Consolidated Standards of Reporting Trials ([CONSORT]()) reporting guideline.14\n\n### Eligibility\nPatients were included if they had DFCI institutional solid tumor DNA NGS (OncoPanel)8,15 results obtained from July 2013 to December 2022. In addition, included patients were at least 18 years of age and were alive on the randomization date of January 30, 2023.\n\n### Study Procedures\nPatients were randomized 2:1 to the intervention (AI-triggered email notifications) or control (no email notifications) arm. Randomization was not stratified given the large sample size. Randomization was performed by 1 member of the study team (M.G.), and the team member who performed final analyses (K.L.K.) did not have access to the cohort assignments until the end of follow-up. In the intervention arm, there was an additional 1:1 randomization into 2 subgroups: subgroup A had AI-triggered email notifications with no manual review before emails were sent, and subgroup B had AI-triggered email notifications with manual review (described later in this section) before emails were sent. The study schema is depicted in [zoi250122f1]. Demographic information, including race and ethnicity, was collected from the EHR. Race categories were American Indian or Alaska Native, Asian, Black or African American, White, multiracial, and unknown, and ethnicity categories were Hispanic, non-Hispanic, and unknown. Race and ethnicity data were analyzed to present balance by randomization group.\n<FG id='zoi250122f1'>\n**Figure 1**: Figure 1. \n**Study Schema and Patient Allocation**\n<F href='jamanetwopen-e252013-g001.jpg'>\nAI indicates artificial intelligence; and NGS, next-generation sequencing.\n</F>\n</FG>",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Pharmacy Times – Pharmacy Practice News and Expert Insights",
      "url": "https://www.pharmacytimes.com/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/8caeef59f80cc65922c8d847c59531a6b81d5ca2-2551x901.png",
        "1": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/a09a20c81437a21ed948543424c2fd325dd9b6de-5490x3660.jpg?w=240&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/bc7d7aad3c1fb35caf189e6c0c4c1c91753ee5ff-2688x1512.png?w=240&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/f6421cbb549cf5ecafb489a66bb1f2cb3d58aee1-1080x1920.png?w=400&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/1c420c3bf347f20f30b163373bbba10dddd74b8e-1080x1920.png?w=400&fit=crop&auto=format"
      },
      "content": "## Conference Coverage\n\n6 days ago\n\npainweek\n\n7 days ago\n\n8 days ago\n\nims\n\n9 days ago\n\n10 days ago\n\n11 days ago\n\n13 days ago\n\nwclc\n\n14 days ago\n\n# Latest News\n\n### Novel Drug Combo Improves Survival in Patients With Metastatic Castration-Sensitive Prostate Cancer\n\n#### CGM-Based Measures Could Improve Detection of Impaired Glucose Regulation\n\n#### FDA Approves Cemiplimab as Adjuvant Treatment for Cutaneous Squamous Cell Carcinoma\n\n#### Data Suggest Calcium Supplementation Is Not Linked to Dementia Risk in Older Women\n\n#### Medicaid Expansion Can Improve 5-Year Survival Outcomes in Patients With Cancer\n\n##### Pharmacists’ Role in Translating FDA’s New Direct-to-Consumer Advertising Rules\n\n##### Understanding RSV in Older Adults: Risks, Symptoms, and Barriers to Vaccination\n\n##### Expert: Implementation Strategies for Opioid Stewardship in Cancer Institutions\n\n##### Pharmacists’ Role in Reducing Stigma and Expanding Buprenorphine Access for Opioid Use Disorder\n\n##### Building an Opioid Stewardship Program in Cancer Care: Pharmacist Roles, Challenges, and Patient Safety\n\n##### How the FDA Is Using AI to Monitor Drug Advertising and Ensure Compliance\n\n##### Expert: Navigating Costs, Regulations, and Patient Care in Gene Therapy\n\n##### Role of the Pharmacist in Incorporating Guidelines Recommendations\n\n## Shorts\n\n## Podcasts\n\n## Videos\n\n### The Future of FDA Enforcement: How Artificial Intelligence Is Changing Drug Advertising Compliance\n\n#### Pharmacists Are Indispensable Partners in Delivering Safe, Effective Atrial Fibrillation Care\n\n#### Pharmacists Are Trusted Partners in Safe Obesity Medication Use\n\n#### Patient Experience With Faster Vaccine Preparation\n\n#### New Advancements for Shingles Vaccination\n\n## Continuing Medical Education\n\n## From Testing to Treatment: Empowering Pharmacists to Overcome Barriers and Optimize Biomarker-Driven Care\n\nOctober 9, 2025 | 1:00 & 8:00 PM EDT\n\n## Infectious Disease Day of Education 2025\n\nOctober 9, 2025 | 10:00 AM EDT – 6:00 PM EDT\n\n## Clinical Presentation of Hyperglycemia With PI3K and AKT Inhibitors\n\nOctober 14, 2025 | 1:00 PM & 8:00 PM ET\n\n## Multidisciplinary Insights to Enhance Biomarker Testing Practices in Non-Small Cell Lung Cancer\n\nOctober 15, 2025 | 7:00 PM EDT\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Translating New Clinical Evidence and Updated Guidelines Into Managed Care Strategies\n\nOctober 21, 2025 | 1:00 PM & 8:00 PM ET\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## Targeting the Root of Autoimmunity in Generalized Myasthenia Gravis: Pharmacist Strategies for Integrating FcRn Therapies Into Specialty Practice\n\nOctober 23, 2025 | 12:00 PM & 8:00 PM EDT\n\n## Utilizing VMAT-2 Inhibitors for the Management of Tardive Dyskinesia: The Role of Long-Term Care Pharmacists\n\nOctober 24, 2025 | 10:15 AM – 11:15 AM PDT\n\n## ASCP 2025 Satellite Symposia\n\nOctober 24-25, 2025\n\n## IL-23 Inhibitors in Psoriasis: Optimizing Access and Patient Outcomes Across Integrated Systems\n\nOctober 28, 2025 | 1:00 PM & 6:00 PM ET\n\n## Effective Strategies to Manage Hyperglycemia When Treating with PI3K and AKT Inhibitors\n\nOctober 28, 2025 | 12:00 PM & 7:00 PM EDT\n\n## AMCP Nexus 2025\n\nOctober 28-29, 2025\n\n## Multidisciplinary Insights and Strategies for Patients Treated With PI3K and AKT Inhibitors to Prevent Hyperglycemia\n\nOctober 30, 2025 | 7:00 PM EDT\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## All News\n\n### Cholesterol Levels Not Associated With Blood Stem Cell Mobilization in Healthy Donors\n\nA retrospective analysis found no associations between lipid parameters and the success of blood stem cell mobilization in a cohort of healthy donors.\n\n### Dexamethasone-Sparing Regimen Offers Safer Option for Frail Patients With MM\n\nFrail patients with multiple myeloma (MM) can safely reduce dexamethasone use, enhancing treatment outcomes without increasing infection risks.\n\n### Cagrilintide Demonstrates Promising Results as Monotherapy for Obesity Management\n\nCagrilintide shows significant weight loss in adults with obesity, marking a breakthrough in obesity treatment with promising phase 3 trial results.\n\n### Nerandomilast Receives FDA Approval for Idiopathic Pulmonary Fibrosis\n\nThe FDA approves nerandomilast, the first new treatment for idiopathic pulmonary fibrosis in over a decade, offering renewed hope for patients.\n\n### Pneumococcal Polysaccharide Vaccination Does Not Reduce Rates of Cardiovascular Events\n\nVaccination with 23-valent pneumococcal polysaccharide vaccine did not reduce the rates of acute coronary syndrome and ischemic stroke in a randomized clinical trial.\n\n### Pharmacist Takeover: BCMA Bispecifics and CAR T-Cell Therapy\n\n### Clinical and Public Health Implications of Recent H5N1 Poultry Outbreaks\n\n### FDA Grants Fast Track Designation to BMS-986446 for Treatment of Early Alzheimer Disease\n\nBMS-986446 shows promise as a fast-tracked therapy for early Alzheimer disease, targeting tau protein to alter disease progression.\n\n### Study Shows Infliximab Biosimilar is Safe in Patients Undergoing RA Treatment\n\nRecent research confirms that rheumatoid arthritis patients in remission can safely switch to the biosimilar infliximab-dyyb, offering a cost-effective treatment option.\n\n### Icotrokinra Outperforms Deucravacitinib in Head-to-Head Psoriasis Study\n\nJohnson & Johnson presented new long-term data of icotrokinra from ICONIC-LEAD, along with data from ICONIC-ADVANCE indicating head-to-head superiority with standard-of-care deucravacitinib.\n\n### Dato-DXd Shows Promise as First-Line Therapy in Metastatic TNBC\n\nDatopotamab deruxtecan shows promise as a first-line treatment for metastatic triple-negative breast cancer, improving survival in non-immunotherapy candidates.\n\n### Albuterol–Budesonide Combo Boosts Lung Function in Asthma\n\nResearch highlights the effectiveness of the albuterol-budesonide combination for ensuring rapid relief and safety in patients with asthma.\n\n### Tips for Using AI Tools Responsibly During Pharmacy School\n\nStudent pharmacists should use practical tips to responsibly use artificial intelligence tools for studying, clinical simulations, exam preparation, and time management while ensuring ethical and effective usage.\n\n### Sotatercept Cuts Risk of Disease Progression in Pulmonary Arterial Hypertension\n\nNew results from the phase 3 HYPERION trial demonstrate reduced risks as early as the year following diagnosis of pulmonary arterial hypertension.\n\n### FDA Approves Roflumilast Cream for Pediatric Patients With Atopic Dermatitis\n\nThe approval is supported by findings from the INTEGUMENT-PED trial and the INTEGUMENT-OLE long-term extension study.\n\n### Q&A: How 340B Rebate Pilot Could Strain Community Pharmacies and Patient Access\n\nMartha Thorne discusses the operational, financial, and patient care challenges pharmacies face under the 340B rebate pilot and the need for advocacy, automation, and transparency to sustain access.\n\n### Evinacumab-dgnb Approved For Children Aged 1-5 With Rare Form of High Cholesterol\n\nThe angiopoietin-like-3-targeting treatment received an expanded indication for individuals aged 1 through 5 years, building on earlier approvals in older populations.\n\n### Study Finds CGMs Could Overestimate Food’s Impact on Blood Sugar Among Nondiabetic Individuals\n\nRecent research reveals that continuous glucose monitors (CGMs) may inaccurately overestimate blood sugar levels, potentially leading to unnecessary dietary changes for healthy individuals.\n\n### Patients Critically Ill With COVID-19 Have Heightened Risk of Pulmonary Fibrosis\n\nPulmonary fibrosis was observed in many patients with severe COVID-19 in a retrospective cohort study, indicating the need for more effective care and prevention.\n\n### Pharmacists Can Provide Trusted Medical Advice in an Era of Fractured Health Care\n\nFor American Pharmacists Month, see how recent instances of conflicting medical advice show the importance of pharmacists as trustworthy health care professionals.\n\n### Stelara Biosimilar SYSA1902 Shows",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "New Product Newswire | Drug Topics",
      "url": "https://www.drugtopics.com/view/new-product-newswire-73?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/ffd0d9605669ed3afcc980b5588ff6747775df28-1800x1200.jpg?w=350&fit=crop&auto=format",
        "1": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/bb9a42064b2434f007f7f74cb2c234fed24de034-4800x2700.jpg?w=350&fit=crop&auto=format",
        "2": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/6e565037e47df47ae94f777d14195d9662b2e596-4608x3072.jpg?w=350&fit=crop&auto=format",
        "3": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/b7dcd7cdc41f83d6a1d5ecda8966db730333446c-6048x4024.jpg?w=350&fit=crop&auto=format",
        "4": "https://cdn.sanity.io/images/0vv8moc6/drugtopics/a281e84845b9b2679c5ad45c931dbf311918fa2c-3840x2160.jpg?w=350&fit=crop&auto=format"
      },
      "content": "# New Product Newswire\n\nHyperammonemia, a condition of dangerously heightened levels of ammonia in the bloodstream, can be life-threatening in patients with urea cycle disorder (UCD), an inborn error of urea cycle metabolism. Ammunol, from Medicis Pharmaceutical Corp., Scottsdale, Ariz., (602) 808-8800, combines 10% sodium phenylacetate and 10% sodium benzoate in a new product intended for intravenous hospital use in the event of hyperammonemic crisis. The drug was recently approved for marketing as a \"rescue medication.\"\n\nRxNEW DRUGS Hyperammonemia, a condition of dangerously heightened levels of ammonia in the bloodstream, can be life-threatening in patients with urea cycle disorder (UCD), an inborn error of urea cycle metabolism. Ammunol, from Medicis Pharmaceutical Corp., Scottsdale, Ariz., (602) 808-8800, combines 10% sodium phenylacetate and 10% sodium benzoate in a new product intended for intravenous hospital use in the event of hyperammonemic crisis. The drug was recently approved for marketing as a \"rescue medication.\"\n\nMedicis Pharmaceutical has received FDA approval for Vanos (fluocinonide 0.1% topical cream), a Class I corticosteroid for the treatment of plaque-type psoriasis. The high-potency cream is available in 30- and 60-gm sizes.\n\nPeople with weakened immune systems or certain skin conditions are susceptible to vaccine complications. A new drug was approved by the FDA as the first intravenous human plasma-derived product available to treat a number of rare complications of smallpox vaccination. Vaccinia Immune Globulin Intravenous (VIGIV) is made from the pooled plasma of donors who receive booster immunizations with the licensed smallpox vaccine Dryvax and is licensed to DynPort Vaccine Co. LLC, Frederick, Md., (301) 607-5000.\n\nNEW FORMULATIONS From Schering-Plough Corp., Kenilworth, N.J., (908) 298-4000, a new nonsedating Clarinex (desloratadine) Syrup (0.5 mg per 1 mL) is now available nationwide. It is indicated for the treatment of indoor allergies and hives in children as young as six months of age and for the relief of outdoor allergy symptoms in children two years of age and older. It is available in bubblegum flavor.\n\nEverett Laboratories, West Orange, N.J., (800) 964-9650, is introducing a chocolate chewable calcium and folic acid supplement intended to help support the skeletal and cardiovascular systems in premenopausal, menopausal, and postmenopausal women. The new fast-dissolving CalciFol Chewable Wafers contain calcium carbonate, vitamin D3, magnesium, folic acid, vitamin B6, boron, and vitamin B12. One tablet in the morning is the recommended dosage.\n\nNEW TREATMENT OPTION For Roche Pharmaceuticals, Nutley, N.J., (800) 526-6367, the FDA has approved Pegasys (peginterferon alfa-2a) and Copegus (ribavirin, USP) in combination for the treatment of patients co-infected with chronic hepatitis C and HIV. It is the first and only approved combination regimen for treating these coexisting conditions. Pegasys is dosed at 180 mcg as a once-weekly subcutaneous injection; Copegus is available as a 200-mg tablet and is administered orally two times a day as a split dose.\n\nREINTRODUCTION TEVA Pharmaceuticals and Savient Pharmaceuticals, East Brunswick, N.J., have joined forces for the U.S. launch of TEV-TROPIN (somatropin [rDNA origin]) for injection. The growth hormone, a polypeptide of recombinant DNA origin, is indicated for the long-term treatment of children with short stature due to endogenous growth hormone deficiency. For further information, call TEVA at (215) 591-3030, or Savient at (732) 418-9300.\n\nNEW GENERICS TEVA USA, North Wales, Pa., (888) TEVA USA, is introducing amoxicillin and clavulanate potassium chewable tablets USP. Available in 400 mg/57 mg strength in bottles of 20, the tablets are AB rated to GlaxoSmithKline's Augmentin, indicated for the treatment of lower respiratory tract infections, otitis media, sinusitis, skin and skin structure infections, and urinary tract infections.\n\nTentative approval has been granted to Ranbaxy Pharmaceuticals, Princeton, N.J., (609) 720-9200, for donepezil hydrochloride tablets in strengths of 5 mg and 10 mg. Indicated for the treatment of mild to moderate dementia of the Alzheimer's type, it offers a generic alternative to Eisai's Aricept.\n\nTwo companies are introducing pilocarpine tablets in 5-mg strength. The product is a generic version of MGI Pharma's Salagen 5-mg tablets. The medication is indicated for the treatment of dry mouth from salivary gland hypofunction caused by radiotherapy for cancer of the head and neck in patients with Sjögren's syndrome. Pilocarpine tablets are available from Alpharma Inc., Fort Lee, N.J., (201) 947-7774 and from Roxane Laboratories, Columbus, Ohio, (614) 272-4774.\n\n### Newsletter\n\n## Related Content\n\n### FDA Approves Roflumilast Cream 0.05% for Atopic Dermatitis in Children 2 to 5\n\n### FDA Quietly Approves Generic Mifepristone Tablet for Abortion\n\n### FDA Approves Remibrutinib for Adults With Chronic Spontaneous Urticaria\n\n### FDA Approves Guselkumab for the Treatment of Pediatric Plaque Psoriasis, Psoriatic Arthritis\n\n### FDA Approves Bumetanide Nasal Spray for Edema Associated With Heart Failure, Liver Disease\n\n## Latest CME\n\n## Infectious Disease Day of Education 2025\n\nOctober 9, 2025 | 10:00 AM EDT – 2:00 PM EDT\n\n## SimulatEd™: Patient-Centered Care to Improve Outcomes in Chronic Lymphocytic Leukemia\n\n1.0 Credit / Hematologic Cancer\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## From Strict Avoidance to Tailored Therapies: Transforming Food Allergy Care\n\n1.5 Credits / Allergy, Immunology\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## The Evolving Strategies for Managing nAMD and DME: Empowering Managed Care Decisions for Improved Patient Outcomes\n\n1.5 Credits / Endocrinology, Diabetes & Metabolism, Ophthalmology/Optometry\n\n## Exploring Immunizations Updates and Strategies for Addressing Vaccine Hesitancy\n\n1.0 Credit / Immunization\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n## The Essential Role of Pharmacists in Improving Influenza Vaccination Coverage: Strategies to Increase Vaccine Uptake and Optimally Utilize Available Vaccines\n\n1.0 Credit / Immunization, Infectious Diseases\n\n## The Latest Updates and Pharmacist Perspectives on RET Inhibitors in Non‒Small Cell Lung Cancer\n\n0.5 Credit / Oncology, Lung Cancer\n\n## Collaborating Across the Continuum™: Identifying and Preventing Hepatic Encephalopathy in Long-Term Care Settings\n\n1.25 Credits / Neurology\n\n## The Role of Pharmacists in Pneumococcal Prevention: Strategies to Improve Vaccine Uptake\n\n1.0 Credit / Immunization, Infectious Diseases, Pulmonology\n\n## Addressing the Unmet Needs in the Management of Myasthenia Gravis: The Role of New and Emerging Therapies\n\n1.5 Credits / Neurology\n\n## Balancing the Burden of Moderate to Severe Atopic Dermatitis in Pediatric Patients: Navigating the Use of Targeted Biologic Therapies and Caregiver Challenges\n\n1.5 Credits / Dermatology, Immunology\n\n## In-Depth Insights and Application in the Management of Immunoglobulin Therapy\n\n1.0 Credit / Neurology, Immunology\n\n## Glucagon for Diabetes: Overcoming Barriers for Optimal Management in the Long-Term Care Setting\n\n## Insights in Influenza Immunization: The Long-Term Care Pharmacist’s Role in Improving Health Outcomes in At-Risk Populations and Vaccine Uptake\n\n## Harnessing the Potential of SGLT2 Inhibitors in Cardiorenal Metabolic Health: Strategies for Long-term Care and Consultant Pharmacists\n\n1.0 Credit / Cardiology, Endocrinology, Diabetes, & Metabolism, Nephrology\n\n## Managing Schizophrenia: Evidence-Based Care and Optimizing Value of New and Emerging Therapies\n\n1.0 Credit / Psychiatry\n\n## Transforming Small Cell Lung Cancer Management With DLL3-Targeted Therapies\n\n1.0 Credit / Oncology, Lung Cancer\n\n## Cytokine Release Syndrome With Bispecific Antibodies: A Pharmacist's Guide to Safe Management\n\n1.0 Credit / Hematologic Cancer, Lung Cancer, Oncology\n\n## A Pharmacist's Guide to the Safe and Effective Management of BTK and BCL-2 inhibitors in Chronic Lymphocytic Leukemia\n\n1.0 Credit / Hematologic Cancer, Oncology\n\n## How Artificial Intelligence Is Transforming Cancer Care: Essential Insights for Oncology Pharmacists\n\n1.0 Credit / Oncology\n\n## Charting the Course: The Pharmacist's Role in Safeguarding Patients From Immune-Related Adverse Events\n\n## Enhancing Endometrial Cancer Management: Highlights of Molecular Insights, Treatment Approaches, and Toxicity Management\n\n1.0 Credit / Gynecologic Cancer, Oncology, Women's Health\n\n## Closing Gaps in CLL Care: Managed Care Insights and Strategies\n\n1.5 Credit / Hematologic Cancer, Oncology",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Pharma deals are surging. But the biggest drugmakers are holding back. | Company Business News",
      "url": "https://www.livemint.com/companies/india-pharma-deals-big-drugmakers-holding-back/amp-11759845923665.html?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.livemint.com/lm-img/img/2025/10/08/600x338/pharma_1759924596072_1759924596176_1759924681199.jpg",
        "1": "https://www.livemint.com/lm-img/subscription/images/gift_article/gift_icon.png"
      },
      "content": "- My Watchlist\n\n- Newsletters\n\n- My Vouchers\n\n- Notifications\n\n- My Reads\n\n- For You\n\n- Market Dashboard\n\n- Bullion Gold Silver\n\n- Gold\n\n- Silver\n\n- Fuel Petrol Diesel\n\n- Petrol\n\n- Diesel\n\n- Commodities Gold GoldM Aluminum Menthaoil Silver SilverMIC GoldPetal Natural Gas Copper Zinc SilverM CrudeOil GoldGinuea Lead\n\n- Gold\n\n- GoldM\n\n- Aluminum\n\n- Menthaoil\n\n- Silver\n\n- SilverMIC\n\n- GoldPetal\n\n- Natural Gas\n\n- Copper\n\n- Zinc\n\n- SilverM\n\n- CrudeOil\n\n- GoldGinuea\n\n- Lead\n\n- Cryptocurrency\n\n- Smart Money\n\n- Today's News India NewsWorld NewsUS News Today\n\n- India News\n\n- World News\n\n- US News Today\n\n- Markets Stock MarketsIPO NewsIPO DashboardMark To MarketBondsCommodity NewsCryptocurrency\n\n- Stock Markets\n\n- IPO News\n\n- IPO Dashboard\n\n- Mark To Market\n\n- Bonds\n\n- Commodity News\n\n- Cryptocurrency\n\n- Companies IPO NewsStart-upsCompany ResultsTop Company Leader\n\n- IPO News\n\n- Start-ups\n\n- Company Results\n\n- Top Company Leader\n\n- Premium\n\n- Money News Personal FinanceQ&AOpinion\n\n- Personal Finance\n\n- Q&A\n\n- Opinion\n\n- Economy\n\n- Technology News GadgetsTech ReviewsApp News\n\n- Gadgets\n\n- Tech Reviews\n\n- App News\n\n- Personal Loan personal loan emi calculatorPersonal Loan Interest RatePersonal Loan EligibilityBusiness LoanInstant Personal Loan\n\n- personal loan emi calculator\n\n- Personal Loan Interest Rate\n\n- Personal Loan Eligibility\n\n- Business Loan\n\n- Instant Personal Loan\n\n- e-paper\n\n- WSJ\n\n- Economist\n\n- Barron's\n\n- Mint Premium\n\n- IFSC Code Finder\n\n- Income Tax Calculator\n\n- SIP Calculator\n\n- EMI Calculator\n\n- Home Loan EMI Calculator\n\n- Car Loan EMI\n\n- NPS Calculator\n\n- Videos\n\n- WebStories\n\n- Photo Gallery\n\n- Podcasts\n\n- Mint Lounge\n\n- Mint Hindi\n\n- Livehindustan\n\n- Hindustan Times\n\n- About Us\n\n- Print Subscription\n\n- Mint Authors\n\n- Terms of Use\n\n- Disclaimer\n\n- Mint Code\n\n- Code of ethics\n\n- Privacy and cookie settings\n\n- SITEMAP\n\n- Contact Us\n\n- Mint Apps\n\n# Pharma deals are surging. But the biggest drugmakers are holding back.\n\n## While India-focused drugmakers are ramping up dealmaking to expand portfolios, access key therapies, and gain scale, US-focused giants like Sun Pharma, Cipla, and Dr. Reddy’s are holding back, opting for selective acquisitions to expand in other geographies.\n\n- While India-focused drugmakers are ramping up dealmaking to expand portfolios, access key therapies, and gain scale, US-focused giants like Sun Pharma, Cipla, and Dr. Reddy’s are holding back, opting for selective acquisitions to expand in other geographies.\n\nDealmaking in India’s pharma sector has surged over the past two years as companies seek to beef up their portfolios and reduce reliance on the US market. Yet, some of the country’s largest drugmakers with billions in cash are holding back.\n\nSun Pharmaceutical Industries Ltd, Cipla Ltd, and Dr Reddy’s Laboratories Ltd that have a strong US focus are striking fewer acquisitions and partnerships as they look for new markets, according to industry experts. On the other hand, pharma companies with a strong India focus have ramped up their dealmaking.\n\nIn July, Torrent Pharmaceuticals Ltd acquired a 46.39% stake in Mumbai-based JB Chemicals and Pharmaceuticals Ltd for ₹11,917 crore. In October last year, Mankind Pharma Ltd bought Mumbai-based Bharat Serums and Vaccines Ltd for ₹13,768 crore.\n\nBut Sun Pharma, Cipla, and Dr Reddy’s—which derive 30-45% of their revenue from selling mostly copycat or generic drugs to the US—are employing a more measured and slow approach even as they sit on large piles of cash. Torrent earns about 55% of its revenue from India and Mankind about 87%.\n\nAs of March, Sun Pharma had net cash of about ₹27,523 crore (roughly $3.1 billion) on its books. Cipla had ₹10,369 crore, and Dr Reddy’s had ₹2,454 crore.\n\nTotal Indian pharma dealmaking this year till the end of September added up to about $2.6 billion across 28 deals. In all of 2024, mergers and acquisitions by Indian drugmakers totaled $4.1 billion across 29 deals.\n\nWhen it comes to the US generic drugs market, companies have turned wary about investing to expand their capacity or acquire assets, said experts.\n\n“Generic companies in India have created large manufacturing capacities. But, unfortunately, these capacities have not created value for them,\" said Vishal Manchanda, pharma analyst at Systematix Group, an investment advisory.\n\n“What has happened over time is that US regulations have got stricter and stricter, which has translated into higher spending (capital and operational expenditure) towards upgrading the quality infrastructure and automation in manufacturing,\" he added. “While costs went up, generic drug pricing in the US chased new lows every year… Indian players incrementally have become selective in their capex spends.\"\n\nAlso, while US President Donald Trump’s recently announced import tariffs on pharmaceuticals exempt generic drugs and are unlikely to make a big dent on dealmaking in India, the new levy could lower valuations for non-US assets, Manchanda said.\n\n“US generics is a commodity like business,\" added Prashant Nair, pharma research analyst at Ambit Capital.\n\nTimelines for US drug regulatory approvals have shrunk from 4 years a decade ago to 12-18 months, allowing new players to enter but making the market prone to price erosion, he said.\n\n“Companies (Indian drugmakers) have had bad experiences in the past with assets they bought at very high multiples, which did not play out well when the cycle turned downward. Stocks got penalized in terms of valuations as well. So that’s the reason why they are a lot more cautious now in this market,\" said Nair.\n\n- Strategic divergence is shaping the sector: India’s pharma industry shows a split path—aggressive expansion by domestic-focused players versus measured, innovation-driven growth by export-heavy giants, highlighting differing risk appetites and market priorities.\n\n- India-focused pharma firms are leading dealmaking: Companies like Torrent and Mankind are aggressively acquiring stakes and partnerships to expand portfolios, gain scale, and access key therapies in the domestic market.\n\n- Big US-focused drugmakers are cautious: Sun Pharma, Cipla, Dr. Reddy’s, and Zydus are holding back despite large cash reserves, citing regulatory costs, pricing pressures, and past overvalued acquisitions as reasons for selective dealmaking.\n\n## Horses for courses\n\nBetween 2021 and 2025, more than half the deals struck by domestic pharma companies have been India-focused, show data shared by Grant Thornton Bharat.\n\nSome of these deals were aimed at gaining scale (the Torrent-JB Chemicals deal, for instance). Some others were struck to either gain access to key therapies (e.g. Eris Lifesciences Ltd acquired the India-branded formulation business of Biocon Biologics for ₹1,242 crore in March 2024) or technology (such as the Mankind-Bharat Serums deal).\n\n“It’s a mix of small and larger size assets. It depends on what the objective is,\" said Ambit Capital’s Nair. “For example, in India, if there’s a big asset available, most companies would look at it because it’s a market that they understand very well. Plus, it’s a branded business, so [it would be] far more sustainable. This gives comfort to deploy more capital in such assets.\"\n\nMeanwhile, companies like Sun Pharma, Cipla, and Dr Reddy’s, are employing a different approach. While they are looking to derisk their business and diversify away from the volatile US generic drugs market, they are waiting for the right assets to make large bets, according to industry experts.\n\nSun Pharma, Dr Reddy’s, and Cipla did not respond to Mint’s queries.\n\nIn January, Dr Reddy’s said during a press briefing that it would focus on building a pipeline of complex drugs, such as weight-loss medications, and biosimilars, which are similar to and typically cheaper than an original biological drug that’s made from living organisms.\n\nThe Hyderabad-based drugmaker has signed several partnerships to strengthen its portfolio in key therapies. It recently acquired anti-vertigo brand Stugeron from Belgium-based Janssen Pharmaceuticals for $50.5 million (about ₹450 crore) to expand its portfolio in emerging markets, including India.\n\nIn September 2024, Dr Reddy’s acquired UK-based Haleon Plc.’s global portfolio of nicotine replacement therapy brands, outside of the US, for £500 million (nearly ₹6,000 crore).\n\nSun Pharma, on the other hand, is looking to buy innovative assets from biotech firms as it seeks to transform into a global specialty pharma company, said industry experts. Earlier this year, it acquired US-based immuno-oncology company Checkpoint Therapeutics for $355 million (about ₹3,150 crore).\n\n“The best novel drug ideas get curated in academic institutions, which biotechs take up for development and the global pharma innovators commercialize them. Sun Pharma is essentially following a similar model as a global innovator with focus on certain therapies (oncology and dermatology),\" said Manchanda of Systematix Group.\n\nSome drugmakers are striking deals to diversify into new segments.\n\nFor instance, Zydus, as part of increasing its focus on medtech, bought French medtech firm Amplitude Surgical earlier this year for €256.8 million (about ₹2,650 crore). And Cipla, which has a strong India business, has been chasing small-ticket acquisitions and licensing partnerships in consumer brands and key therapies.\n\n“They [Cipla] don’t want to kill the cash they have with them,\" said Manchanda. “They are going slow. They are waiting for the right opportunities to come.\"\n\nCorrection: An earlier version incorrectly stated that Torrent and Mankind earned 51-55% of their business from India, and that Bharat Serums and Vaccines was headquartered in Bengaluru.\n\n## Jessica Jani",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Why Are Pharmaceutical Stocks XBIO, UPC, XTLB, & ACXP Up Today? - TipRanks.com",
      "url": "https://www.tipranks.com/news/why-are-pharmaceutical-stocks-xbio-upc-xtlb-acxp-up-today?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://blog.tipranks.com/wp-content/uploads/2025/10/pharmaceuticalstocks-750x406.jpg",
        "1": "https://blog.tipranks.com/wp-content/uploads/2024/11/cropped-William-White-96x96.png",
        "2": "https://blog.tipranks.com/wp-content/uploads/2025/10/image-611-1024x456.png"
      },
      "content": "# Why Are Pharmaceutical Stocks XBIO, UPC, XTLB, & ACXP Up Today?\n\nPharmaceutical stocks are on the rise Wednesday in what appears to be more speculative trading following Galecto’s rally yesterday.\n\nPharmaceutical stocks were on the rise in pre-market trading on Wednesday. Xenetic Biosciences (XBIO), Universe Pharmaceuticals (UPC), XTL Biopharmaceuticals (XTLB), and Acurx Pharmaceuticals (ACXP) shares all experienced massive rallies this morning. However, there wasn’t any solid news behind these stock movements. None of the companies announced press releases or made filings with the Securities and Exchange Commission (SEC) that would explain why they were on the rise.\n\n### Elevate Your Investing Strategy:\n\n- Take advantage of TipRanks Premium at 50% off! Unlock powerful investing tools, advanced data, and expert analyst insights to help you invest with confidence.\n\nEven so, there is one bit of news that might help explain what’s happening with these pharmaceutical stocks. Galecto (GLTO) is a biotechnology company that experienced a massive rally on Tuesday. Its shares closed out normal trading hours up 383.02% and reached beyond 600% during their spike but were down 37.83% in pre-market trading today. Interestingly, there also wasn’t any news that explained why GLTO stock surged.\n\nGalecto’s movement yesterday appears to have been speculative trading. With the stock down today, it seems likely that retail traders have moved on from GLTO stock and are searching for other shares to pump and dump. This likely explains why other pharmaceutical stocks, including XBIO, UPC, XTLB, and ACXP, are soaring on Wednesday.\n\n## XBIO, UPC, XTLB, & ACXP Stock Movements Today\n\nTaking a look at these pharmaceutical stocks, traders will note that today’s pre-market gains weren’t quite as high as what Galecto experienced.\n\n- Xenetic Biosciences stock was up 214.45%.\n\n- Universe Pharmaceuticals stock was up 93.23%.\n\n- XTL Biopharmaceuticals stock was up 95%.\n\n- Acurx Pharmaceuticals stock was up 87.41%.\n\nThese stocks not reaching levels as high as Galecto could be for a variety of reasons. One is the split nature of today’s rally. Speculative traders appear less focused today, targeting multiple stocks rather than putting all of their efforts into a single company.\n\n## XBIO, UPC, XTLB, & ACXP: Which Stock Do Analysts Prefer?\n\nTurning to the TipRanks stock comparison tool, only Xenetic Biosciences and Acurx Pharmaceuticals have attracted significant analyst attention. Xenetic Biosciences has a consensus Hold rating with no price target. Acurx Pharmaceuticals has a consensus Moderate Buy rating with an average price target of $30.50, suggesting a potential 610.96% upside.\n\nSee more pharmaceutical stock comparisons\n\nDisclaimer & DisclosureReport an Issue\n\n## Latest News Feed\n\n## More Articles\n\n## Stock Comparison\n\n## Investment Ideas",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "2026 Key Drug Launches | Evaluate Report",
      "url": "https://www.evaluate.com/thought-leadership/2026-key-drug-launches/?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://www.evaluate.com/wp-content/uploads/2025/10/adobestock_1235947995-scaled.webp",
        "1": "https://www.evaluate.com/wp-content/uploads/2025/10/patent-cliff-chart-768x365.png",
        "2": "https://www.evaluate.com/wp-content/uploads/2025/10/competitive-intelligence-768x402.webp",
        "3": "https://www.evaluate.com/wp-content/uploads/2025/10/pharma-vs-biotech-cover-thumbnail-01-01-768x543.webp",
        "4": "https://www.evaluate.com/wp-content/uploads/2025/09/carolyn-resize-100-768x403.webp"
      },
      "content": "- Report/eBook\n\n# 2026 Key Drug Launches\n\n- October 8, 2025\n\nPrepare for the future of pharma with our report spotlighting the most anticipated late-stage drug launches expected in 2026. From first-in-class therapies to blockbuster contenders, this report delivers the insights you need to stay ahead in a rapidly evolving market.\n\nFeatured Launches Include:\n\n- Takeda’s oveporexton – a first-in-class orexin-2 agonist for narcolepsy\n\n- Amgen’s bemarituzumab – targeting FGFR2b in gastric cancer\n\n- Novo Nordisk’s CagriSema – a dual GLP-1/amylin therapy for obesity\n\n- Moderna’s mRNA-1083 – a pan-respiratory vaccine for COVID-19 & flu\n\n- Orca Bio’s Orca-T – redefining transplant care in hematologic cancers\n\nDownload the report abstract today.\n\nAbout Biomedtracker\n\nEnrich your strategic lens with real-time event tracking and analysis that delivers a full understanding of how major market movements and drug developments could impact the value of your assets.\n\nAbout Datamonitor Healthcare\n\nSupport the development and validation of your strategic commercial plans and ensure your commercial decisions are in line with marketplace realities. Datamonitor Healthcare delivers the latest insights and expert coverage of key disease areas, treatments, drugs, market access, and trends.\n\n## Download Now\n\nShare\n\n## Related Content\n\nUnderstand the context. Data-driven news and analysis for the pharma, biotech and medtech sectors.",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Drivers of vulnerability to medicine smuggling and combat strategies: a qualitative study based on online news media analysis in Iran",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC10976728?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "Extensive financial transactions and exchange rate incentives contribute to medicine smuggling in the pharmaceutical market, as reported in the news.*“Today, the dark shadow over the country’s pharmaceutical industry is the presence of individuals engaging in medicine smuggling, both into and out of the country. They engage in extensive financial transactions, which have allowed the black market, known as* Nasser Khosrow,*’ Street to continue operating vigorously for several years. Whenever a patient despairs of obtaining their necessary medication through official channels, they can easily procure it by visiting the Naser Khosrow market.” (Mehr News Agency)*.\n\nThe news has been highlighting a serious issue where insurance companies are failing to reimburse pharmacies. As a result, pharmacies are losing their purchasing power for medications and patients are being forced to resort to illegal markets to obtain essential medicines.*“Pharmacies lack the purchasing power for specific medications due to insurance debt and economic exhaustion.” (Sepid Online)”*.\n\n### 1-2- medicine procurement\nThe process of obtaining resources through purchase from manufacturers, suppliers, or distributors is known as medicine procurement. In many countries, pharmaceutical expenses make up a significant portion of healthcare costs. Therefore, it is essential to ensure effective medicine procurement to maintain access to medicines and control total healthcare expenditure. However, economic sanctions and black markets in the pharmaceutical sector can pose significant challenges to medicine procurement, making it more susceptible to medicine smuggling.*“The imposition of sanctions has created obstacles for the swift repatriation of revenue generated from medicine sales, thereby presenting difficulties for domestic pharmaceutical companies. Consequently, this circumstance has contributed to a surge in the illicit exportation of domestically manufactured medications, leading to an increase in the smuggling of Iranian drugs across international borders. (Mehr News Agency)*\n*”Rent, corruption, and monopolies create a black market for medicine, where counterfeit drugs are hoarded in hidden warehouses and distributed to the people” (Khabaronline).*\n\nTo enhance equitable medicine procurement, it is essential to provide financial support and strengthen the research and development base of local pharmaceutical manufacturers. By doing so, we can reduce our reliance on medicine imports and promote local production standards. This would mitigate the issue of foreign exchange allocation and address medicine shortages in many cases. Moreover, it would lead to a decrease in demand for illegal medicine markets.*“We are committed to supporting domestic production in the pharmaceutical sector.… Instead of importing drugs at ten times the price, we should strive, with serious assistance from knowledge-based companies, to provide the same quality medication to the people at one-tenth the price.” (Donya-e-Eghtesad Newspaper)*.\n\nAnother solution in the face of sanctions is improving Iran’s banking system for fund transfers during economic sanctions, as reported in the news.*“With the onset of economic sanctions, the issue of financial transactions is seriously discussed, especially for domestic manufacturers that lack a specific mechanism for generating funds.… Import companies have good mechanisms for fund transfers, but domestic industries will undoubtedly face difficulties. Therefore, the improving banking system can be a solution for them.” (Hamshahri Online)*.\n\n*These strategies aim to address the challenges related to medicine procurement, ensuring access to essential medications, and reducing reliance on illegal markets during sanctions.*\n\n### Theme 2: governance and stewardship\nThe theme relates to the responsible and precise management of the well-being and welfare of society. The pharmaceutical sector stewardship performs three main functions, namely policy formulation, regulation mechanisms, and supervisory mechanisms. This theme comprises three sub-themes, including directive strategies and policies, legislation and regulation, and targeted supervision and control.\n\n### 2-1- directive strategies and policies\nThere has been recent media coverage on the issues with the pharmaceutical supply chain, specifically on the illegal diversion of medications from official distribution channels and reverse medicine smuggling through Iran’s borders to neighboring or targeted countries. Several news reports have brought attention to this matter.*“A significant portion of the increase in medicine consumption is related to the leakage of medicine from the official distribution channels and the reverse smuggling of medicines to other countries.” (Hamshahri Online)*.\n\nMoreover, there is insufficient manpower within the Ministry of Health and Medical Education and IFDA to oversee the medicine smuggling. Regarding this issue, a news report mentioned:*“Unfortunately, the Ministry of Health and Medical Education and IFDA is largely understaffed. That is, its workforce is not proportionate to the scale of drug smuggling.” (Khabaronline)*.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "The Evolving World of Pharma Marketing | Pharmacy Times",
      "url": "https://www.pharmacytimes.com/view/the-evolving-world-of-pharma-marketing?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/7325ba49eb651331e6ba06add8f9fc9bff1a0698-604x360.jpg",
        "1": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/3f55244b4d8b80071fa3c6cbc39a1c943e8d3534-5000x3333.jpg?w=350&fit=crop&auto=format",
        "2": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/bjl03idilrgx-PTCE_NSCLC_10-09_Webinar_090525v1_800x385.png",
        "3": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/n228lyn74t59-PTCE_Infectious-Disease-DoE_General-Banners_092525v5_800x385.png",
        "4": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/wa0h5ycg4hu4-PTCE_Hyperglycemia_10-14_Webinar_090525v1_800x385.png"
      },
      "content": "# The Evolving World of Pharma Marketing\n\nPharma companies that shift their attention to what providers, payers, and patients are asking for will profit from the growing worldwide market on preventative care.\n\nPharmaceutical marketing today: It’s about the drugs, not the user\n\nPharmaceutical marketing is big business and it continues to grow at a rapid rate. In fact, the marketing spend in the pharmaceutical sector has increased by nearly 70% in the past 20 years and now totals nearly $30 billion dollars.1\n\nThe question is whether the current approach to pharma marketing will continue to work in the evolving new world of patient advocacy, preventative care, and strong proof of outcomes demands? We believe the future of pharma marketing looks bright.\n\nThose businesses that embrace the power of digital innovation and a customer-first business model will succeed in building more effective interactions, deeper loyalty, and lasting brand preference. Despite the squeeze of cost-control, regulatory restrictions, and global competition, the marketing world of pharma will adapt going forward to focus on the user, not the drugs.\n\nThe one-size-fits all approach won’t work anymore\n\nTraditional marketing strategies in this industry have revolved around vigorous product marketing of the prescription drugs that the decision-makers think will make money. Commercial success is attributed to aggressive digital marketing and promotional activity—usually targeted to the physician.2 Responding to the needs and expectations of patients, providers, and payers hasn’t typically been the top goal, but that’s about to change.\n\nThe current state of pharmaceutical marketing is complex and usually takes 1 of 2 paths: direct-to-consumer or direct-to-provider/payer. Pharmaceutical firms today don’t normally differentiate between these 2 channels.\n\nThey tend to take more of a one-size-fits-all approach. This runs counter to today’s way of thinking, which is all about personalization, customer experience, and targeted omni-channel marketing of the right product, at the right time, to the right user, and using the right media.\n\nThe shift to value-based health care has arrived\n\nOur fast-changing market demands more value than ever before from pharmaceutical manufacturers. In this case, value means more cost efficiency, proven patient outcomes, and greater contribution to the overall health care experience throughout the value chain.\n\nThose pharma companies that shift their attention to what providers, payers, and patients are asking for will profit from the growing worldwide market on preventative care. The key will be becoming a key player in the integrated health management model that ties traditional pharmaceutical marketing into mobile communications, and other online platforms for diagnosis and marketing.3\n\nThe tight regulatory environment surrounding pharmaceutical marketing continues to be a challenge to providing value-based health care. Notably, there is no evidence to suggest that the regulatory landscape for marketing pharmaceuticals will become clearer and easier any time soon.\n\nAn alternative to the heavy regulation of mass-marketing advertising might be found in less traditional, more relationship-focused digital marketing channels that better align with the new environment of patient/provider/payer control, values-based outcomes, chronic disease prevention, the internet as an information gathering tool, and specialized marketing of specialty information to a targeted pool of relevant patients.3\n\nChanging the consumer experience\n\nBy 2050, there will be 2 billion people around the world who are over 60 years of age. As well, the number of seniors (65+ years of age) in the United States is expected to double to 100 million by 2060.4 This aging demographic will boost the market for prescription drug treatments to approximately $1.2 trillion by 2024.4 Without a doubt, demographics is a powerful driver of change.\n\nA multi-disciplinary approach to health care\n\nThe health care system is responding to the evolving trend toward integrated health management by implementing a multi-disciplinary approach to health care. Pharmaceutical companies are responding with personalized and improved offerings that have been fine-tuned to address patients’ specific needs throughout the health care value chain.5\n\nHealth care technology is the key to enabling a patient-centric approach. This approach could perhaps be achieved using predictive analytics tools, powered by artificial intelligence and machine learning to help determine which patients are at the highest risk of hospital readmission.\n\nOr it may be mobile apps and wearables to help monitor patients’ at-home recovery. It could be something as simple as packaging information better and more consistently online to accommodate the evolving ways patients research and consume drug information.6\n\nRegardless of which technologies are used and how they are levered, those pharmaceutical companies who insert themselves into this value chain in a meaningful way with patients, providers, and payers, will build value, trust, and loyalty with their constituents. In doing so, they’ll be miles ahead of the pharmaceutical companies who cling to in-person physician visits and sales sampling that worked in the past.\n\nThe advent of personalized, omnichannel marketing\n\nAs the outcomes-based approach to health care grows in popularity, now is the time for pharmaceutical agencies to benefit from a new personalized, omnichannel approach to marketing. This means enabling different strategies for marketing directly to consumers and in detailing to physicians, as well as payers.\n\nAdvanced pharma marketers are moving into precision marketing, which is all about targeting on digital platforms with custom messaging for a specialty segment of consumers who need the information most.6 Others are experimenting with programmatic advertising, which is a marketing tool that automatically optimizes digital campaigns using machine learning, which serves ads to users based on their online visits and behavior.7\n\nTo be successful with specialty marketing to smaller segments with custom treatment offerings, an investment in technologies to leverage the power of big data is a prerequisite.\n\nDisruptive technologies in pharma marketing\n\nPatients today require a different approach to addressing their health problems. Mobile technologies, social media, the cloud, and the Internet of Things (IoT) are just some of the new realities that are disrupting health care today.8\n\nSavvy pharmaceutical marketers see the opportunity that lies in leveraging tools that can monitor a patient’s health and provide real-time, personalized feedback to help improve outcomes. Making just minor tweaks to the marketing approach, along with taking advantage of disruptive technologies, can have a huge impact on growth and performance.\n\nUnlimited possibilities with personalization and segmentation\n\nFor example, a care plan for a Parkinson’s patient could include a “chip on a pill” to monitor drug-taking. This, along with a smartwatch or other sensor to monitor a patient’s condition, could set the stage for more robust engagement with health care professionals.\n\nOther technologies could provide the ability to send reminders about prescribed treatments and appointments. Such services are likely to improve outcomes beyond the need for expensive specialty drugs. Medication will always play a role in improving patient outcomes, but when it is combined with greater personalization and targeting, there’s no limit to what can be achieved.8\n\nA well thought-out strategy for data analytics and segmentation, customer journey mapping, and omni-channel marketing is what drives customer insights, targeted segment nurturing, and actionable insights that form the basis of powerful relationships and unforgettable experiences.\n\nSocial Marketing: A New Approach\n\nSocial marketing has been successful in delivering public health behavior changes for many years. It is an effective tool in understanding the methods for delivering information in a way that induces behavioral change.\n\nFor pharmaceutical companies, this means taking a holistic view of how to market medicine. They can no longer focus solely on the positive or negative health impacts of taking a drug. Instead, they need to delve more deeply into the social, cultural, economic, and ethical impacts of their medicine, and use these insights to personalize their approach to consumers. For example, if a certain group values preventive and community medicine, pharmaceutical companies must devise approaches to target this group, knowing that traditional pharmaceutical marketing won’t work.\n\nThe right information for the right channel\n\nClose to 85% of patients believe they can take responsibility for their own health and access the online resources they need.8 Nevertheless, the need for pharmaceutical companies to inform and influence patients and other stakeholders is more important than ever.\n\nThe ease of information flow can open up a whole new set of opportunities in marketing. The shift in types of interactions such as virtual care, patient portals, and other online resources can allow pharmaceutical companies to derive value by building advanced digital marketing and engagement capabilities similar to companies in other consumer goods industries.8\n\nAs mentioned above, the regulations for this industry are only becoming tougher as the scrutiny on personal data privacy increases. This will be the biggest obstacle for pharmaceutical companies to overcome in the future.\n\nThe Opportunity\n\nIn order for pharmaceutical companies to continue thriving, they need to engage with patients, who are becoming more aware of their health and are more focused on holistic health outcomes. This means expanding their offerings and capabilities to beyond drugs with a focus on continuous patient outcomes, using behavioral insights to drive how they market specific drugs, and using the appropriate channels to deliver the right information.\n\nBecoming visible, active partners in consumers’ management of their health might feel like an ambitious target at the moment, but technology evolves fast. In just a few years, the early health tech-adopting pharma companies may have earned the right to sit beside consumers in their homes.\n\nInvesting in emerging technologies isn’t without risk. For pharma firms in particular, regulatory considerations do not come without risk. Still, for those firms that embrace the power of technologies and put the customer first, the opportunity is endless.\n\nAbout The Author\n\nAnton Morrison is vice president, Experience & Design, at Appnovation. He has been creating effective digital experiences and strategies for some of the world’s most recognizable brands for over 20 years. His expertise runs seamlessly through design strategy, user experience, with an excellent track record of effective client relationships.\n\nReferences\n\n- https://jamanetwork.com/journals/jama/fullarticle/2720029\n\n- https://pharmaphorum.com/views-analysis-digital/nine-pharma-trends-for-2020/\n\n- https://mccannhealth.com/wp-content/uploads/2015/10/McCann-Health-Pharma-2020-From-Vision-to-Decision.pdf\n\n- https://www.visualcapitalist.com/future-pharma-market/\n\n- https://www.appnovation.com/blog/four-digital-health-trends-set-reinvent-and-re-energise-pharma\n\n- https://www.digitalpharmasummit.ca/wp-content/uploads/2019/12/FPM_Ebook_2020.pdf\n\n- https://www.pharmaceutical-technology.com/comment/pharma-digital-marketing-looks-take-personalised-approach/\n\n- https://www.mckinsey.com/industries/pharmaceuticals-and-medical-products/our-insights/the-road-to-digital-success-in-pharma\n\n### Newsletter\n\n## Related Content\n\n### The Future of FDA Enforcement: How Artificial Intelligence Is Changing Drug Advertising Compliance\n\n### Novel Drug Combo Improves Survival in Patients With Metastatic Castration-Sensitive Prostate Cancer\n\n### CGM-Based Measures Could Improve Detection of Impaired Glucose Regulation\n\n### FDA Approves Cemiplimab as Adjuvant Treatment for Cutaneous Squamous Cell Carcinoma\n\n### Data Suggest Calcium Supplementation Is Not Linked to Dementia Risk in Older Women\n\n## Latest CME\n\n## From Testing to Treatment: Empowering Pharmacists to Overcome Barriers and Optimize Biomarker-Driven Care\n\nOctober 9, 2025 | 1:00 & 8:00 PM EDT\n\n## Infectious Disease Day of Education 2025\n\nOctober 9, 2025 | 10:00 AM EDT – 6:00 PM EDT\n\n## Clinical Presentation of Hyperglycemia With PI3K and AKT Inhibitors\n\nOctober 14, 2025 | 1:00 PM & 8:00 PM ET\n\n## Multidisciplinary Insights to Enhance Biomarker Testing Practices in Non-Small Cell Lung Cancer\n\nOctober 15, 2025 | 7:00 PM EDT\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Translating New Clinical Evidence and Updated Guidelines Into Managed Care Strategies\n\nOctober 21, 2025 | 1:00 PM & 8:00 PM ET\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## Targeting the Root of Autoimmunity in Generalized Myasthenia Gravis: Pharmacist Strategies for Integrating FcRn Therapies Into Specialty Practice\n\nOctober 23, 2025 | 12:00 PM & 8:00 PM EDT\n\n## Utilizing VMAT-2 Inhibitors for the Management of Tardive Dyskinesia: The Role of Long-Term Care Pharmacists\n\nOctober 24, 2025 | 10:15 AM – 11:15 AM PDT\n\n## ASCP 2025 Satellite Symposia\n\nOctober 24-25, 2025\n\n## IL-23 Inhibitors in Psoriasis: Optimizing Access and Patient Outcomes Across Integrated Systems\n\nOctober 28, 2025 | 1:00 PM & 6:00 PM ET\n\n## Effective Strategies to Manage Hyperglycemia When Treating with PI3K and AKT Inhibitors\n\nOctober 28, 2025 | 12:00 PM & 7:00 PM EDT\n\n## AMCP Nexus 2025\n\nOctober 28-29, 2025\n\n## Multidisciplinary Insights and Strategies for Patients Treated With PI3K and AKT Inhibitors to Prevent Hyperglycemia\n\nOctober 30, 2025 | 7:00 PM EDT\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## Collaborating Across the Continuum™: Identifying and Preventing Hepatic Encephalopathy in Long-Term Care Settings\n\n1.25 Credits / Neurology\n\n## The Role of Pharmacists in Pneumococcal Prevention: Strategies to Improve Vaccine Uptake\n\n1.0 Credit / Immunization, Infectious Diseases, Pulmonology\n\n## The Essential Role of Pharmacists in Improving Influenza Vaccination Coverage: Strategies to Increase Vaccine Uptake and Optimally Utilize Available Vaccines",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "The reaction of sponsor stock prices to clinical trial outcomes: An event study analysis The reaction of sponsor stock prices to clinical trial outcomes: An event study analysis",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC9439234?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Literature review\nThe event study is a widely used method of analysis to quantify the financial effects of an event on the price movements of a stock. One of the earliest published event studies was a 1933 student performed for measuring the impact of a stock split [8]. A study by *Fama et al*. [9] proposed a methodology that is in essence the same as that used today, although over the years, it has been modified and refined for different use cases. For example, [10] deals with the issues in performing an event study for daily financial data. A number of survey papers [11-13] have summarized the econometrics of the event study and explored the evolution of its methodologies.\nA variety of types of events have been analyzed in the literature, including mergers and acquisitions [14-16], earnings announcements [17, 18], news headlines [19], financial reporting [20, 21], and stock messages on the Internet [22]. A detailed review of all the existing event studies in the literature is beyond the scope of this work. Instead, we focus on the event study literature that involves clinical trial results, FDA approval, drug failure, product development, and patent application.\nAn event study analysis of 24 clinical trial outcomes [23] found that there were asymmetric market reactions to positive and negative outcomes, i.e., underperformance due to negative events was greater in magnitude than the reaction to positive events. Unlike our findings, they conclude that the magnitude of abnormal returns did not differ by phase or firm classification. Another event study [6] consisting of 98 phase 3 trials and 49 products undergoing FDA advisory panel review sought evidence of insider trading, and found indirect evidence that it was common within the biotechnology sector. A study on the long-term returns around clinical trial results (that is, within 120 days of the event) focused on oncology drugs [24], while another [25] analyzed the market overreaction to clinical trial outcome. Focusing on biotechnology product development for 43 phase-3 trial outcomes, [26] analyzed the relationship between abnormal returns and company size, R&D expenditure, and type of result, while [27] analyzed the impact of drug features (e.g., disease and application type) and company features (e.g., size) on the value of abnormal returns.\nEvent study analyses have also been conducted on FDA approvals [28], pharmaceutical product development [29], drug failures [30], earnings surprises and product news [31], patent infringement [32], and patent application and publication dates in the pharmaceutical industry [33]. More recently, the influence of news of COVID-19 research and development on the biopharmaceutical industries has been analyzed [34], as has the impact of COVID-19 on the stock market [35] and the Indian pharmaceutical industry [36]. S.2 Fig in [pone.0272851.s001] summarizes these literatures.\nOur work focuses specifically on clinical trial outcomes. While some earlier work focuses on clinical trial results, their scope is limited to due to their very small sample sizes (typically fewer than 150 events), while the events span a much shorter time period. Neither does this earlier work analyze the relationship of clinical trial features like phase, trial design, or accrual on abnormal returns. With over 13,000 clinical trial outcomes spanning a 21-year period, the scope of our event study analysis is orders of magnitude larger than those of previous studies, which translates into more accurate inferences about the impact of clinical trial outcomes on stock’s price movements. Moreover, we also analyze how the impact of clinical trial outcomes on sponsor company stock price movements differs over time.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Epistemic Corruption, the Pharmaceutical Industry, and the Body of Medical Science Sismondo Epistemic Corruption",
      "url": "https://pubmed.ncbi.nlm.nih.gov/PMC8028448?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {},
      "content": "## Introduction: Epistemic Corruption\n“Corrupt” and its cognates are old terms with many metaphorical uses. Bodies, fruits and meats are corrupted when they begin to rot, decompose, or otherwise spoil. What is thought pure is corrupted when mixed with something foul or lesser, as when air is made foul by pestilence or smoke, noble lineages are supposedly lessened by poor marriages, or people become less good simply because of the pressures of society. “Each of us is born with a share of purity, predestined to be corrupted by our commerce with mankind, by that sin against solitude” ([3] [1949]).\nIt is only a small step from the introduction of pollution to the perversion of ends, as when a public official is corrupted by money or power for a purpose, to serve some interests rather than others. This is the most familiar kind of corruption today-so common that the metaphor has largely died-in which corrupted office holders and institutions have been captured by outside interests, or perhaps serve only their own interests. Thus there is a United Nations Convention against Corruption, which never needs to explicitly define “corruption,” though it identifies it as involving a constellation of crimes that include bribery, embezzlement, influence peddling, illicit enrichment, etc., ([30]).\nThere can be value in analyzing knowledge systems in terms of all the above and other senses of the metaphor. When a knowledge system importantly loses integrity, ceasing to provide the kinds of trusted knowledge expected of it, or even in some cases when it ceases to establish trust, we can label this *epistemic corruption*. For example, the weaknesses of mathematical models can become entrenched, especially if they are constantly adjusted through curve-fitting, as has been claimed about several epidemiological models of the spread of Covid-19 (e.g., [9]). Or, environmental toxicology may systematically lack information about the risks of a large number of industrial and agricultural chemicals, because powerful entities can control private science (e.g., on fluorinated compounds see [23]) and shape public science (e.g., on glyphosate, see [28]). And, outside the sciences, although many accusations of “fake news” are wide of the mark, large swaths of both social and traditional media are genuinely untrustworthy, whether because of interests that shape the creation or the dissemination of news, or because of inherent weaknesses of systems designed to capture audiences’ attention.\nMy focus here is on how the pharmaceutical industry corrupts medical science. Using its very substantial resources, pharmaceutical companies co-opt medical knowledge systems for their particular interests, interests that conflict with the integrity and at least some of the central goals thought to lie behind medicine. It would seem that the body of medical science is corrupted because some assumed purity-though purity is always notional-has been affected by contact with outside interests.\n",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    },
    {
      "title": "Case Studies | Pharmacy Times",
      "url": "https://www.pharmacytimes.com/view/case-studies-1014?utm_source=valyu.ai&utm_medium=referral",
      "image_url": {
        "0": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/8caeef59f80cc65922c8d847c59531a6b81d5ca2-2551x901.png",
        "1": "https://cdn.sanity.io/images/0vv8moc6/pharmacytimes/fbfd8981f7b652af4195752399c98dca7cfe493f-826x610.png?w=350&fit=crop&auto=format",
        "2": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/bjl03idilrgx-PTCE_NSCLC_10-09_Webinar_090525v1_800x385.png",
        "3": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/n228lyn74t59-PTCE_Infectious-Disease-DoE_General-Banners_092525v5_800x385.png",
        "4": "https://media.thoughtindustries.com/thoughtindustries/image/upload/v1/course-uploads/d2afb412-3c3e-4f73-b3d6-2388078622a3/wa0h5ycg4hu4-PTCE_Hyperglycemia_10-14_Webinar_090525v1_800x385.png"
      },
      "content": "Pharmacy Times\n\n- October 2014 Diabetes\n\n- Volume 80\n\n- Issue 10\n\n# Case Studies\n\nCASE 1\n\nCR, a 44-year-old man, comes to the pharmacy looking for a remedy for his heartburn. He reports that his heartburn has been bothering him for the past few weeks, and he complains of an acidic taste in his mouth and a burning feeling in his throat about twice a week. CR does not complain of any other related symptoms, such as pain when swallowing. CR has a box of omeprazole (Prilosec) in his hand. He asks if it would be the best product to help alleviate his symptoms.\n\nAs the pharmacist, how would you respond?\n\nCASE 2\n\nEF is a 30-year-old woman who comes to the pharmacy with dry, demarcated lesions in linear streaks, with some vesicles, on her hands, arms, and face. She says she was gardening yesterday for a few hours and must have touched poison ivy. EF says she tried to hide it with makeup to go to work this morning, but it only made it worse. She exclaims, “I cannot stand the itching anymore.” Upon questioning, you find out that she has had similar lesions before, but they were less extensive and not as bothersome. EF asks if there is pharmacy product that could help. She has no significant medical history and is not taking any prescription or OTC medications.\n\nAs the pharmacist, what would you recommend?\n\n### ANSWERS\n\nCase 1: Based on his reported symptoms, CR likely suffers from mild/ episodic gastroesophageal reflux disease (GERD), so he is a candidate for self-treatment. OTC proton pump inhibitors (PPIs) such as omeprazole, lansoprazole, and esomeprazole are appropriate for self-treatment of GERD for up to 14 days. However, before you recommend these products, you should educate CR that OTC omeprazole, lansoprazole, and esomeprazole are not intended for immediate relief of heartburn. These drugs have a slow onset but a long duration of action, and CR may have to take one of these drugs for 1 to 4 days before he feels better. CR should be cautioned to speak to his doctor if his symptoms do not resolve after 2 weeks or his heartburn worsens.\n\nAlternatively, CR could try a histamine2 (H2)-receptor antagonist such as ranitidine, cimetidine, famotidine, or nizatidine. H2-receptor antagonists have a different mechanism of action than PPIs and provide relief of heartburn more quickly than PPIs. H2-receptor antagonists can be taken prophylactically before meals to prevent GERD.\n\nCR might also consider taking an antacid, including calcium carbonate, sodium bicarbonate, magnesium hydroxide/aluminum hydroxide, or bismuth subsalicylate. These agents have the fastest onset of action, but they provide only symptomatic relief of heartburn and have the shortest duration of action.\n\nCase 2: Allergic contact dermatitis is an inflammatory skin reaction to a foreign substance, such as urushiol in the sap of the poison ivy plant. Sensitized patients can develop clinical symptoms such as erythema, intense itching, and formation of plaques and vesicles within 4 to 96 hours after exposure to an allergen.\n\nEF appears to have severe contact dermatitis. She is not a candidate for self-treatment because of the facial involvement of her dermatitis and the presence of vesicles and intense itching. If left untreated, allergic contact dermatitis resolves within 1 to 3 weeks; however, it can cause significant discomfort. EF should be referred to her primary care provider to obtain a prescription for an oral corticosteroid, such as prednisone to decrease itching, and perhaps a high-potency topical corticosteroid such as clobetasol propionate 0.05% cream, which is generally not applied to the face. A 21-day course of oral prednisone (starting at 1 mg/kg/day and tapered over 3 weeks) is appropriate and can significantly reduce symptoms, including itching.\n\nEF should be told to keep the area clean and to avoid scratching and using makeup, as they can irritate the skin. In addition, nonpharmacologic treatments, including the application of cold compresses, can be recommended. EF might try using astringents such as aluminum acetate (Burrow’s solution) or calamine to reduce inflammation and promote drying, and healing of the lesions.\n\nRead the answers\n\nfunction showAnswer() {document.getElementById(\"answer\").style.display = 'block';document.getElementById(\"link\").style.display = 'none';}\n\nDr. Coleman is professor of pharmacy practice, as well as codirector and methods chief at Hartford Hospital Evidence-Based Practice Center, at the University of Connecticut School of Pharmacy.\n\n## Articles in this issue\n\nalmost 11 years ago\n\nArticle\n\n### Newsletter\n\n## Related Content\n\n### Tips for Using AI Tools Responsibly During Pharmacy School\n\n### Fun Fact: Researchers Crack the Myth of High Cholesterol and Eggs\n\n### Annual Pharmacy Technician Convention Brings Educational Opportunities, Leadership Development\n\n### Community Pharmacists Can Advance Vaccination in Cancer Care\n\n### Condition Watch: Mental Health\n\n## Latest CME\n\n## From Testing to Treatment: Empowering Pharmacists to Overcome Barriers and Optimize Biomarker-Driven Care\n\nOctober 9, 2025 | 1:00 & 8:00 PM EDT\n\n## Infectious Disease Day of Education 2025\n\nOctober 9, 2025 | 10:00 AM EDT – 6:00 PM EDT\n\n## Clinical Presentation of Hyperglycemia With PI3K and AKT Inhibitors\n\nOctober 14, 2025 | 1:00 PM & 8:00 PM ET\n\n## Multidisciplinary Insights to Enhance Biomarker Testing Practices in Non-Small Cell Lung Cancer\n\nOctober 15, 2025 | 7:00 PM EDT\n\n## Directions in Oncology Pharmacy® 2025: West Coast\n\nThursday, October 16, 2025\n\n## The Expanding Therapeutic Landscape in IgA Nephropathy: Translating New Clinical Evidence and Updated Guidelines Into Managed Care Strategies\n\nOctober 21, 2025 | 1:00 PM & 8:00 PM ET\n\n## The Role of the Pharmacist in Influenza Prevention for At-Risk Adults: Strategies to Enhance Immunization\n\n1.5 Credits / Infectious Diseases\n\n## Targeting the Root of Autoimmunity in Generalized Myasthenia Gravis: Pharmacist Strategies for Integrating FcRn Therapies Into Specialty Practice\n\nOctober 23, 2025 | 12:00 PM & 8:00 PM EDT\n\n## Utilizing VMAT-2 Inhibitors for the Management of Tardive Dyskinesia: The Role of Long-Term Care Pharmacists\n\nOctober 24, 2025 | 10:15 AM – 11:15 AM PDT\n\n## ASCP 2025 Satellite Symposia\n\nOctober 24-25, 2025\n\n## IL-23 Inhibitors in Psoriasis: Optimizing Access and Patient Outcomes Across Integrated Systems\n\nOctober 28, 2025 | 1:00 PM & 6:00 PM ET\n\n## Effective Strategies to Manage Hyperglycemia When Treating with PI3K and AKT Inhibitors\n\nOctober 28, 2025 | 12:00 PM & 7:00 PM EDT\n\n## AMCP Nexus 2025\n\nOctober 28-29, 2025\n\n## Multidisciplinary Insights and Strategies for Patients Treated With PI3K and AKT Inhibitors to Prevent Hyperglycemia\n\nOctober 30, 2025 | 7:00 PM EDT\n\n## Innovations in Diabetes Technology: A New Era of Patient Choice and Opportunities for Pharmacists to Support Insulin Pump Management (Pharmacy Technician Credit)\n\n1.0 Credit / Endocrinology, Diabetes & Metabolism\n\n## Collaborating Across the Continuum™: Identifying and Preventing Hepatic Encephalopathy in Long-Term Care Settings\n\n1.25 Credits / Neurology\n\n## The Role of Pharmacists in Pneumococcal Prevention: Strategies to Improve Vaccine Uptake\n\n1.0 Credit / Immunization, Infectious Diseases, Pulmonology\n\n## The Essential Role of Pharmacists in Improving Influenza Vaccination Coverage: Strategies to Increase Vaccine Uptake and Optimally Utilize Available Vaccines\n\n1.0 Credit / Immunization, Infectious Diseases",
      "source": "News Source",
      "date": "2025-10-09T11:52:12.537Z"
    }
  ],
  "timestamp": 1760010732538
}